{"name":"Action!","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Action!_(programming_language)","description":["Action! is a programming language, with integrated editor, debugger, and 6502 compiler, for the Atari 8-bit family of microcomputers. Action! was created by Clinton Parker and released on cartridge by Optimized Systems Software in 1983. Its syntax is similar to that of ALGOL 68.","Action! is significant for its high performance, which allows games and graphics demos to be written in a high-level language without use of hand-written assembly language code. Action! language constructs were designed to map cleanly to 6502 opcodes.","A development library was available as a separate product called the Action! Toolkit. Action! was used to develop at least two commercial products: the Homepak productivity suite and Games Computers Play client program. The language was never ported to other systems.","In 2007 it inspired Effectus - a cross-compiler currently running on Windows targeting the Atari 8-bit. Effectus resembles Action! syntax and is intended to be as compatible as possible with it.","Action! has three fundamental data types, all of which are numeric.","Internally represented as an unsigned 8-bit integer. Values range from 0 to 255.\nThe CHAR keyword can also be used to declare BYTE variables.","Internally represented as an unsigned 16-bit integer. Values range from 0 to 65,535.","Internally represented as a signed 16-bit integer. Values range from -32,768 to 32,767.","Action! also has ARRAYs, POINTERs and user-defined TYPEs. No floating point support was provided.","An example of a user-defined TYPE:","A \"keyword\" is any word or symbol that the ACTION! compiler recognizes as something special. It can be an operator, a data type name, a statement, or a compiler directive.","Programming in Action! requires working with the editor and compiling\/debugging in the monitor. The editor features a full-screen, scrolling display capable of displaying two windows. The editor also includes block operations and global search and replace. Compiling takes place in the monitor, a mode that allows compiling and debugging.","Action! is a one-pass compiler, which compiles the source code entirely in memory or from a file. This allows great speed, but limits the amount of code that may be compiled.","Local variables are assigned fixed addresses in memory, instead of being allocated on the stack. This enables tight code to be generated for the 6502, but precludes the use of recursion.","The following is example code for Sieve of Eratosthenes written in Action!. In order to increase performance, it disables the ANTIC graphics co-processor, preventing its DMA engine from \"stealing\" CPU cycles during computation."]}