{"name":"AIMMS","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/AIMMS","description":["AIMMS (an acronym for \"Advanced Interactive Multidimensional Modeling System\") is a software system designed for modeling and solving large-scale optimization and scheduling-type problems. It consists of an algebraic modeling language, an integrated development environment for both editing models and creating a graphical user interface around these models, and a graphical end-user environment. AIMMS is linked to multiple solvers through the AIMMS Open Solver Interface. Supported solvers include CPLEX, Gurobi, MOSEK, CBC, Conopt, MINOS, IPOPT, SNOPT and KNITRO.","AIMMS features a mixture of declarative and imperative programming styles. Formulation of optimization models takes place through declarative language elements such as sets and indices, as well as scalar and multidimensional parameters, variables and constraints, which are common to all algebraic modeling languages, and allow for a concise description of most problems in the domain of mathematical optimization. Units of measurement are natively supported in the language, and compile- and runtime unit analysis may be employed to detect modeling errors.","Procedures and control flow statements are available in AIMMS for","To support the re-use of common modeling components, AIMMS allows modelers to organize their model in user model libraries.","AIMMS supports a wide range of mathematical optimization problem types:","Uncertainty can be taken into account in deterministic linear and mixed integer optimization models in AIMMS through the specification of additional attributes, such that stochastic or robust optimization techniques can be applied alongside the existing deterministic solution techniques.","Custom hybrid and decomposition algorithms can be constructed using the GMP system library which makes available at the modeling level many of the basic building blocks used internally by the higher level solution methods present in AIMMS, matrix modification methods, as well as specialized steps for customizing solution algorithms for specific problem types.","Optimization solutions created with AIMMS can be used either as a standalone desktop application or can be embedded as a software component in other applications.","AIMMS is used in a wide range of industries including oil and chemicals, steel production and agribusiness.","Alstom Grid uses AIMMS as the modeling and optimization engine of its energy market clearing software. Together with Alstom Grid, Paragon Decision Technology (the developer of AIMMS) was part of the analytics team of Midwest ISO that won the Franz Edelman Award for Achievement in Operations Research and the Management Sciences of 2011 for successfully applying operations research in the Midwest ISO energy market.","A transportation problem from George Dantzig is used to provide a sample AIMMS model. This problem finds the least cost shipping schedule that meets requirements at markets and supplies at factories. The textual representation of an AIMMS model presents the model as a tree of attributed identifier nodes. It reflects the way in which the model is presented to the modeler in the AIMMS IDE, and is typically generated by the AIMMS IDE."]}