{"name":"ALGOL 58","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/ALGOL_58","description":["ALGOL 58, originally known as IAL, is one of the family of ALGOL computer programming languages. It was an early compromise design soon superseded by ALGOL 60. According to John Backus","ALGOL 58 introduced the fundamental notion of the compound statement, but it was restricted to control flow only, and it was not tied to identifier scope in the way that Algol 60's blocks were.","Bauer attributes the name to Bottenbruch: \"He [Bottenbruch] was also the man who coined at that time the word 'algorithmic language' (algorithmische Sprache) at least in Germany.\"","There were proposals for a universal language by the Association for Computing Machinery (ACM) and also by the GAMM. It was decided to organize a joint meeting to combine them. The meeting took place from May 27 to June 2, 1958, at ETH Zurich and was attended by the following people:","The language was originally proposed to be called IAL (International Algebraic Language) but according to Perlis this was rejected as an \"'unspeakable' and pompous acronym\". ALGOL was suggested instead, though not officially adopted until a year later. The publication following the meeting still used the name IAL. Unresolved disagreements also led to a plan to define two dialects, ALGOL 58 and ALGOL 60[citation needed] but the name ALGOL 60 was eventually used for a specific language .","By the end of 1958 the ZMMD-group had built a working ALGOL 58 compiler for the Z22 computer. ZMMD was an abbreviation for Zürich (where Rutishauser worked), München (workplace of Bauer and Samelson), Mainz (location of the Z22 computer), Darmstadt (workplace of Bottenbruch).","ALGOL 58 saw some implementation effort at IBM, but the effort was in competition with FORTRAN, and soon abandoned. It was also implemented at Dartmouth College on an LGP-30, but that implementation soon evolved into Algol 60. An implementation for the Burroughs 220 called BALGOL evolved along its own lines as well, but retained much of ALGOL 58's original character.","ALGOL 58's primary contribution was to later languages; it was used as a basis for JOVIAL, MAD, NELIAC and ALGO. It was also used during 1959 to publish algorithms in CACM, beginning a trend of using ALGOL notation in publication that continued for many years."]}