{"name":"Amiga E","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Amiga_E","description":["Amiga E, or very often simply E, is a programming language created by Wouter van Oortmerssen on the Amiga. He has since moved on to develop the SHEEP programming language for the new AmigaDE platform and the CryScript language (also known as DOG) used during the development of the video game Far Cry.","Amiga E is a combination of many features from a number of languages, but follows the original C programming language most closely in terms of basic concepts. Amiga E's main benefits are fast compilation (allowing it to be used in place of a scripting language), very readable source code, flexible type system, powerful module system, exception handling (not C++ variant) and Object oriented programming.","A \"hello world\" program in Amiga E looks like:","Amiga E was used to create the core of the popular Amiga graphics software Photogenics.","1993: The first public release of Amiga E.","1997: The last version of Amiga E is released (3.3a).","1999: Unlimited compiler executable of Amiga E is released.","1999: Source code of the Amiga E compiler in M68K assembler is released under the GPL.","1999: First version of CreativE is released. Based on Sourcecode of Amiga E.","1999: First version of PowerD is released. (0.01)","2000: First version of YAEC (Yet Another E Compiler) is released. (1.0)","2001: Final version of CreativE (2.12.3) is released.","2002: Final version of YAEC is released (2.5d).","2002: First public release of ECX. (1.0)","2003: Final version of PowerD is released. (0.20)","2008: First public release of PortablE. (r1)","2009: First public release of PortablE for Windows OS. (r4)","The first compiler, written in M68k assembler. Support tools written in E. Generates M68000 machine code directly.","Based on the GPL sources of Amiga E and adds many extensions to the compiler.","Based on the AmigaE language, but not compatible with it due to changes in syntax.","Written from scratch in E. Uses external assembler and linker.","","A compiler and tools written from scratch in E, can compile itself, supports multiple targets and adds many extensions.","","A meta-compiler written from scratch in E, can compile itself, supports multiple targets."]}