{"name":"AMOS","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/AMOS_(programming_language)","description":["AMOS BASIC is a dialect of the BASIC programming language implemented on the Amiga computer. AMOS BASIC was published by Europress Software and originally written by François Lionet with Constantin Sotiropoulos.","AMOS is a descendant of STOS BASIC for the Atari ST. AMOS BASIC was first produced in 1990.","AMOS competed on the Amiga platform with Acid Software's Blitz BASIC. Both BASICs differed from other dialects on different platforms, in that they allowed the easy creation of fairly demanding multimedia software, with full structured code and many high-level functions to load images, animations, sounds and display them in various ways.","The original AMOS version was interpreted which, whilst working fine, suffered from performance problems. Later, an AMOS compiler was developed that reduced this problem.","To speed up the animation of sprites, AMOS included the AMOS Animation Language (AMAL), a compiled sprite scripting language which runs independently of the main AMOS BASIC program. It was also possible to control screen and \"rainbow\" effects using AMAL scripts.","After the original version of AMOS, Europress released two other versions: Easy AMOS, a simpler version for beginners, and AMOS Professional, a more advanced version with added features, such as a better IDE, ARexx support, a new UI sublanguage and new flow control constructs. Neither of these new versions was significantly more popular than the original AMOS.[citation needed]","AMOS was mostly used to make video games (platformers and graphical adventures) and educational software.","The language was mildly successful within the Amiga community. Its ease of use made it especially attractive to beginners.","Perhaps AMOS BASIC's biggest disadvantage was its incompatibility with the Amiga's operating system functions and interfaces. Instead, AMOS BASIC controlled the computer directly, which caused programs written in it to have a non-standard user interface, and also caused compatibility problems with newer versions of the operating system.","Today the language has declined in popularity along with the Amiga computer for which it was written. Despite this, a small community of enthusiasts are still using it. The source code to AMOS has since been released under a BSD style license by Clickteam - a company that includes the original programmer.","As of July 13, 2011, AMOS Professional has been runnable under UAE using the free AROS-68k AmigaOS replacement ROM created by Jason McMullan and Toni Wilen. A legal, out-of-the-box installer has been created for Microsoft Windows using WinUAE."]}