{"name":"AMPL","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/AMPL","description":["AMPL, an acronym for \"A Mathematical Programming Language\", is an algebraic modeling language for describing and solving high-complexity problems for large-scale mathematical computation (i.e. large-scale optimization and scheduling-type problems). It was developed by Robert Fourer, David Gay and Brian Kernighan at Bell Laboratories. AMPL supports dozens of solvers, both open source and commercial, including CBC, CPLEX, FortMP, Gurobi, MINOS, IPOPT, SNOPT and KNITRO. Problems are passed to solvers as nl files. AMPL is used by more than a hundred corporate clients. It is also used by government agencies and academic institutions.","One particular advantage of AMPL is the similarity of its syntax to the mathematical notation of optimization problems. This allows for a very concise and readable definition of problems in the domain of optimization. Many modern solvers available on the NEOS server hosted at the Argonne National Laboratory accept AMPL input. According to the NEOS statistics AMPL is the most popular format for representing mathematical programming problems.","AMPL features a mixture of declarative and imperative programming styles. Formulation of optimization models takes place through declarative language elements such as sets, scalar and multidimensional parameters, decision variables, objectives and constraints, which allow for a concise description of most problems in the domain of mathematical optimization.","Procedures and control flow statements are available in AMPL for","To support re-use and simplify construction of large-scale optimization problems, AMPL allows separation of model and data.","AMPL supports a wide range of problem types, among them:","AMPL invokes a solver in a separate process which has the following advantages:","Interaction with the solver is done through a well-defined nl interface.","AMPL is available for many popular 32- and 64-bit platforms including Linux, Mac OS X and Windows. The translator itself is a proprietary software currently maintained by AMPL Optimization LLC. However there exist several online services providing free modeling and solving facilities using AMPL. Also a free student version with limited functionality is available.","The AMPL Solver Library (ASL) which allows to read the nl files and provides the automatic differentiation functionality is open-source. It is used in many solvers to implement AMPL connection.","This table present significant steps in AMPL history.","A transportation problem from George Dantzig is used to provide a sample AMPL model. This problem finds the least cost shipping schedule that meets requirements at markets and supplies at factories.","Dantzig, G B, Chapter 3.3. In Linear Programming and Extensions. Princeton University Press, Princeton, New Jersey, 1963."]}