{"name":"Arden Syntax","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Arden_Syntax","description":["The Arden syntax is an artificial intelligence (AI) frame-based grammar for representing and processing medical conditions and recommendations as \"Medical Logic Modules (MLMs)\", used in Medical algorithms.[dubious – discuss]","Medical logic modules are written in Arden syntax, and are called by a program - an event monitor - when the condition they are written to help with occurs. Arden syntax was formerly a standard under ASTM, and is now part of HL7.","The Regenstrief Institute, Inc. uses Arden Syntax MLMs in its CARE system to deliver reminders or hints to clinicians regarding patient treatment recommendations (e.g. the next clinic appointment, based on rules applied to the digitized notes and pertinent patient data stored in the system. Regenstrief Institute is an international non-profit medical research organization with one of the world's largest brain trusts of physician Medical Informaticians as well as Health Services Researchers. Additionally, LDS hospital in Salt Lake City (HELP System...) has contributed much to this standard as well as body of knowledge.","Arden Syntax and its first applications were conceived and developed as the primary deliverables of a multimillion-dollar joint research and development (R&D) program between Columbia Presbyterian Medical Center (CPMC) in New York City and IBM Health Industry Marketing in Atlanta, Georgia from 1989-1993. IBM provided program funding, S\/370 mainframe hardware, software, peripheral equipment, and other materials for the work, and program management oversight of the collaborative effort.","IBM's artificial intelligence product, KnowledgeTool, provided the original basis for MLM syntax representation and processing, as enhanced and applied by CPMC researchers Drs. James J. Cimino, George Hripcsak, Steve Johnson, Carol Friedman, and others at CPMC, under the leadership of Dr. Paul D. Clayton. In a related effort under the same program, another prototype implementation of the syntax was developed by Peter Ludemann using Quintus Prolog. IBM program management and AI technology services were provided by Terry Rankin, Pete Smith, and Eddie Sanders.","The name, \"Arden Syntax\", was adopted from Arden House, located about 90 minutes north of Manhattan in Orange County, New York. Originally purchased by Edward Henry (E. H.) Harriman in 1885, the estate was given to Columbia University by his son William Averell Harriman in 1950 following its use by the Navy in World War II. The house and grounds became a National Historic Landmark in 1966, and it is now a conference center. During the five-year IBM\/CPMC R&D program, conferences and working sessions were hosted and led by CPMC at Arden House and attended by medical informaticians from several leading universities and hospitals, IBM personnel, and others directly or indirectly involved in the program. The \"Arden Syntax\" name was chosen in recognition of important milestones achieved at Arden House in the development and refinement of the syntax and its implementation.","Can someone post a link to an example of this?"]}