{"name":"MaxScript","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Autodesk_3ds_Max","description":["Autodesk 3ds Max, formerly 3D Studio Max, is 3D computer graphics software for making 3D animations, models, and images. It was developed and produced by Autodesk Media and Entertainment. It has modeling capabilities, a flexible plugin architecture and can be used on the Microsoft Windows platform. It is frequently used by video game developers, TV commercial studios and architectural visualization studios. It is also used for movie effects and movie pre-visualization.","In addition to its modeling and animation tools, the latest version of 3ds Max also features shaders (such as ambient occlusion and subsurface scattering), dynamic simulation, particle systems, radiosity, normal map creation and rendering, global illumination, a customizable user interface, and its own scripting language.","The original 3D Studio product was created for the DOS platform by the Yost Group and published by Autodesk. After 3D Studio DOS Release 4, the product was rewritten for the Windows NT platform, and renamed \"3D Studio MAX.\" This version was also originally created by the Yost Group. It was released by Kinetix, which was at that time Autodesk's division of media and entertainment. Autodesk purchased the product at the second release mark of the 3D Studio MAX version and internalized development entirely over the next two releases. Later, the product name was changed to \"3ds max\" (all lower case) to better comply with the naming conventions of Discreet, a Montreal-based software company which Autodesk had purchased. At release 8, the product was again branded with the Autodesk logo, and the name was again changed to \"3ds Max\" (upper and lower case). At release 2009, the product name changed to \"Autodesk 3ds Max\".","Many recent films have made use of 3ds Max, or previous versions of the program under previous names, in CGI animation, such as Avatar and 2012, which contain computer generated graphics from 3ds Max alongside live-action acting.","3ds Max has also been used in the development of 3D computer graphics for a number of video games.","Architectural and engineering design firms use 3ds Max for developing concept art and previsualization.","Educational programs at secondary and tertiary level use 3ds Max in their courses on 3D computer graphics and computer animation. Students in the FIRST competition for 3d animation are known to use 3ds Max, as well as students who attend Southwest Open School (SWOS), a charter high school in southwest Colorado.","Polygon modeling is more common with game design than any other modeling technique as the very specific control over individual polygons allows for extreme optimization. Usually, the modeler begins with one of the 3ds max primitives, and using such tools as bevel and extrude, adds detail to and refines the model. Versions 4 and up feature the Editable Polygon object, which simplifies most mesh editing operations, and provides subdivision smoothing at customizable levels.","Version 7 introduced the edit poly modifier, which allows the use of the tools available in the editable polygon object to be used higher in the modifier stack (i.e., on top of other modifications)","An alternative to polygons, it gives a smoothed out surface that eliminates the straight edges of a polygon model. NURBS is a mathematically exact representation of freeform surfaces like those used for car bodies and ship hulls, which can be exactly reproduced at any resolution whenever needed. With NURBS, a smooth sphere can be created with only one face.","The non-uniform property of NURBS brings up an important point. Because they are generated mathematically, NURBS objects have a parameter space in addition to the 3D geometric space in which they are displayed. Specifically, an array of values called knots specifies the extent of influence of each control vertex (CV) on the curve or surface. Knots are invisible in 3D space and you can't manipulate them directly, but occasionally their behavior affects the visible appearance of the NURBS object. Parameter space is one-dimensional for curves, which have only a single U dimension topologically, even though they exist geometrically in 3D space. Surfaces have two dimensions in parameter space, called U and V.[citation needed]","NURBS curves and surfaces have the important properties of not changing under the standard geometric affine transformations (Transforms), or under perspective projections. The CVs have local control of the object: moving a CV or changing its weight does not affect any part of the object beyond the neighboring CVs. (You can override this property by using the Soft Selection controls.) Also, the control lattice that connects CVs surrounds the surface. This is known as the convex hull property.[citation needed]thi is not a softwaer its a 3d max","Surface tool was originally a 3rd party plugin, but Kinetix acquired and included this feature since version 3.0.[citation needed] The surface tool is for creating common 3ds Max splines, and then applying a modifier called \"surface.\" This modifier makes a surface from every 3 or 4 vertices in a grid. This is often seen as an alternative to \"mesh\" or \"nurbs\" modeling, as it enables a user to interpolate curved sections with straight geometry (for example a hole through a box shape). Although the surface tool is a useful way to generate parametrically accurate geometry, it lacks the \"surface properties\" found in the similar Edit Patch modifier, which enables a user to maintain the original parametric geometry whilst being able to adjust \"smoothing groups\" between faces.[citation needed]","This is a basic method, in which one models something using only boxes, spheres, cones, cylinders and other predefined objects from the list of Predefined Standard Primitives or a list of Predefined Extended Primitives. One may also apply boolean operations, including subtract, cut and connect. For example, one can make two spheres which will work as blobs that will connect with each other. These are called metaballs.[citation needed]","Earlier versions (up to and including 3D Studio Max R3.1) required a special copy protection device (called a dongle) to be plugged into the parallel port while the program was run, but later versions incorporated software based copy prevention methods instead. Current versions require online registration.","Due to the high price of the commercial version of the program, Autodesk also offers a free student version, which explicitly states that it is to be used for \"educational purposes only\". The student version has identical features to the full version, but is only for single use and cannot be installed on a network."]}