{"name":"AutoIt","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/AutoIt","description":["AutoIt (pronounced aw-tow-it) is a freeware automation language for Microsoft Windows. In its earliest release, the software was primarily intended to create automation scripts (sometimes called macros) for Microsoft Windows programs but has since grown to include enhancements in both programming language design and overall functionality.","With the release of Version 3, the syntax of AutoIt has been restructured to be more like the BASIC family of languages. It is a third-generation programming language using a classical data model, utilizing a variant data type that can store several types of data, including arrays. It is compatible with Windows 95, 98, ME, NT4, 2000, XP, 2003, Vista and Windows 7 (however, support for operating systems older than Windows 2000 was discontinued with the release of v3.3.0).","An AutoIt automation script can be compiled into a compressed, stand-alone executable which can be run on computers that do not have the AutoIt interpreter installed. A wide range of function libraries (known as UDF's, or \"User Defined Functions\") are also included as standard or are available from the website to add specialized functionality. AutoIt is also distributed with an IDE based on the free SciTE editor. The compiler and help text are fully integrated and provide a de facto standard environment for developers using AutoIt.","(This can be worked around through the use of such things as multiple processes, Component Object Model etc. but it would be much less onerous if a multithreading API was provided for use within the language itself or its libraries.)","AutoIt can be used to produce utility software for Microsoft Windows and automate common tasks, such as website monitoring, network monitoring, disk defragging and backup. It is also used to simulate application users, whereby an application is driven by an AutoIt script in place of manual application control during software testing. It is also commonly used for developing Computer game bots, for automating in-game tasks, although the AutoIt community will not give support for such automation.","The developers of AutoIt originally released the source code under the GPL license but the practice was discontinued beginning with version 3.2.0 in August 2006. Some of the code from version 3.1 was used to create a fork by the AutoHotkey project, where now the community is continuing to develop the code as GPL."]}