{"name":"bc","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Bc_(programming_language)","description":["bc, for basic calculator, is \"an arbitrary precision calculator language\" with syntax similar to the C programming language. bc is typically used as either a mathematical scripting language or as an interactive mathematical shell.","A typical interactive usage is typing the command bc on a Unix command prompt and entering a mathematical expression, such as (1 + 3) * 2, whereupon 8 will be output. While bc can work with arbitrary precision, it actually defaults to zero digits after the decimal point - so the expression 2\/3 yields 0. This can surprise new bc users unaware of this fact. The \"-l\" option to bc sets the default scale (digits after the decimal point) to 20, and adds several additional mathematical functions to the language.","Bc first appeared in Version 6 Unix in 1975, and was written by Robert Morris and Lorinda Cherry of Bell Labs. Bc was preceded by dc, an earlier arbitrary precision calculator written by the same authors. Dc could do arbitrary-precision calculations, but its reverse polish notation syntax was inconvenient for users, and therefore Bc was written as a front-end to Dc. Bc was a very simple compiler (a single yacc source file with a few hundred lines) which converted the new, C-like, bc syntax into dc's reverse polish notation, and piped the results through dc.","In 1991, POSIX rigorously defined and standardized bc. Two implementations of this standard survive today: The first is the traditional Unix implementation, a front-end to dc, which survives in Unix and Plan 9 systems. The second is the free software GNU bc, first released in 1991 by Philip A. Nelson. The GNU implementation has numerous extensions beyond the POSIX standard, and is no longer a front-end to dc (it is a bytecode interpreter).","The POSIX standardized bc language is traditionally written as a program in the dc programming language to provide a higher level of access to the features of the dc language without the complexities of dc's terse syntax.","In this form, the bc language contains single letter variable, array and function names and most standard arithmetic operators as well as the familiar control flow constructs, (if(cond)..., while(cond)... and for(init;cond;inc)...) from C. Unlike C, an if clause may not be followed by an else.","Functions are defined using a define keyword and values are returned from them using a return followed by the return value in parentheses. The auto keyword (optional in C) is used to declare a variable as local to a function.","All numbers and variable contents are arbitrary precision numbers whose precision (in decimal places) is determined by the global scale variable.","The numeric base of input (in interactive mode), output and program constants may be specified by setting the reserved ibase (input base) and obase (output base) variables.","Output is generated by deliberately not assigning the result of a calculation to a variable.","Comments may be added to bc code by use of the C \/* and *\/ (start and end comment) symbols.","The following POSIX bc operators behave exactly like their C counterparts:","+ - * \/","+= -= *= \/=","++ -- < >","==  != =","( ) [ ] { }","The modulus operators:"," %  %=","... behave exactly like their C counterparts only when the global scale variable is set to 0, i.e. all calculations are integer-only. When scale is greater than 0 the modulus is calculated relative to the smallest positive value greater than zero.","The operators:","^ ^=","... resemble the C bitwise exclusive-or operators, but are in fact the bc integer exponentiation operators.","The bitwise, boolean and conditional operators:","& | ^ && ||","&= |= ^= &&= ||=",">","=","?:","... are not available in POSIX bc.","The sqrt() function for calculating square roots is POSIX bc's only built-in mathematical function. Other functions are available in an external standard library.","The scale() function for determining the precision (as with the scale variable) of its argument and the length() function for determining the number of significant decimal digits in its argument are also built-in.","bc's standard math library (defined with the -l option) contains functions for calculating sine, cosine, arctangent, natural logarithm, the exponential function and the two parameter Bessel function J. Most standard mathematical functions (including the other inverse trigonometric functions) can be constructed using these. See external links for implementations of many other functions.","The -l option changes the scale to 20 (source), so things such as modulo may work unexpectedly. For example, write \"bc -l\" and then the command \"print 3%2\" outputs 0, instead of 1. But if you do it like \"bc -l\", \"scale=0\" and then the command \"print 3%2\" has 1 as output.","Plan 9 bc is just like POSIX bc but for an additional print statement.","GNU bc derives from the POSIX standard and includes many enhancements. It is entirely separate from dc-based implementations of the POSIX standard and is instead written in C. Nevertheless, it is fully backwards compatible as all POSIX bc programs will run unmodified as GNU bc programs.","GNU bc variables, arrays and function names may contain more than one character, some more operators have been included from C, and notably, an if clause may be followed by an else.","Output is achieved either by deliberately not assigning a result of a calculation to a variable (the POSIX way) or by using the added print statement.","Furthermore, a read statement allows the interactive input of a number into a running calculation.","In addition to C-style comments, a # character will cause everything after it until the next new-line to be ignored.","The value of the last calculation is always stored within the additional built-in last variable.","The following logical operators are additional to those in POSIX bc:","&& ||  !","... and are available for use in conditional statements (such as within an if statement). Note, however, that there are still no equivalent bitwise or assignment operations.","All functions available in GNU bc are inherited from POSIX. No further functions are provided as standard with the GNU distribution.","Since the bc ^ operator only allows an integer power to its right, one of the first functions a bc user might write is a power function with a floating point exponent. Both of the below assume the standard library has been included:","Calculate Pi using the builtin arctangent function, a().","Because the syntax of bc is similar to that of C, published numerical functions written in C can often be translated into BC quite easily, which immediately provides the arbitrary precision of BC. For example, in the Journal of Statistical Software (July 2004, Volume 11, Issue 5), George Marsaglia published the following C code for the cumulative normal distribution:","With some necessary changes to accommodate bc's different syntax, and realizing that the constant \"0.9189...\" is actually log(2*PI)\/2, this can be translated to the following GNU bc code:","bc can be used non-interactively, with input via a pipe. This is useful inside shell scripts. For example:","In contrast, note that the bash shell only performs integer arithmetic, e.g.:"]}