{"name":"Bourne shell","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Bourne_shell","description":["The Bourne shell (sh) was the default Unix shell of Unix Version 7. Most Unix-like systems continue to have \/bin\/sh—which will be the Bourne shell, or a symbolic link or hard link to a compatible shell—even when other shells are used by most users.","Developed by Stephen Bourne at AT&T Bell Laboratories, it was a replacement for the Thompson shell, whose executable file had the same name—sh. It was released in 1977 in the Version 7 Unix release distributed to colleges and universities. Although it is used as an interactive command interpreter, it was always intended as a scripting language and contains all the features that are commonly considered to produce structured programs.","It gained popularity with the publication of The UNIX Programming Environment by Brian W. Kernighan and Rob Pike—the first commercially published book that presented the shell as a programming language in a tutorial form.","The shell was designed as a replacement for the Mashey shell.","Among the primary goals were:","Features of the UNIX Version 7 Bourne shell include:","The Bourne shell also was the first to feature the convention of using file descriptor 2> for error messages, allowing much greater programmatic control during scripting by keeping error messages separate from data.","Stephen Bourne carried into this shell some aspects of the ALGOL 68C compiler that he had been working on at Cambridge University. Notably he reused portions of ALGOL 68's \"if ~ then ~ elif ~ else ~ fi\", \"case ~ in ~ esac\" and \"for ~ while ~ do ~ od\" (using done instead of od) clauses in the common Unix Bourne shell syntax. Moreover - although the v7 shell is written in C - Bourne took advantage of some macros to give the C source code an ALGOL 68 flavor. These macros (along with the finger command distributed in Unix version 4.2BSD) inspired the IOCCC - International Obfuscated C Code Contest.","Over the years, the Bourne shell was enhanced at AT&T. The various variants are thus called like the respective AT&T Unix version it was released with (some important variants being Version7, SystemIII, SVR2, SVR3, SVR4). As the shell was never versioned, the only way to identify it was testing its features.","Features of the Bourne shell versions since 1979 include:","The Bourne shell has been criticized for its shortcomings compared to the C shell.","The Korn shell (ksh) written by David Korn, was a middle road between the Bourne shell and the C shell. Its syntax was chiefly drawn from the Bourne shell, while its job control features resembled those of the C shell. The functionality of the original Korn Shell (known as ksh88 from the year of its introduction) was used as a basis for the POSIX shell standard. A newer version, ksh93, has been open source since 2000 and is used on some Linux distributions. There is also a clone of ksh88 known as pdksh, and this is the default shell for all users of OpenBSD.","Bash (the Bourne-Again shell) was later developed for the GNU project. Bash incorporates features from the Bourne shell, csh, and ksh. Bash is the default shell for OS X, Cygwin, and most Linux distributions.","rc was created at Bell Labs by Tom Duff as a replacement for sh for Version 10 Unix. It is the default shell for Plan 9 from Bell Labs. It has been ported to UNIX as part of Plan 9 from User Space.","Due to copyright issues surrounding the Bourne Shell as it was used in historic CSRG BSD releases, Kenneth Almquist developed a clone of the Bourne Shell, known by some as the Almquist Shell and available under the BSD license, which is in use today on some BSD descendants and in low-memory situations. The Almquist Shell was ported to Linux, and the port renamed the Debian Almquist shell, or dash. This shell provides much faster execution of standard sh scripts with a smaller memory footprint than its more common counterpart, bash. Its use tends to expose bashisms - bash-centric assumptions made in scripts meant to run on sh.","The Bourne shell was once standard on all branded Unix systems, although historically BSD-based systems had many scripts written in csh. Bourne shell scripts can typically be run with bash or dash on GNU\/Linux or other Unix-like systems.","On many Linux systems, \/bin\/sh is a symbolic or hard link to Bash. However, for efficiency, some Linux systems (such as Ubuntu) link \/bin\/sh to dash instead."]}