{"name":"Clean","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Clean_(programming_language)","description":["In computer science, Clean is a general-purpose purely functional computer programming language.","The language Clean first appeared in 1987 and is still further developed; it shares many properties with Haskell: referential transparency, list comprehension, guards, garbage collection, higher order functions and currying and lazy evaluation.","An integrated development environment (IDE) is included in the Clean distribution.","Clean's method for dealing with mutable state and I\/O is done through a uniqueness typing system, in contrast to Haskell's use of monads. \"The uniqueness type system also allows the Clean compiler to generate efficient code because uniquely attributed data structures can be destructively updated.\"","Hello world:","Factorial:","Factorial:","Fibonacci sequence:","Infix operator:","The type declaration states that the function is a right associative infix operator with priority 8: this states that x*x^(n-1) is equivalent to x*(x^(n-1)) as opposed to (x*x)^(n-1); this operator is pre-defined in the Clean standard environment.","Computation is based on graph rewriting and reduction. Constants such as numbers are graphs and functions are graph rewriting formulas. This, combined with compilation to native code, makes Clean programs relatively fast, even with high abstraction.[citation needed]","Earlier Clean system versions were written completely in C, thus avoiding bootstrapping issues.","Clean is available for Microsoft Windows. It is also available with limited input\/output capabilities and without the \"Dynamics\" feature for Apple Macintosh, Solaris and Linux.","Clean is dual licensed: it is available under the terms of the GNU LGPL, and also under a proprietary license.","Some state that Clean is faster than Haskell, but other research show that this depends on the kind of program that is tested.","The syntax of Clean is very similar to Haskell, with some notable differences:"]}