{"name":"Clipper","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Clipper_(programming_language)","description":["Clipper is a computer programming language that is used to create software programs that originally operated primarily under DOS. Although it is a powerful general-purpose programming language, it was primarily used to create database\/business programs.","Clipper was originally created in 1985 as a compiler for dBASE III, a very popular database language at the time. Compiling dBASE code changes it from interpreted code, which must be interpreted every time each line of code is executed, to p-code, which uses a Virtual Machine to process the compiled p-code. p-code is considerably faster, but still not as fast as the machine code generated by native compilers. As a technical marketing ploy, the p-code was wrapped into object code (linkable .obj files) which gave the impression that it was compiled to native code. Clipper was created by Nantucket Corporation led by Barry ReBell (political) and Brian Russell (technical), and later sold to Computer Associates. GrafX Software licensed CA-Clipper in 2002 from CA for ongoing marketing and distribution.","As the product matured, it remained a DOS tool for many years, but added elements of the C programming language and Pascal programming language, as well as OOP, and the code-block data-type (hybridizing the concepts of dBase macros, or string-evaluation, and function pointers), to become far more powerful than the original. Nantucket's Aspen project later matured into the Windows native-code Visual Objects compiler.","The Clipper language is being actively implemented and extended by multiple organizations\/vendors, like XBase++ from Alaska Software and FlagShip, as well as free (GPL-licensed) projects like Harbour and xHarbour.","Many of the current implementations are portable (DOS, Windows, Linux (32- and 64-bit), Unix (32- and 64-bit), and Mac OS X), supporting many language extensions, and have greatly extended runtime libraries, as well as various Replaceable Database Drivers (RDD) supporting many popular database formats, like DBF, DBTNTX, DBFCDX (FoxPro, Apollo and Comix), MachSix (SIx Driver and Apollo), SQL, and more. These newer implementations all strive for full compatibility with the standard dBase\/xBase syntax, while also offering OOP approaches and target-based syntax such as SQLExecute().","The Clipper Usenet newsgroups are comp.lang.clipper and comp.lang.clipper.visual-objects.","A simple hello world - application:","A simple data base input mask:","The various versions of Clipper were","From Nantucket Corporation; the \"seasonal versions\", billed as \"dBase compilers\"","From Nantucket Corporation; Clipper 5","and from Computer Associates; CA-Clipper 5"]}