{"name":"CoffeeScript","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/CoffeeScript","description":["CoffeeScript is a programming language that transcompiles to JavaScript. The language adds syntactic sugar inspired by Ruby, Python and Haskell to enhance JavaScript's brevity and readability, and add more sophisticated features like list comprehension and pattern matching. CoffeeScript compiles predictably to JavaScript and programs can be written with less code, typically 1\/3 fewer lines, with no effect on runtime performance. Since March 16, 2011, CoffeeScript has been on GitHub's list of most-watched projects, and as of 24 May 2012 is the tenth most popular language on GitHub.","The language has a relatively large following in the Ruby community. CoffeeScript support is included in Ruby on Rails version 3.1. Additionally, Brendan Eich has referenced CoffeeScript as an influence on his thoughts about the future of JavaScript.","On December 13, 2009, Jeremy Ashkenas made the first Git commit of CoffeeScript with the comment: \"initial commit of the mystery language.\" The compiler was written in Ruby. On December 24, he made the first tagged and documented release, 0.1.0. On February 21, 2010, he committed version 0.5, which replaced the Ruby compiler with one written in pure CoffeeScript. By that time the project had attracted several other contributors on GitHub, and was receiving over 300 page hits per day.","On December 24, 2010, Ashkenas announced the release of stable 1.0.0 to Hacker News, the site where the project was announced for the first time.","Many JavaScript statements are usable as expressions in CoffeeScript, for example if, switch and for. These control statements also have postfix versions.","A general principle is that many unnecessary parentheses and braces can be dropped because indention can be used instead of braces to denote blocks of code, function calls are implicit (the parentheses needed for a function call in JavaScript can be dropped), object literals are often detected automatically and so on.","A common JavaScript snippet using the jQuery library is","Or even just","In CoffeeScript, the function keyword is replaced by the -> symbol, and indentation is used instead of curly braces, as in other off-side rule languages such as Python and Haskell. Also, parentheses can usually be omitted. Thus, the CoffeeScript equivalent of the snippet above is","Or","Or just","The CoffeeScript compiler has been written in CoffeeScript since version 0.5 and is available as a Node.js utility; however, the core compiler does not rely on Node.js and can be run in any JavaScript environment. One alternative to the Node.js utility is the Coffee Maven Plugin, a plugin for the popular Apache Maven build system. The plugin uses the Rhino JavaScript engine written in Java.","The official site at CoffeeScript.org has a \"Try CoffeeScript\" button in the menu bar; clicking it opens a modal window in which users can enter CoffeeScript, see the JavaScript output, and run it directly in the browser. The js2coffee site provides bi-directional translation."]}