{"name":"GraphTalk","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Computer_Sciences_Corporation","description":["Computer Sciences Corporation (CSC) (NYSE: CSC) is an American multinational provider of information technology (IT) and professional services headquartered in Falls Church, Virginia, USA. CSC predominantly provides IT Services in the following areas: systems integration and professional services; enterprise application development and management; application software for the financial services industry; business process outsourcing; managed hosting services; and application and IT infrastructure outsourcing. CSC's consulting and professional services include advising clients on the acquisition and utilization of IT and on business strategy, security, modeling, simulation, engineering, operations, change management and business process reengineering. CSC serves Fortune Global 1000 companies in fifteen industries and national and local governments. It employs about 93,000 people in 90 countries and ranks among the largest outsourcing companies in the world.","On September 28, 2009, when Xerox acquired Affiliated Computer Services, Computer Sciences Corporation became the only remaining, independent major outsourcing vendor with headquarters and major operations in the US.","CSC was founded in April 1959 by Roy Nutt, Fletcher Jones and Bob Patrick. Their goal was to provide programming tools such as assemblers and compilers. Jones, who ran the business and its marketing, obtained a contract from Honeywell that made the business profitable and respected within the industry. Although its competitor Computer Usage Company had been founded earlier in 1955, by 1963 CSC became the largest software company in the United States and took the business public with an IPO listed on the American Stock Exchange. By the end of 1968, CSC was listed on the New York Stock Exchange and had operations in Canada, India, the United Kingdom, Germany, Spain, Italy, Brazil, and the Netherlands.","Since its beginnings in 1959, company headquarters had been in California. On January 30, 2008 the company announced that it would move its corporate headquarters from El Segundo to Falls Church, Virginia.","CSC has been a Fortune 500 Company since 1995","In May 2011 CSC obtained a contract to deliver logistics and other services to the US Postal Service under a seven-year deal with an estimated total value of $41.74 million.","Exact dates are provided where possible, based on CSC Annual Reports, press releases and other published materials. When exact dates could not be verified, they were estimated.","CSC Australia's interactive Timeline Founded in 1959 and supporting Australian companies since 1970, the milestones and successes that have shaped CSC Australia along the way.","In December 2011, the non-partisan organization Public Campaign criticized Computer Sciences for spending $4.39 million on lobbying and not paying any taxes during 2008–2010, instead getting $305 million in tax rebates, despite making a profit of $1.67 billion.","In May 2011, the UK government said it was suspending CSC from any new contract awards","The company has been accused of breaching human rights by flying detainees to the prisons at Guantanamo Bay without being sentenced by a court of law, between 2003 and 2006—which also has led to criticism of shareholders of the company, including the governments of Norway and Britain."]}