{"name":"Dart","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Dart_(programming_language)","description":["Dart (originally, Dash) is an open source Web programming language developed by Google. It was unveiled at the GOTO conference in Aarhus, 2011 October 10-12. The goal of Dart is \"ultimately to replace JavaScript as the lingua franca of web development on the open web platform.\" Dart is intended to solve JavaScript's problems (which, according to a leaked memo, cannot be solved by evolving the language) while offering better performance, the ability \"to be more easily tooled for large-scale projects\" and better security features. Google also is working on Dart to help them build more complex, full-featured client-side Web apps.","Dart is a class-based, single inheritance, object-oriented language with C-style syntax. It supports interfaces, abstract classes, reified generics, and optional typing. Static type annotations do not affect the runtime semantics of the code. Instead, the type annotations can provide documentation for tools like static checkers and dynamic run time checks.","Dart programs run in one of two modes. In \"checked mode\", which is not the default mode and must be turned on, dynamic type assertions are enabled. These type assertions can turn on if static types are provided in the code, and can catch some errors when types do not match. For example, if a method is annotated to return a String, but instead returns an integer, the dynamic type assertion will catch this and throw an exception. Running in \"checked mode\" is recommended for development and testing.","Dart programs run by default in \"production mode\", which runs with all dynamic type assertions turned off. This is the default mode because it currently is the fastest way to run a Dart program.","dartc was the first compiler that emitted JavaScript from Dart code. dartc has been deprecated. Frog was the second instance of a Dart-to-JavaScript compiler, this time written in Dart. Frog never implemented the full semantics of the language, though, and a new compiler called dart2js was created. Also written in Dart, dart2js is the current Dart-to-JavaScript compiler and is intended to implement the full Dart language spec and semantics.","On November 18, 2011, Google released Dart Editor, an open-source Dart editor based on Eclipse components, for Mac OS X, Windows, and Linux-based operating systems. This editor supports syntax highlighting, code completion, JavaScript compilation, running both web and server Dart apps, and even debugging.","Dart is designed to run in modern web browsers, either directly inside a Dart virtual machine embedded in the web browser, or as compiled JavaScript. Dart's virtual machine is also designed to run Dart programs on the server or command line. For example, the Dart project ships libraries for network IO, files, and directories.","Dart compiles to modern JavaScript, allowing Dart apps to run on the modern web. However, there is a special version of Chromium that embeds the Dart virtual machine. This enables this browser to run Dart programs without first being compiled to JavaScript.","As of May 2012[update], Microsoft Internet Explorer, Mozilla Firefox, Opera Software's Opera browser, and Apple Safari do not have plans to implement support for Dart.","The famous Hello World example:","A function to calculate the nth Fibonacci number:","Microsoft's JavaScript team has stated that: \"Some examples, like Dart, portend that JavaScript has fundamental flaws and to support these scenarios requires a 'clean break' from JavaScript in both syntax and runtime. We disagree with this point of view.\"","Apple engineer Oliver Hunt, working on the WebKit project (which powers both Safari and Google's own Chrome browser) has stated:","Mozilla's Brendan Eich, who developed the JavaScript language, has stated:","Douglas Crockford, when asked about Dart during his Programming Style and Your Brain lecture, replied:"]}