{"name":"DinkC","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Dink_Smallwood#Modification","description":["Dink Smallwood is a humorous role-playing video game. It was first released in 1997 before being released as freeware on October 17, 1999. It was developed by Robinson Technologies, at the time consisting of Seth Robinson, Justin Martin, and Greg Smith. The game has a small but constant fan following that continues to develop add-ons for the game more than a decade after its release.","The game centers on Dink, a pig farmer-turned-hero who embarks on various quests throughout his world. The game features isometric, Zelda-like gameplay, including weapons, items, and magic. The game has a satirical off-color slant, including everything from a fiercely abusive uncle to a town that worships ducks. Dink is never freed from the grievances of being a pig farmer, a fact he is far too often reminded of by his nemesis, Milder Flatstomp.","Dink starts out as a pig farmer, living a normal life in his village, Stonebrook. His father is said to have disappeared, leaving him behind in a small village with his mother. Somehow, as he is outside, his house burns down, killing his mother. He is then told to go out of his village, into the world to find his aunt, and start living a new life with her. Along the way, he hears of a powerful and sinister group known as the Cast whose nefarious deeds are threatening the kingdom. Dink eventually makes it his quest to defeat this mysterious cult. After that, he goes in the Darklands to kill the mighty evil, Seth.","Two level editors exist for Dink Smallwood. The original level editor, developed by Robinson Technologies, is DinkEdit, which is included with the game, and the second level editor is WinDinkEdit which was developed by fans of the game. The freeware game comes with its own D-Mod (short for Dink Module), Mystery Island, which follows Dink's adventures after his victory in the original story. D-Mods can be heavily customized, and some of them are very different from the original game. Many good D-Mods, some of them much longer than the original game, can be found online.","DinkEdit is a modal application that can be used to create a new world. The game world consists of at most 768 screens and each screen can have at most a hundred editor-placed sprites. Among other tasks, the editor can be used to specify music for a screen, assign scripts to sprites and to decorate the game world. WinDinkEdit is a level editor for Windows which enables the D-Mod author to perform the same tasks in a graphical environment.","The DinkC scripting language has a C-like syntax. Variables are prefixed with an ampersand, &, and single line comments are supported with \/\/. Each sprite in the game can have a script attached to it which will be used to determine the behaviour and appearance of the sprite. The engine calls various functions on certain events; for example, the 'main', 'talk' and 'hit' functions of a script will respectively be called upon loading the screen, when the player talks to the sprite and when the player hits the sprite. Each screen can also have a script attached to it which can be used for initialization of the screen or other events.","Dink Smallwood was initially released in 1997 for purchase in the United States and Europe. The game could be purchased from retail stores in Europe via European publisher Iridon Interactive; however, Robinson Technologies did not secure a publisher for the United States, requiring them to sell to this region via mail order at the price of $25 (including shipping).","By the summer of 1999, Robinson Technologies had sold out of all their copies of Dink Smallwood and claimed that there were no plans to publish more copies. It was announced a short time later that the game would be distributed as freeware, and the freeware version of Dink Smallwood was released on October 17, 1999.","Shortly after the freeware release, fans of the game often asked Seth Robinson if he had any plans to release the game’s source code, to which he generally replied no. He commonly cited the game’s sloppy and embarrassing coding as a reason for withholding the source from the community. After years of being pressed to do so, Seth finally decided to release the source code in July 2003. A handful of projects focused on upgrading or porting Dink Smallwood have surfaced, most of them being canceled or postponed indefinitely.","In 2005, Dan Walma (also known as redink1), owner of the Dink Network, the largest Dink Smallwood fan site, was asked by Seth Robinson to create a new patch for Dink Smallwood with the intent to fix numerous longstanding bugs and streamline the Dink experience for new players. After eight-and-a-half months of development and numerous builds of alpha, beta, and release candidate testing involving the community,Dink Smallwood 1.08 was released on March 10, 2006.","More recently however, a fan-made engine port called GNU FreeDink was written and released under the GNU GPL which runs on a variety of platforms including the PlayStation Portable, GNU\/Linux and Mac OS X among others. GNU FreeDink is part of the GNU Project. It was originally based on the original v1.07 source release, but has modes to run like v1.08. It is continuously updated and is the most successful source port so far.","As of December 16, 2011, a new version of Dink Smallwood called \"Dink Smallwood HD\" has been developed for iPhone, iPad, Android, Windows XP\/Vista\/7, webOS and Mac OS X by Seth Robinson. In the Windows\/Mac\/Android versions, it is also possible to play the fan-made D-Mods. A new feature is instant-load and instant-save where the player can save and load the game at any point - as opposed to the original game where saving was only possible at specific points in the game.","While compared to other role-playing games, Dink Smallwood was praised for its humour, being described as “a spoonful of Zelda,…a dash of Monkey Island and a pinch of Diablo.” The humour was described as the one good aspect of the game and was found quite entertaining. However, with other elements letting the game down, the humour only made Dink Smallwood suitable as \"an inexpensive stopgap\". The dialogue used when interacting with NPCs was criticised for containing errors as well as having little influence on the overall outcome of the game. Graphical errors were also listed, with the player character getting stuck on scenery and unable to move, or NPCs or monsters drifting through walls. The lack of interaction between NPCs and monsters was also referenced, with NPCs attempting to hold conversations while the player is in combat. Although Dink Smallwood was described as having little repeatable play, the inclusion of editing software and the wide availability of user-generated content were noted as improving on this."]}