{"name":"ECMAScript","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/ECMAScript","description":["ECMAScript is the scripting language standardized by Ecma International in the ECMA-262 specification and ISO\/IEC 16262. The language is widely used for client-side scripting on the web, in the form of several well-known dialects such as JavaScript, JScript, and ActionScript.","JavaScript was originally developed by Brendan Eich of Netscape under the name Mocha, later LiveScript, and finally renamed to JavaScript. In December 1995, Sun Microsystems and Netscape announced JavaScript in a press release. In March 1996, Netscape Navigator 2.0 was released, featuring support for JavaScript.","Due to the widespread success of JavaScript as a client-side scripting language for web pages, Microsoft developed a compatible dialect of the language, naming it JScript to avoid trademark issues. JScript added new date methods to fix the non-Y2K-friendly methods in JavaScript, which were based on the Java Date class. JScript was included in Internet Explorer 3.0, released in August 1996.","Netscape delivered JavaScript to Ecma International for standardization and the work on the specification, ECMA-262, began in November 1996. The first edition of ECMA-262 was adopted by the Ecma General Assembly of June 1997. Several editions of the language standard have been published since then.","ECMAScript is the name of the scripting language standardized in ECMA-262. The name \"ECMAScript\" was a compromise between the organizations involved in standardizing the language, especially Netscape and Microsoft, whose disputes dominated the early standards sessions. Brendan Eich, the creator of JavaScript, commented that \"ECMAScript was always an unwanted trade name that sounds like a skin disease.\"","While both JavaScript and JScript aim to be compatible with ECMAScript, they also provide additional features not described in the ECMA specifications.[citation needed]","There are five editions of ECMA-262 published. Work on a future edition, codenamed \"Harmony\", is in progress.","In June 2004, Ecma International published ECMA-357 standard, defining an extension to ECMAScript, known as ECMAScript for XML (E4X).","Ecma also defined a \"Compact Profile\" for ECMAScript — known as ES-CP, or ECMA 327 — which is designed for resource-constrained devices. Several of the dynamic features of ECMAScript (such as the eval function) are made optional, thus allowing the runtime to make more assumptions about the behaviour of programs and therefore make more performance trade-offs when running the code. The HD DVD standard was one place where the ECMAScript Compact Profile was used in favour of full ECMAScript to reduce processing and memory needs on devices.","The ECMAScript language includes structured, dynamic, functional, and prototype-based features, as officially summarized here.","ECMAScript is supported in many applications, especially web browsers, where it is implemented by JavaScript, or, in the case of Internet Explorer, JScript. Dialects sometimes include extensions to the language, or to the standard library and related application programming interfaces (API) such as the World Wide Web Consortium (W3C) specified Document Object Model (DOM). This means that applications written in one dialect may be incompatible with another, unless they are written to use only a common subset of supported features and APIs.","The following table is based on tedster's history compilation forum post and Microsoft's JScript version information webpage. Items on the same line are approximately the same language.","In 2010, Ecma International started developing a standards test for Ecma 262 ECMAScript. Test262 is an ECMAScript conformance test suite that can be used to check how closely a JavaScript implementation follows the ECMAScript 5th Edition Specification. The test suite contains thousands of individual tests, each of which tests some specific requirements of the ECMAScript specification.","Development of Test262 is a project of Ecma Technical Committee 39 (TC39). The testing framework and individual tests are created by member organizations of TC39 and contributed to Ecma for use in Test262.","Important contributions were made by Google (Sputnik testsuite) and Microsoft who both contributed thousands of tests.","The Test262 testsuite already contains more than 11,000 tests and is being developed further as of 2012[update].","The following table shows current conformance results of browser products. Lower scores are better, although scores can not be compared as tests are not weighted.","The proposed fourth edition of ECMA-262 (ECMAScript 4 or ES4) would have been the first major update to ECMAScript since the third edition was published in 1999. The specification (along with a reference implementation) was originally targeted for completion by October 2008. An overview of the language was released by the working group on October 22, 2007.","As of August 2008, the ECMAScript 4th edition proposal has been scaled back into a project codenamed ECMAScript Harmony.","Features under discussion for a future edition (originally \"ECMAScript 4\"; now ECMAScript Harmony) include:","The intent of these features is partly to better support programming in the large, and to allow sacrificing some of the script's ability to be dynamic to improve performance. For example, Tamarin — the virtual machine for ActionScript developed and open sourced by Adobe — has just-in-time compilation (JIT) support for certain classes of scripts.","In addition to introducing new features, some ES3 bugs were proposed to be fixed in edition 4. These fixes and others, and support for JSON encoding\/decoding, have been folded into the ECMAScript, 5th Edition specification.","Work started on Edition 4 after the ES-CP (Compact Profile) specification was completed, and continued for approximately 18 months where slow progress was made balancing the theory of Netscape's JavaScript 2 specification with the implementation experience of Microsoft's JScript .NET. After some time, the focus shifted to the ECMAScript for XML (E4X) standard.The update has not been without controversy. In late 2007, a debate between Eich, now the Mozilla Foundation's CTO, and Chris Wilson, Microsoft's platform architect for Internet Explorer, became public on a number of blogs. Wilson cautioned that because the proposed changes to ECMAScript made it backwards incompatible in some respects to earlier versions of the language, the update amounted to \"breaking the Web,\" and that stakeholders who opposed the changes were being \"hidden from view\". Eich responded by stating that Wilson seemed to be \"repeating falsehoods in blogs\" and denied that there was attempt to suppress dissent and challenging critics to give specific examples of incompatibility. He also pointed out that Microsoft Silverlight and Adobe AIR rely on C# and ActionScript 3 respectively, both of which are larger and more complex than ECMAScript Edition 3.","Yahoo, Microsoft, Google, and other 4th edition dissenters formed their own subcommittee to design a less ambitious update of ECMAScript 3, tentatively named ECMAScript 3.1. This edition would focus on security and library updates with a large emphasis on compatibility. After the aforementioned public sparring, the ECMAScript 3.1 and ECMAScript 4 teams agreed on a compromise: the two editions would be worked on, in parallel, with coordination between the teams to ensure that ECMAScript 3.1 remains a strict subset of ECMAScript 4 in both semantics and syntax.","However, the differing philosophies in each team resulted in repeated breakages of the subset rule, and it remained doubtful that the ECMAScript 4 dissenters would ever support or implement ECMAScript 4 in the future. After over a year since the disagreement over the future of ECMAScript within the Ecma Technical Committee 39, the two teams reached a new compromise in July 2008: Brendan Eich announced that Ecma TC39 would focus work on the ECMAScript 3.1 (later renamed to ECMAScript, 5th Edition) project with full collaboration of all parties, and vendors would target at least two interoperable implementations by early 2009. In April 2009, Ecma TC39 published the \"final\" draft of the 5th edition and announced that testing of interoperable implementations was expected to be completed by mid-July. On December 3, 2009, ECMA-262 5th edition was published.","In the July 2008 announcement, Eich also stated that the ECMAScript 4 proposal would be superseded by a new project, code-named ECMAScript Harmony. ECMAScript Harmony names the agreed design trajectory of post-ES5 editions. It will include syntactic extensions, but the changes will be more modest than ECMAScript 4 in both semantic and syntactic innovation. Packages, namespaces, and early binding from ECMAScript 4 are no longer included for planned releases. In addition, other goals and ideas from ECMAScript 4 are being rephrased to keep consensus in the committee; these include a notion of classes based on ECMAScript, 5th Edition (being an update to ECMAScript, 3rd edition). As of December 2009[update], there is no publicly announced release date for next edition within the ECMAScript Harmony trajectory. Depending on Ecma, that next edition may end up being called ECMAScript, 6th edition.",""]}