{"name":"EGL","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/EGL_(programming_language)","description":["EGL (Enterprise Generation Language), originally developed by IBM and now available as the EDT (EGL Development Tools) Open Source project under the EPL (Eclipse Public License), is a programming technology designed to meet the challenges of modern, multi-platform application development by providing a common language and programming model across languages, frameworks, and runtime platforms. The language borrows concepts familiar to anyone using statically typed languages like Java, COBOL, C, etc. However, it borrows the concept of Stereotype from UML (Universal Modeling Language) that is not typically found in statically typed programming languages.","In a nutshell, EGL is a higher-level, universal application development language.","EGL is similar in syntax to other common languages so it can be learned by application developers with similar previous programming background. EGL application development abstractions shield programmers from the technical interfaces of systems and middleware allowing them to focus on building business functionality. EGL applications and services are written, tested and debugged at the EGL source level, and once they are satisfactorily functionally tested they can be compiled into COBOL, Java, or JavaScript code to support deployment of business applications that can run in any of the following environments:","Program","An EGL Program part is a generatable logic part with one entry point. Each Program part contains a main() function, which represents the logic that runs at program start up. A program can include other functions and can access functions that are outside of the program. The function main() can invoke those other functions. Program functions are composed of a set of EGL statements, variables, and constants.","Record","An EGL Record part defines a set of data elements. In this example, a record with the name CustomerRecord is defined with 6 fields.","EGL has a specialized type of record called SQLRecord that is used to exchange data with a relational database.","Service","An EGL Service part contains public functions meant to be accessed from other applications or systems. In this example, a service with two functions is defined.","RUIHandler","The main component of a Rich UI application is a Rich UI handler part. These parts are generated into JavaScript.","In December 2008, IBM introduced new technology, EGL Rich UI, to simplify the creation of Web 2.0-style Rich Internet Applications. This technology simplifies development by hiding the complexities of Ajax, JavaScript, REST, and SOAP from the developer, which enables them to focus on the business requirement and not on the underlying technologies.","EGL programming tools are available as an Eclipse-based commercial product, the Rational Business Developer and also in the EGL edition of Rational Developer for System z.","EGL is a target language for modernization of legacy applications because of the language semantics affinity with procedural languages and legacy 4th generation languages:","Tools for searching large EGL code bases, comparing individual EGL files for changes, and detecting duplicated code are available from Semantic Designs","The Katana-EGL Rich UI Framework from ClearBlade delivers a jump start and rapid prototyping for EGL Web 2.0 and Mobile applications."]}