{"name":"Etoys","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Etoys_(programming_language)","description":["Etoys is a child-friendly computer environment and object-oriented prototype-based programming language for use in education.","Etoys is a media-rich authoring environment with a scripted object model for many different objects that runs on different platforms and is free and open source.","Etoys development was inspired and directed by Alan Kay and his work to advance and support constructionist learning. Primary influences include Seymour Papert and the Logo programming language, a dialect of Lisp optimized for educational use; work done at Xerox Palo Alto Research Center, PARC; Smalltalk, HyperCard, and StarLogo (cf.). Scott Wallace is the main author. Promotion and development of the main Squeak version of Etoys is co-ordinated by the Viewpoints Research Institute, a U.S. educational non-profit.","Etoys was a major influence on a similar Squeak-based programming environment known as Scratch. Scratch was designed with Etoys code in the early 21st century by the MIT Media Lab, initially targeted at after-school computer clubs.","The Etoys system is based on the idea of programmable virtual entities behaving on the computer screen.","Etoys provides a media-rich authoring environment with a simple, powerful scripted object model for many kinds of objects created by end-users. It includes 2D and 3D graphics, images, text, particles, presentations, web-pages, videos, sound and MIDI, the ability to share desktops with other Etoy users in real-time, so many forms of immersive mentoring and play can be done over the Internet.","It is multilingual, and has been used successfully in United States, Europe, South America, Japan, Korea, India, Nepal, Ethiopia, and elsewhere[citation needed].","All Etoys versions are based on object-oriented programming languages. Squeak Etoys runs on more than 20 platforms bit-identically. Versions exist written in three programming languages. The original and most widely used is based on Squeak, a dialect of Smalltalk. The second is also based on Squeak, but uses the optional Tweak programming environment instead of Squeak's default Morphic environment. The third is based on Python and is named PataPata. PataPata has been abandoned by its author.","In 2006 and; 2007, the Squeak Morphic version was adapted for distribution on the OLPC XO-1 educational machine, sometimes known as the $100 laptop. Viewpoints Research Institute participates in the One Laptop per Child association, and Etoys is pre-installed on all XO-1 laptops.","The licensing is free and open source.","As of 2010, Etoys 4 conforms to the requirements of free and open source systems, such as the various Linux distributions.","In 1996, Apple had released Squeak under their \"Squeak license\", which did not qualify as fully free software, due to the presence of an indemnity clause. The source code was available and modification was permitted.","In May 2006, Apple relicensed the Squeak core under the Apache 2.0 license, thanks to Steve Jobs, Dan Ingalls, and Alan Kay. Viewpoints Research collected written relicensing agreements from several hundred contributors under the MIT license, and all code in Etoys not explicitly covered by a relicensing agreement was removed, rewritten, or reverted to an earlier version, mostly by Yoshiki Ohshima. Squeak Etoys is now completely free and open source."]}