{"name":"F-Script","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/F-Script_(programming_language)","description":["F-Script is an object-oriented scripting programming language for Apple's Mac OS X operating system developed by Philippe Mougin. F-Script is tagged as Cocoa developer's best friend, wherein the package provides an integrated set of tools that makes it possible to interactively explore and manipulate Cocoa objects as well as script them using new high-level programming techniques. F-Script is Smalltalk with support for array programming for Cocoa Objects.","F-Script is based on a pure object paradigm (every entity manipulated within the language is an object), its base syntax and concepts being identical to those of Smalltalk (the canonical example of the category) with specific extensions to support array programming as in the APL programming language.","F-Script provides an interpreted, interactive environment with support for workspaces, which provide a rich set of functionality including object persistence, distributed objects, GUI framework, database access, among other things.","Like Smalltalk, F-Script's syntax is very simple, without requiring specific notation for control structures which are provided in a unified manner by the message send operation. Unlike Smalltalk, F-Script provides specific notational extensions to support the Array class, using curly brackets to describe literal arrays, which may contain any F-Script expressions. For example, {1+3, 'name', true} is a valid array literal. The empty array is denoted by {}. Arrays of arrays are transparently supported since an array itself is just another object.","Message expressions in F-Script are similar to those in Smalltalk: they specify which object is the receiver of the message, which operation is called by the message, and any argument objects needed by the operation. F-Script supports unary, binary, and keyword messages. F-Script message semantics are extended to support Array Programming by recognizing that an array operation, such as adding to numerical vectors, must be viewed as the generation of a number of messages relating the elements of the vectors involved. Thus, if A = {1, 2, 3} and B = {10, 20, 30}, then in F-Script you can have:","F-Script is chiefly used as a lightweight scripting layer on top of Mac OS X's Cocoa API. It can be embedded in applications using the F-Script framework and Interface Builder palettes. It can also be used interactively from the F-Script interpreter to prototype applications. Finally, it can be used to explore applications' object hierarchies using an injector such as F-Script Anywhere."]}