{"name":"Fancy","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Fancy_(programming_language)","description":["Fancy is a pure object-oriented programming language that is heavily influenced by Smalltalk and Ruby. The language is currently under development as an open source project by Christopher Bertels.","The language has been in development since the beginning of 2010 and has changed from a C++-based interpreter to be running on Rubinius, a dynamic bytecode virtual machine and implementation for the Ruby programming language.. Thus Fancy supports seamless integration with Ruby and any Ruby libraries.","Fancy is a dynamic programming language, meaning that it will execute tasks at runtime that many languages would perform during compilation. Fancy is a garbage-collected language, like Java or Ruby. The goals of Fancy as a programming language are to be easily understandable by programming beginners, and to perform well enough to be used as a scripting language in Unix environments.","Fancy is implemented on top of Rubinius, the Ruby VM, and therefore integrates well with Ruby. Since Fancy is built on Ruby objects, the authors decided to allow access to the original Ruby classes by using a different syntax. For this reason, Fancy can be extended easily to use Ruby libraries, or any of the C-extensions that are native to Ruby. Recently, a Ruby Gem was released for automated installation of the language.","Christopher Bertels is a Computer Science and Philosophy student at the University of Osnabrück in Germany. He has been working on the Fancy language for around a year, and has spoken about Fancy at the 2010 Ruby and Rails European conference and the Emerging Languages Camp at OSCON.","The implementation of the current release is a runtime using the Rubinius virtual machine, meaning that the language is running on the same platform as Ruby, and is accompanied by a self-hosted (bootstrapped compiler) that generated Rubinius bytecode. To allow more simple cross-platform development, nearly all of the standard library is written in Fancy itself."]}