{"name":"Frink","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Frink","description":["Frink, named after the fictional mad scientist Professor John Frink from The Simpsons, is a calculating tool and programming language designed by Alan Eliasen. It is built on the Java Virtual Machine and incorporates features similar to Java, Perl, Ruby, Smalltalk, and various BASIC implementations. Its main focus is on the fields of science, engineering, physics, text processing, and education.","One of the distinguishing characteristics of Frink is that it tracks units of measure through all calculations. This allows all values to contain a quantity and its units of measure. Frink understands how different units of measure interrelate, such as a length cubed is a volume, or power multiplied by time is energy. Different units of measure can be mixed in calculations, and Frink automatically ensures that the calculations lead to a result with the expected dimensions.","Since gravitation is given as a floating-point value, the answer is also floating point.","The statement above could be rewritten many ways - using different abbreviations and different target units, for instance:","Here the built-in unit \"gravity\" is used, which is specified in Frink's units file as a rational number. Since all the inputs are rational or integer the result is:","Note that different systems of measurements can be effortlessly mixed (for example, pounds, meters, and feet.) When used interactively as a desk calculator println[] and named variables are not required.","The standard distribution comes with a data file which contains hundreds of the most common (and uncommon) units of measure, along with data such as masses of elementary particles, planetary data, and historical units of measure. The standard data file uses the SI base units as its fundamental units of measure, and extends this with units for currency and information (bits). The standard data file can be completely replaced by the user, and new units and even fundamental dimensions may be added at runtime. Any unit or product of units in the file can be converted easily into any other unit which measures the same sort of quantity.","Frink has arbitrary-size integers, arbitrary-size rational numbers, arbitrary-precision floating-point numbers, complex numbers, and interval arithmetic. It also has a number of optimized functions for number theory computations.","Frink uses Unicode characters throughout, allowing it to represent most of the world's languages.","On systems with an internet connection, Frink can translate dozens of human languages, including some requiring right-to-left reading, and it can also convert among current currency and precious metal values as well as inflation-adjusted US dollar and British pound values.","Frink has regular expressions for text processing which are very similar to those in Perl or Ruby.","Other built-in datatypes include dynamically resizable arrays, dictionaries, sets, enumerating expressions, and anonymous functions. Frink also allows writing of object-oriented programs, although inheritance is not yet implemented.","Frink is not exactly a dynamically typed nor a statically typed language. By default, any value may be placed into any variable. However, for more safety, arbitrary constraints may be placed on any variable, ensuring that only values meeting the constraints can be assigned to the variable. For example, one can constrain a variable to only contain values that have dimensions of power. Any number of arbitrary constraints may be placed on a variable, including constraints described by user-defined functions. For example, a variable or function argument could be constrained to only contain prime numbers greater than 100.","Frink contains a pattern-matching and tree-rewriting engine that allows transformation of one mathematical expression to another. This allows symbolic manipulation of equations, solving of systems of equations, simplification of algebraic expressions, and symbolic derivatives and integrals with the proper rules defined.","Frink includes concise commands for creating graphical user interfaces as well as animated or static vector and bitmapped graphics, optionally with scaling directives for physically dimensioned drawings.","Date and time values are integrated with the units of measure. Dates and times can be specified and used in calculations in a wide variety of formats. A date\/time represents a particular moment in time, and can be converted to different timezones, Julian day, Modified Julian day, Dynamical Time, and many other systems of time. Frink keeps track of the quirks of these different systems, even down to leap seconds.","Frink can call Java methods and automatically convert its internal types to and from Java types, allowing use of external Java libraries. Frink can also be embedded in a Java program with only a few lines of code.","Frink Server Pages uses Frink as a language for creating dynamic web-based resources, similar to PHP or Active Server Pages.","It is implemented in Java and will run on Java Virtual Machine version 1.1 and later, or on Android 1.5 and later. (This includes nearly all personal computers and operating systems as well as many cellphones and hand-held devices.) Supported platforms include PersonalJava 1.1 implementations that include implementations of the optional java.math libraries. It includes a text-mode interface as well as three different graphical interfaces using the Java AWT, Swing, and Android libraries.","The interpreter is freeware, but proprietary: its source code is not available. It generally installs with one or two clicks on any machine with a recent version of Java, or it can be used via the web-based interface."]}