{"name":"Octave","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/GNU_Octave","description":["GNU Octave is a high-level language, primarily intended for numerical computations. It provides a convenient command-line interface (CLI) for solving linear and nonlinear problems numerically, and for performing other numerical experiments using a language that is mostly compatible with MATLAB. It may also be used as a batch-oriented language. As part of the GNU Project, it is free software under the terms of the GNU General Public License (GPL).","The project was conceived around 1988. At first it was intended to be a companion to a chemical reactor design course. Real development was started by John W. Eaton in 1992. The first alpha release dates back to January 4, 1993 and on February 17, 1994 version 1.0 was released. Version 3.0 was released on December 21, 2007.","The program is named after Octave Levenspiel, a former professor of the principal author. Levenspiel is known for his ability to perform quick back-of-the-envelope calculations.","In addition to use on desktops for personal scientific computing, Octave is used in academia and industry. For example, Octave was used on a massive parallel computer at Pittsburgh supercomputing center to find vulnerabilities related to guessing social security numbers.","The Octave language is an interpreted programming language. It is a structured programming language (similar to C) and supports many common C standard library functions, and also certain UNIX system calls and functions. However, it does not support passing arguments by reference.","Octave programs consist of a list of function calls or a script. The syntax is matrix-based and provides various functions for matrix operations. It supports various data structures and allows object-oriented programming.","Its syntax is very similar to MATLAB, and careful programming of a script will allow it to run on both Octave and MATLAB.","Because Octave is made available under the GNU General Public License, it may be freely changed, copied and used. The program runs on Microsoft Windows and most Unix and Unix-like operating systems, including Mac OS X.","Typing a TAB character on the command line causes Octave to attempt to complete variable, function, and file names (similar to Bash's tab completion). Octave uses the text before the cursor as the initial portion of the name to complete.","When running interactively, Octave saves the commands typed in an internal buffer so that they can be recalled and edited.","Octave includes a limited amount of support for organizing data in structures. In this example, we see a structure \"x\" with elements \"a\", \"b\", and \"c\", (an integer, an array, and a string, respectively):","Octave's '&&' and '||' logical operators are evaluated in a short-circuit fashion (like the corresponding operators in the C language), in contrast to the element-by-element operators '&' and '|'.","Octave includes the C-like increment and decrement operators '++' and '--' in both their prefix and postfix forms. Also augmented assignment.","Octave supports a limited form of exception handling modelled after the 'unwind_protect' of Lisp. The general form of an unwind_protect block looks like this:","As a general rule, GNU Octave recognizes as termination of a given 'block' either the keyword 'end' (which is compatible with the MATLAB language) or a more specific keyword 'end_block'. As a consequence, an 'unwind_protect' block can be terminated either with the keyword 'end_unwind_protect' as in the example, or with the more portable keyword 'end'.","The cleanup part of the block is always executed. In case an exception is raised by the body part, cleanup is executed immediately before propagating the exception outside the block 'unwind_protect'.","GNU Octave also supports another form of exception handling (compatible with the MATLAB language):","This latter form differs from an 'unwind_protect' block in two ways. First, exception_handling is only executed when an exception is raised by body. Second, after the execution of exception_handling the exception is not propagated outside the block (unless a 'rethrow( lasterror )' statement is purposely inserted within the exception_handling code).","Octave has a real mechanism for handling functions that take an unspecified number of arguments without explicit upper limit. To specify a list of zero or more arguments, use the special argument varargin as the last (or only) argument in the list.","A function can be set up to return any number of values by using the special return value varargout. For example:","It is also possible to execute Octave code directly in a C++ program. For example, here is a code snippet for calling rand([10,1]):","Octave has been built with MATLAB compatibility in mind, and shares many features with MATLAB:","There are a few purposeful, albeit minor, differences:","GNU Octave is also powered by third-party tools and libraries, mostly providing general or domain-specific abstractions for scientific computing. Those tools may be categorized according whether their contributions are more oriented toward computational modelling or toward enhancing visual analysis.","Current versions of Octave do not come with a graphical user interface (GUI)\/integrated development environment (IDE) by default. However, an official graphical interface based on Qt has now been migrated to the main source repository and will likely be released with Octave 4.0. Several 3rd-party graphical front-ends have been developed:"]}