{"name":"IMP","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/IMP_(programming_language)","description":["This article is about Irons IMP. See also the contemporary and unrelated Edinburgh IMP programming language.","IMP was a systems programming language developed by E. T. Irons in the late 1960s through early 1970s. Unlike most other systems programming languages, IMP was an extensible syntax programming language.","Even though its designer refers to the language as \"being based on ALGOL\", IMP excludes many defining features of that language, while supporting a very non-ALGOL-like one: syntax extensibility.","A compiler for IMP existed as early as 1965 and was used for programming the CDC 6600 time-sharing system, which was in use at the Institute for Defense Analyses since 1967. Although the compiler is slower than comparable ones for non-extensible languages, it has been used for practical production work.","IMP compilers were developed for the CDC-6600, Cray, PDP-10 and PDP-11 computers. Important IMP versions were IMP65, IMP70, and IMP72.","Being an extensible syntax programming language, IMP allows the programmer to extend its syntax, although no specific means are provided to add new datatypes or structures to it. To achieve its syntax-extensibility, IMP uses a powerful parse algorithm based on a syntax graph and several connectivity matrices. The programmer may add new BNF productions to the graph.","IMP72's syntax is extended by means of extended-BNF syntax statements included in a source program. The mechanism is so powerful, that it allowed the implementation of the language by itself, i.e., by an IMP72 source file consisting entirely of syntax statements, which was input to a trivial compiler which was initially able to translate the simplest case of the syntax statement. There is also a simple form of the syntax statement which looks like a macro to the casual user.","Basically, the syntax statement is an augmented BNF production with associated semantics added on the right:","For example, to add the construct described by the following BNF:","with the semantics that INCREMENT V should translate to V ← V + 1, the programmer would only need to insert the following IMP statement:","The semantic-part can also contain calls to semantic routines, as in the following syntax statement:","The semantic part of this statement consists of a call on the semantic routine DEWOP. The arguments are the octal constant 214B, the semantic routine call AREG1(1,13), and A, which is the object on top of the stack at the moment this production is invoked. DEWOP is a semantic routine which respectively takes as its arguments a PDP-10 machine language opcode, a register object, and any other object, and produces an object whose value is the result of executing the designated machine instruction using as address field the object which is its last argument. In this specific example, the opcode 214B designates the Load Magnitude instruction, and thus the result of the above syntax statement will be to compile code to compute the absolute value of A.","IMP was the language used on NSA's homegrown time-sharing system known as Folklore."]}