{"name":"KEE","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/IntelliCorp_(Software)","description":["IntelliCorp (IC) is a software company that provides, develops, and markets SAP application lifecycle management, business process management and data management software for SAP customers and partners. IntelliCorp applications deliver automatic intelligent impact analysis of SAP systems and are SAP Integration Certified.","Founded in 1980, IC marketed an early expert system environment (Knowledge Engineering Environment - KEE) for development and deployment of knowledge systems on the Lisp machines that had several advanced features, such as truth maintenance. While moving KEE functionality to the PC, IC created Kappa (later renamed PowerModel), one of the early object-oriented technologies development environments for commercial programming.","The company was also one of the UML Partners, a consortium which helped develop the standards for UML, the Unified Modeling Language.","IntelliCorp has more than 22 years of experience building great software to solve complex problems, starting as a leader in Artificial Intelligence. IntelliCorp has combined its technical heritage with in-depth SAP knowledge to develop the best \"out-the-box\" products to support the application lifecycle needs of SAP customers. IntelliCorp's unique intelligent lifecycle optimization software is used by more than 35% of the Fortune 500 companies that run SAP, to reduce their Total Cost of Ownership by at least 30%. IntelliCorp develops, markets and supports three software products: LiveCompare, LiveModel and LiveInterface.","IntelliCorp's software allows organizations to transform the way in which they manage and maintain SAP applications, reducing cost, effort and risk. Whether you are implementing support packs or enhancement packs, upgrading systems, deploying emergency fixes or custom transports, these activities all introduce change to an SAP system. IntelliCorp technology enables better system maintainability and supports business growth, efficiency and transformation targets faster and with less cost.","LiveCompare","LiveCompare reduces cost, eliminates risk and improves effectiveness across all SAP Application Lifecycle Management activities, enabling effective change management and routine SAP maintenance.","From audits to upgrades, LiveCompare automates the analysis of every change and clearly identifies the impact on business critical functionality. LiveCompare completes its unique system analysis through 200+ pre-packaged workflows and templates. For questions that cannot be fully addressed by an existing template, LiveCompare includes a fully featured development studio which can be used to configure, customize and build new workflows.","LiveCompare easily integrates with third-party applications. Examples include:","LiveModel","LiveModel provides a web-based collaborative environment backed by a scalable enterprise repository for effective business process management.","Use LiveModel to create, modify, view and compare models that represent business processes. Featuring third-party integrations with Quality Center™, SAP Solution Manager and Microsoft SharePoint, LiveModel turns process documentation into valuable assets that can be reused across the lifecycle.","LiveInterface","LiveInterface eliminates data management problems across the lifecycle, including mission-critical integrations of legacy applications with SAP and reusing subsets of production data to support testing, training and on-going development and support. LiveInterface combines a high-performance data processing engine, runtime management and monitoring tools and a multi-mode user interface to boost the productivity of developers, administrations and functional testers by at least 40%.","Management and monitoring functionality is built-in and users can start with a high-level status summary of integrations and drill-down into individual data records. Through the monitoring interface, corrections can be made to the data and resubmitted for processing to speed-up the error\/fix cycle.","LiveInterface's extensive data integration capabilities make it the ideal choice for copying data between SAP systems (e.g., Production and Test). The unique QuickCopy function provides a \"functional\" interface that lets business users take ownership of their test data requirements.","IntelliCorp is represented globally by a number of partners, distributors and VARs. Their network spans EMEA, APAC and Latin America.","A full list of partners can be found on their website.","IntelliCorp announced in April 2011 that it has teamed with IBM to establish an enhanced reseller agreement for its LiveCapture for SAP Solution Manager on the IBM Rational Software platform. IBM resells and supports the LiveCapture for SAP Solution Manager Software product. When coupled with Rational System Architect, IBM customers are able to easily harvest company specific business process content held in SAP Solution Manager into an enterprise planning environment.","The combined solution allows IBM customers, who are implementing SAP, an enterprise transformation platform that improves overall alignment from business strategy and process to organization information and existing IT infrastructure. IntelliCorp’s LiveCapture for SAP Solution Manager is a natural match for use with IBM’s Rational System Architect. Combined, the two products provide invaluable insight into how enterprise architecture translates into business processes that are supported by SAP applications.","IntelliCorp feature as part of IBM's positioning as \"leaders\" in two Gartner Magic Quadrant reports released at the end of 2011: Enterprise Architecture Tools, published in November 2011 and Business Process Analysis Tools, published in December 2011.","IntelliCorp works closely with a number of SAP Consultants and Systems Integrators. Their technology enables central teams to more efficiently and effectively service individual project teams. Consultants with minimal SAP experience can use IntelliCorp's technology to work effectively on SAP projects and helps solutions providers generate more revenue from each client by securing projects that would otherwise be cost\/time prohibitive. LiveCompare, LiveModel and LiveInterface enable consultants to meet and exceed client expectations.","Find out how SAP systems integrators and consultants use IntelliCorp’s software to better manage client SAP projects and maintenance.","Technical support is provided from centres in the USA and UK. Users can raise questions and track progress using an online Help Desk or they can contact support via email and phone. IntelliCorp product support has received very good reviews on the SAP EcoHub website.","IntelliCorp are widening their online and social networking presence:","iShare","IntelliCorp maintains an online customer portal, iShare, where IntelliCorp product users are encouraged to share their experience. LiveCompare is particularly well represented on iShare with customers uploading workflow templates that are free to download and use by other LiveCompare users. At the time of writing there are about 75 additional workflow templates on iShare. Some of the most notable include:","SAP EcoHub","IntelliCorp are active on the SAP EcoHub website. EcoHub is an online solution marketplace which allows customers to discover and evaluate solutions that help enhance the value of their investment in SAP applications.","IntelliCorp customers have contributed favourably to this online community, awarding LiveCompare with detailed, five star product reviews.","Twitter","IntelliCorp maintain a Twitter account and regularly post links to free webcasts, case studies and white papers. Follow IntelliCorp using @livecompare.","IntelliCorp exhibits at a number of key SAP events throughout the year, including both the SAPPHIRE and TECHED conferences in the USA. IntelliCorp also exhibits at a number of the SAPinsider conferences throughout the USA, as well as regional chapter meetings run by ASUG (American SAP User Group).","IntelliCorp exhibits at the UK and Ireland SAP User Group Conference each November and regularly sponsors and presents customer case studies at the frequent Special Interest Group meetings.",""]}