{"name":"JavaFX Script","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/JavaFX_Script","description":["JavaFX Script is a scripting language designed by Sun Microsystems, forming part of the JavaFX family of technologies on the Java Platform.","JavaFX targets the Rich Internet Application domain (competing with Adobe Flex and Microsoft Silverlight), specializing in rapid development of visually rich applications for the desktop and mobile markets. JavaFX Script works with integrated development environments such as NetBeans and Eclipse. JavaFX is released under the GNU General Public License, via the Sun sponsored OpenJFX project.","JavaFX Script used to be called F3 for Form Follows Function. F3 was primarily developed by Chris Oliver, who became a Sun employee through their acquisition of SeeBeyond Technology Corporation in September 2005.","Its name was changed to JavaFX Script, and it became open sourced at JavaOne 2007.","All the code, documentation and demos are shared in the Project OpenJFX Development Website. JavaFX 1.0 was released on December 4, 2008.","On September 10, 2010 Oracle announced at JavaOne that JavaFX Script would be discontinued, although the JavaFX API would be made available to other languages for the Java Virtual Machine.","On September 27, 2010 Stephen Chin announced Visage a declarative user-interface language based on the JavaFX script with enhancements.","JavaFX Script is a compiled, statically typed, declarative, scripting language for the Java Platform. It provides automatic data-binding, mutation triggers and declarative animation, using an expression language syntax (all code blocks potentially yield values.)","Through its standard JavaFX APIs it supports retained mode vector graphics, video playback and standard Swing components.","Although F3 began life as an interpreted language, prior to the first preview release (Q3 2008) JavaFX Script had shifted focus to being predominantly compiled. Interpreted JavaFX Script is still possible, via the JSR 223 'Scripting for Java' bridge. Because it is built on top of the Java Platform, it is easy to use Java classes in JavaFX Script code. Compiled JavaFX Script is able to run on any platform which has a recent Java Runtime installed.","JavaFX Script's declarative syntax for constructing user interfaces contrasts sharply with the more verbose series of method calls required to construct an equivalent interface in Swing directly.","Here is a simple Hello world program for JavaFX Script :","It shows the following window\/frame :","","This program can also be written in this way:","Java SE 5 or above is required to support JavaFX Script development. Developers may work with JavaFX Script using the Eclipse or NetBeans IDEs by incorporating the necessary plugins."]}