{"name":"JOVIAL","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/JOVIAL","description":["JOVIAL is a high-order computer programming language similar to ALGOL, but specialized for the development of embedded systems (specialized computer systems designed to perform one or a few dedicated functions, usually embedded as part of a complete device including mechanical parts).","JOVIAL is an acronym for \"Jules Own Version of the International Algorithmic Language.\" The \"International Algorithmic Language\" was a name originally proposed for ALGOL 58. It was developed to compose software for the electronics of military aircraft by Jules Schwartz in 1959.","During the 1960s JOVIAL was a part of the US Military L-project series, in particular 465L (the SACCS project), due to a lack of real-time languages available. 95% of the SACCS project, managed by ITT with software primarily written by SDC, was written in JOVIAL. The software project took two years and fewer than 1400 programmer years, less than half of the equivalent time in the SAGE L-project.","During the late 1970s and early 1980s, the U.S. Air Force adopted a standardized CPU, the MIL-STD-1750A, and subsequent JOVIAL programs were built for that processor. JOVIAL was standardized during 1973 with MIL-STD-1589 and was revised during 1984 with MIL-STD-1589C. It is still much used to update and maintain software on older military vehicles and aircraft. There are three dialects in common use: J3, J3B-2, and J73.","As of 2010[update], JOVIAL is no longer maintained and distributed by the USAF JOVIAL Program Office (JPO). Software previously distributed by the JPO is still available through commercial resources at Software Engineering Associates, Inc. (SEA) as are other combinations of host\/target processors including WinX, Linux, Apple IBOOK, SPARC, VAX, 1750A, PowerPC, TI-9989, Zilog Z800x, Motorola 6800x and IBM 360\/370\/z.","Notable systems using JOVIAL include the Milstar Communications Satellite, Advanced Cruise Missile, B-52, B-1B, B-2 bombers, C-130, C-141, and C-17 transport aircraft, F-111, F-15, F-16 (prior to Block 50), and F-117 fighter aircraft, LANTIRN, U-2 aircraft, E-3 Sentry AWACS aircraft, Navy Aegis cruisers, Army Multiple Launch Rocket System (MLRS), Army UH-60 Black Hawk helicopters, F100, F117, and F119 jet engines, the NORAD air defense & control system (Hughes HME-5118ME system), the NATO Air Defence Ground Environment (NADGE) system and RL-10 rocket engines. Airborne radar systems with embedded JOVIAL software include the APG-70, APG-71 and APG-73.","As most software implemented in JOVIAL is mission critical, and maintenance is getting more difficult, conversion of JOVIAL code to new platforms is becoming more common. JOVIAL rehosting and retargeting is currently done by Software Engineering Associates, Inc. (SEA). Conversions of JOVIAL to other languages is currently done by Semantic Designs, which has converted the JOVIAL mission software for the B-2 to C with its automated DMS Software Reengineering Toolkit-based tools.",""]}