{"name":"JScript","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/JScript","description":["JScript is Microsoft's dialect of the ECMAScript standard that is used in Microsoft's Internet Explorer.","JScript is implemented as a Windows Script engine. This means that it can be \"plugged in\" to any application that supports Windows Script, such as Internet Explorer, Active Server Pages, and Windows Script Host. It also means that any application supporting Windows Script can use multiple languages (JScript, VBScript, Perl, and others).","JScript was first supported in the Internet Explorer 3.0 browser released in August 1996. Its most recent version is JScript 9.0, included in Internet Explorer 9.","JScript 10.0 is a separate dialect, also known as JScript .NET, which adds several new features from the unfinished fourth edition of the ECMAScript standard. It must be compiled for .NET Framework version 2 or version 4, but static type annotations are optional.","As explained by JavaScript guru Douglas Crockford in his talk entitled The JavaScript Programming Language on YUI Theater,","JScript supports conditional compilation, which allows a programmer to selectively execute code within block comments. This is an extension to the ECMAScript standard that is not supported in other JavaScript implementations.","The original JScript is an Active Scripting engine. Like other Active Scripting languages, it is built on the COM\/OLE Automation platform and provides scripting capabilities to host applications.","This is the version used when hosting JScript inside a Web page displayed by Internet Explorer, in an HTML application, in classic ASP, in Windows Script Host scripts and several other Automation environments.","JScript is sometimes referred to as \"classic JScript\" or \"Active Scripting JScript\" to differentiate it from newer .NET-based versions.","Some versions of JScript are available for multiple versions of Internet Explorer and Windows. For example, JScript 5.7 was introduced with Internet Explorer 7.0 and is also installed for Internet Explorer 6.0 with Windows XP Service Pack 3, while JScript 5.8 was introduced with Internet Explorer 8.0 and is also installed with Internet Explorer 6.0 on Windows Mobile 6.5.","Microsoft's implementation of ECMAScript 5th Edition in Windows 8 Consumer Preview is called JavaScript [sic] and the corresponding Visual Studio 11 Express Beta includes a “completely new”, full-featured JavaScript editor with IntelliSense enhancements for HTML5 and ECMAScript 5 syntax, “VSDOC” annotations for multiple overloads, simplified DOM configuration, brace matching, collapsible outlining and “go to definition”.","JScript is also available on Windows CE (included in Windows Mobile, optional in Windows Embedded CE). The Windows CE version lacks Active Debugging.","JScript .NET is a Microsoft .NET implementation of JScript, it is a CLS language and thus inherits very powerful features, but lacks many features of the original JScript language, making it inappropriate for many scripting scenarios. JScript .NET can be used for ASP.NET pages and for complete .NET applications, but the lack of support for this language in Microsoft Visual Studio place it more as an upgrade path for classic ASP using classic JScript than as a new first-class language.","JScript .NET is not supported in the .NET Compact Framework.[citation needed]","Note: JScript .NET versions are not related to classic JScript versions. JScript .NET is a separate product. Even though JScript .NET is not supported within the Visual Studio IDE, its versions are in sync with other .NET languages versions (C#, VB.NET, VC++) that follows their corresponding Visual Studio versions.",".NET Framework 3.0 and 3.5 are built on top of 2.0 and do not include the newer JScript.NET release (version 10.0 for .NET Framework 4.0).","(Source: file version of jsc.exe JScript.NET compiler and Microsoft.JScript.dll installed with .NET Framework)"]}