{"name":"ksh","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Korn_shell","description":["KornShell (ksh) is a Unix shell which was developed by David Korn at Bell Labs in the early 1980s and announced at USENIX on July 14, 1983. Other early contributors were Bell Labs developers Mike Veach and Pat Sullivan, who wrote the Emacs- and vi-style line editing modes′ code, respectively. KornShell is backward-compatible with the Bourne shell and includes many features of the C shell, inspired by the requests of Bell Labs users.","KornShell complies with POSIX.2, Shell and Utilities, Command Interpreter (IEEE Std 1003.2-1992.)","Major differences between KornShell and the traditional Bourne shell include:","Until 2000, KornShell remained AT&T′s proprietary software. Since then it has been open source software, originally under a license particular to AT&T but, since the 93q release in early 2005, it has been licensed under the Common Public License. KornShell is available as part of the AT&T Software Technology (AST) Open Source Software Collection. As KornShell was initially only available through a proprietary license from AT&T, a number of free and open source alternatives were created. These include the public domain version, pdksh, mksh, GNU bash, and zsh.","The functionality of the original KornShell, ksh88, was used as a basis for the standard POSIX.2, Shell and Utilities, Command Interpreter (IEEE Std 1003.2-1992.)","Some vendors still ship their own version of the older ksh88, sometimes with extensions. ksh93 is still maintained by its author. Releases of ksh93 are versioned by appending a letter to the name; the current version is ksh93u; the previous version was ksh93t+, following ksh93t. Some intermediate bug-fix versions are released without changes to this version string.","As “Desktop KornShell”, dtksh, the ksh93 was distributed as part of the CDE. This version also provide shell-level mappings for Motif widgets. It was intended as competitor to tcl\/tk.","The original KornShell, ksh88, is the default shell on AIX since version 4. with ksh93 available separately.","There are several software products related to KornShell:"]}