{"name":"KUKA","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/KUKA","description":["KUKA is a leading German producer of industrial robots for a variety of industries - from automotive and fabricated metals to food and plastics. The KUKA Robotics Corporation has over 20 subsidiaries worldwide, including: the United States, Canada, Mexico, Brazil, China, Japan, Korea, Taiwan, India and almost all European countries.","The company name, KUKA, is an acronym for Keller und Knappich Augsburg, and at the same time is the registered trademark found on the industrial robots and other products they produce. The company was founded in 1898 and in 1995 was split into KUKA Robotics Corporation and KUKA Schweißanlagen GmbH (now KUKA Systems GmbH). The company headquarters are located in Augsburg, Germany. The company belongs to the publicly traded KUKA AG (earlier IWKA Group).","In 1973 KUKA created the world's first industrial robot with six electromechanically driven axes, known as FAMULUS. Today the company’s 4 and 6 axis robots range from 3 kg to 1300 kg payloads, and 350 mm to 3700 mm reach, SCARAs, palletizers, gantry and articulated robots, all controlled from a common PC based controller platform.","By 2006, the KUKA Robotics Corporation and its subsidiaries have installed close to 80,000 robots and the company has become one of the worldwide market leaders in industrial robots. KUKA industrial robots are used in a number of industries – from automotive and metal working to foodstuffs and plastics.","KUKA industrial robots are used in production by companies like: GM, Chrysler, Ford, Porsche, BMW, Audi, Mercedes-Benz, Volkswagen, Ferrari, Harley-Davidson, Boeing, Siemens, IKEA, Swarovski, Wal-Mart, Budweiser, BSN Medical as well as Coca-Cola and others.","The KUKA Chair of Robotics (Prof. Henrik Christensen) at the Georgia Institute of Technology is one source of KUKA's future robotics developments.","Robots come with a control panel that has a display resolution of 640 x 480 pixels and an integrated mouse, with which the manipulator is moved, positions are saved (TouchUp), or where modules, functions, data lists, etc. are created and modified. To manually control the axles the enabling switch on the back of the control panel (the KCP, or KUKAControlPanel) must be activated (today only with a panic function). The connection to the controller is a VGA interface and a CAN-bus.","A rugged computer located in the control cabinet communicates with the robot system via an MFC card. Control signals between the manipulator and the controls are transferred using the so-called DSE-RDW connection. The DSE card is in the control cabinet, the RDW card in the robot socket.","Controls for the old KRC1 types used Windows 95 to run VxWorks-based software. Peripheral equipment includes a CD-ROM and a disk drive; Ethernet, Profibus, Interbus, Devicenet and ASI sockets are also available.","Controls for the newer KRC2 type use the Windows XP operating system. Systems contain a CD-ROM drive and USB ports, Ethernet connection and feature optional connections for Profibus, Interbus, DeviceNet and Profinet.","Most robots are finished in \"KUKA Orange\" (the official corporate color) or black.","KUKA industrial robots are used in material handling, loading and unloading of machines, palletizing, spot and arc welding. KUKA Robots have also appeared in various Hollywood Films. In the James Bond film Die Another Day, in a scene depicting an ice palace in Iceland, the NSA agent Jinx (Halle Berry) is threatened by laser-wielding robots. In the Ron Howard directed film The Da Vinci Code, a KUKA robot hands Tom Hanks’ character Robert Langdon a container containing a cryptex. In 2001 KUKA developed the Robocoaster, which is the world’s first passenger-carrying industrial robot. The ride uses roller-coaster-style seats attached to robotic arms and provides a roller coaster-like motion sequence to its two passengers through a series of programmable maneuvers. There is also the possibility that riders themselves can program the motions of their ride. In 2007 KUKA introduced a simulator, based on the Robocoaster. Since 2010 Universal's Islands of Adventure theme park in Orlando, Florida utilises KUKA robotic arm technology in its revolutionary indoor attraction, Harry Potter and the Forbidden Journey. The ride's seats are mounted on robotic arms which are in turn mounted on a track. This allows the arms to travel through the attraction while performing their movements in synchronization with the ride's show elements (animated props, projection surfaces, etc.).","Coordinates: 48°22′12″N 10°56′08″E﻿ \/ ﻿48.37°N 10.93565°E﻿ \/ 48.37; 10.93565"]}