{"name":"LANSA","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/LANSA_(development_environment)","description":["LANSA is a development environment that requires a single skill set to build applications that can run on multiple platforms, namely IBMi, Windows, LINUX, UNIX. LANSA (http:\/\/www.lansa.com) also consists of an entire family of integrated software development tools (see below) and Business Solutions. The main feature of the LANSA environment is the 'RDML \/ RDMLX' language. This high-level language is classified as a 4GL (4th generation computing language) and though it originates from the IBMi AS400 (iSeries or i5), it now runs on many systems including MS Windows, Unix, Linux and IBM OS400. In its first release in 1987, the RDML language was known as lambda.","LANSA is currently used as a development environment by thousands of Companies worldwide to build multilingial \/ multi-platform applications that run in English, French, Spanish, Japanese etc.","RDML is an abbreviation for Rapid Development and Maintenance Language. RDML closely follows the syntax of IBM CL, or Control Language. CL is the \"scripting language\" equivalent of the OS\/400 operating system. In recent years RDML has been extended to become RDMLX. This new version of the language has extra features, commands, types, and functions that are used in component development. RDML, on MS windows, integrates seamlessly with ActiveX. Also see RDMLX below.","RDMLX is a highly productive language using a centralized data dictionary called the LANSA Repository. It uses an easy-to-understand command \/ program structure and is notable for its generation of I\/O modules for each File\/Table defined from the LANSA Repository. Every program that needs to reference a file therefore is guided through to this I\/O module (OAM) for that file. This I\/O Module can also contain business-level validation logic and rules that implement referential integrity on that file. In the past, data integrity was handled only by the repository, so external changes made by other non-Lansa programs could not be validated. Now, LANSA enables the repository validation to be automatic to non-LANSA programs too.","LANSA Composer is a design and execution platform for integrating business activities involving transport and transformation of data and custom business processing. It satisfies the four key requirements of a Business Process Integration solution: 1. Transport – moving data between source and target. 2. Transformation – mapping data between many different formats. 3. Process Orchestration – sequential and conditional execution of process flow. 4. Administration – auditing, error-handling, logging, security and system operations.","LANSA Integrator (also known as JSM or Java Services Manager): This powerful product allows RDML programmers to use commonly used functions, mainly to exchange data. For example, the SQLService API allows for execution of SQL statements on many different database systems. The XMLQueueService API lets a developer quickly send and receive messages from iSeries Data Queues and MQSeries Message Queues. And, among dozens of others, the PDFDocumentService API service helps create [PDF] documents with bar codes, images, and text from [XML] data. The most powerful aspect of this product is that it uses simple commands in the same syntax as [RDML]. In addition, custom services developers need only implement a few java interfaces, and have the full power of the Java programming language at their disposal.","LANSA for the Web (also known as L4Web): This web development environment lets web developers create isolated, small web components (XHTML and Javascript) with inline server side RDML constructs that are evaluated at runtime to generate dynamic web pages.","LANSA Client: A reporting tool to query business data and create graphs. It is a query tool that works as a user interface to access and update data, and integrates Crystal Reports to enhance its reporting capabilities.","Visual LANSA: The primary LANSA Integrated Development Environment (IDE), runs on the Windows OS. The VL IDE can be used for building, modernizing and integrating Business applications. The VL IDE generates Application Source that will compile on many platforms including MS Windows, IBM i, UNIX, Linux and Wireless devices. Developers use the VL IDE to build Forms, Reusable Parts, Processes, Functions in RDML \/ RDMLX that constitute a Client-Server (Rich Client) or Web Application, all build from a single code base (RDML \/ RDMLX) for both client and server programs.","Visual LANSA Framework: The Visual LANSA Framework (VLF) is a visual application framework that minimizes the effort required for designers and developers to create highly graphical and robust Windows and Web applications or a combination of both. The VLF allows developers to assemble commercial grade applications rapidly without coding, generating high quality Windows and Web applications with a consistent appearance and behavior. The learning curve is extremely short, productivity is high and the applications are world class – it’s like having an experienced mentor sitting next to your developers. The VLF requires no extra investment or licenses, it is part of the Visual LANSA development tool. The Visual LANSA Framework is fully maintained and by LANSA and it is the preferred starting point for building commercial grade applications.","LANSA's Meta Data Repository technology can develop highly graphical centralized and portable Windows\/Web applications, compiled in C\/C++, with native access to System i and ODBC-compliant databases. Companies who compare Visual LANSA with Visual Basic all comment that Visual LANSA is more productive and manageable during development and more stable and consistent to implement.","LANSA RAMP: A reengineering tool that lets you consolidate your 5250 \/ legacy applications into a rich-client graphical application framework to create composite applications and incrementally replace legacy programs. The framework allows you to assemble new applications through the meta data repository from components built with IBM RPG, Visual LANSA, Visual C# .NET, HTML pages and AJAX framework. LANSA RAMP was named 2009 IBM Beacon Award Finalist in the Outstanding Enterprise Application Solution by an ISV Category.","LANSA Portlet Generator: A Web interface that generates JSR168 Portlets. It provides drag and drop portlet layout for new and existing LANSA Web Application Modules (WAMS). It also provides theme management, portlet to portlet communication, external communication with portlets using web services and most programming languages including JAVA, LANSA, etc. Developed by Rippe & Kingston for the LANSA community. Contact LANSA or Rippe & Kingston for additional information.","LANSA Open for .Net: allows Microsoft .NET Framework developers easy access to data and information on remote Servers via the LANSA Repository. With LANSA Open for .NET, LANSA brings the productivity, discipline, security and performance of its Repository to the .NET world. By storing enterprise business rules centrally in the LANSA Repository."]}