{"name":"LaTeX","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/LaTeX","description":["LaTeX (formatted as LaTeX, pronounced  \/ˈleɪtɛk\/, \/ˈleɪtɛx\/, \/ˈlɑːtɛx\/, or \/ˈlɑːtɛk\/) is a document markup language and document preparation system for the TeX typesetting program. The term LaTeX refers only to the language in which documents are written, not to the editor used to write those documents. In order to create a document in LaTeX, a .tex file must be created using some form of text editor. While most text editors can be used to create a LaTeX document, a number of editors have been created specifically for working with LaTeX.","LaTeX is widely used in academia. As a primary or intermediate format, e.g., translating DocBook and other XML-based formats to PDF, LaTeX is used because of the high quality of typesetting achievable by TeX. The typesetting system offers programmable desktop publishing features and extensive facilities for automating most aspects of typesetting and desktop publishing, including numbering and cross-referencing, tables and figures, page layout and bibliographies.","LaTeX is intended to provide a high-level language that accesses the power of TeX. LaTeX essentially comprises a collection of TeX macros and a program to process LaTeX documents. Because the TeX formatting commands are very low-level, it is usually much simpler for end-users to use LaTeX.","LaTeX was originally written in the early 1980s by Leslie Lamport at SRI International. It has become an important method for using TeX.[citation needed] The current version is LaTeX2e (styled as LaTeX2ε).","As it is distributed under the terms of the LaTeX Project Public License (LPPL), LaTeX is free software.","LaTeX is based on the idea that authors should be able to focus on the content of what they are writing without being distracted by its visual presentation. In preparing a LaTeX document, the author specifies the logical structure using familiar concepts such as chapter, section, table, figure, etc., and lets the LaTeX system worry about the presentation of these structures. It therefore encourages the separation of layout from content while still allowing manual typesetting adjustments where needed. This is similar to the mechanism by which many word processors allow styles to be defined globally for an entire document or the use of Cascading Style Sheets to style HTML.","LaTeX can be arbitrarily extended by using the underlying macro language to develop custom formats. Such macros are often collected into packages, which are available to address special formatting issues such as complicated mathematical content or graphics. Indeed, in the example below, the align environment is provided by the amsmath package.","The example below shows the LaTeX input and corresponding output:","LaTeX is usually pronounced \/ˈleɪtɛk\/ or \/ˈlɑːtɛk\/ in English (that is, not with the \/ks\/ pronunciation English speakers normally associate with X, but with a \/k\/). The characters T, E, X in the name come from capital Greek letters tau, epsilon, and chi, as the name of TeX derives from the Greek: τέχνη (skill, art, technique); for this reason, TeX's creator Donald Knuth promotes a pronunciation of \/ˈtɛx\/ (TEKH) (that is, with a voiceless velar fricative as in Modern Greek, similar to the last sound of the German word \"Bach\", the Spanish \"j\" sound, or as ch in loch). Lamport, on the other hand, has said he does not favor or discourage any pronunciation for LaTeX.","The name is traditionally printed in running text with a special typographical logo: LaTeX. In media where the logo cannot be precisely reproduced in running text, the word is typically given the unique capitalization LaTeX. The TeX, LaTeX and XeTeX logos can be rendered via pure CSS and XHTML for use in graphical web browsers following the specifications of the internal \\LaTeX macro.","LaTeX is typically distributed along with plain TeX. It is distributed under a free software license, the LaTeX Project Public License (LPPL). The LPPL is not compatible with the GNU General Public License, as it requires that modified files must be clearly differentiable from their originals (usually by changing the filename); this was done to ensure that files that depend on other files will produce the expected behavior and avoid dependency hell. The LPPL is DFSG compliant as of version 1.3. As free software, LaTeX is available on most operating systems including UNIX (Solaris, HP-UX, AIX), BSD (FreeBSD, Mac OS X, NetBSD, OpenBSD), GNU\/Linux (Red Hat, Debian, Arch, Gentoo), Microsoft Windows (9x, XP, Vista, 7), RISC OS and AmigaOS.","As a macro package, LaTeX provides a set of macros for TeX to interpret. There are many other macro packages for TeX, including Plain TeX, GNU Texinfo, AMSTeX, and ConTeXt.","When TeX \"compiles\" a document, it follows (from the user's point of view) the following processing sequence: Macros > TeX > Driver > Output. Different implementations of each of these steps are typically available in TeX distributions. Traditional TeX will output a DVI file, which is usually converted to a PostScript file. More recently, Hàn Thế Thành and others have written a new implementation of TeX called pdfTeX, which also outputs to PDF and takes advantage of features available in that format. The XeTeX engine developed by Jonathan Kew merges modern font technologies and Unicode with TeX.","The default font for LaTeX is Knuth's Computer Modern, which gives default documents created with LaTeX the same distinctive look as those created with plain TeX. XeTeX allows the use of OpenType and TrueType (that is, outlined) fonts for output files.","There are also many editors for LaTeX.","LaTeX2e is the current version of LaTeX. As of 2012[update], a future version called LaTeX3, started in the early 1990s, is still in development. Planned features include improved syntax, hyperlink support, a new user interface, access to arbitrary fonts, and new documentation.","There are numerous commercial implementations of the entire TeX system. System vendors may add extra features like additional typefaces and telephone support. LyX is a free, WYSIWYM visual document processor that uses LaTeX for a back-end. TeXmacs is a free, WYSIWYG editor with similar functionalities as LaTeX but a different typesetting engine. Other WYSIWYG editors that produce LaTeX include Scientific Word on MS Windows.","A number of TeX distributions are available, including TeX Live (multiplatform), teTeX (deprecated in favour of TeX Live, UNIX), fpTeX (deprecated), MiKTeX (Windows), proTeXt (Windows), MacTeX (TeX Live with the addition of Mac specific programs), gwTeX (Mac OS X), OzTeX (Mac OS Classic), AmigaTeX (no longer available) Latexian (Mac OS X) and PasTeX (AmigaOS, available on the Aminet repository).","LaTeX documents (*.tex) can be opened with any text editor. Additionally, TeX documents can be shared by converting the LaTeX file to Rich Text Format (.rtf) or XML. This can be done using the free software programs LaTeX2RTF or TeX4ht. LaTeX can also be converted to PDF files."]}