{"name":"Legoscript","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Lego_Mindstorms","description":["The LEGO Mindstorm series of kits contain software and hardware to create small, customizable and programmable robots. They include a programmable 'Brick' computer that controls the system, a set of modular sensors and motors, and LEGO parts from the Technics line to create the mechanical systems.","The hardware and software roots of the Mindstorms Robotics Invention System kit go back to the programmable brick created at the MIT Media Lab. This brick was programmed in Brick Logo. The first visual programming environment was called LEGOsheets, since it was created by the University of Colorado in 1994 based on AgentSheets.","The original Mindstorms Robotics Invention System kit contained two motors, two touch sensors, and one light sensor. The NXT version has three servo motors and one light, sound, and distance as well as 1 touch sensor. The NXT 2.0 has 2 touch sensors as well as a light and distance sensor, and support for 4 without using a sensor multiplexor. Lego Mindstorms may be used to build a model of an embedded system with computer-controlled electromechanical parts. Many kinds of real-life embedded systems, from elevator controllers to industrial robots, may be modelled using Mindstorms.","Mindstorms kits are also sold and used as an educational tool, originally through a partnership between Lego and the MIT Media Laboratory. The educational version of the products is called Lego Mindstorms for Schools, and comes with the ROBOLAB GUI-based programming software, developed at Tufts University using the National Instruments LabVIEW as an engine. In addition, the shipped software can be replaced with third party firmware and\/or programming languages, including some of the most popular ones used by professionals in the embedded systems industry, like Java and C. The only difference between the educational series, known as the \"Challenge Set\", and the consumer series, known as the \"Inventor Set\", is that it includes another light sensor and several more gearing options.","Mindstorms is named after the book Mindstorms: Children, Computers, and Powerful Ideas by Seymour Papert.","The first generation of Lego Mindstorms was built around a brick known as the RCX (Robotic Command eXplorer). It contains a 8-bit Renesas (Then a part of Hitachi) H8\/300 microcontroller as its internal CPU. It also contains 32K of RAM that stores the firmware and user programs. The brick is programmed by uploading a program (written in one of several available programming languages) from a Windows or Mac computer to the brick's RAM via a special infrared (IR) interface. After the user starts a program, an RCX-enabled Mindstorms creation may function totally on its own, acting on internal and external stimuli according to the programmed instructions. Also, two or several more RCX bricks can communicate with each other through the IR interface, enabling inter-brick cooperation or competition. In addition to the IR port, there are three sensor input ports and three motor output ports (also usable for lamps, etc.). There is also an LCD that can display the battery level, the status of the input\/output ports, which program is selected or running, and other information.","Version 1.0 RCX bricks feature a power adapter jack to allow continuous operation instead of the limited operation time when using batteries. In version 2.0 (as well as later 1.0s included in the RIS 1.5), the power adapter jack was removed. Power adapter equipped RCX bricks are popular for stationary robotics projects (such as robot arms) or for controlling Lego model trains. In the latter context, the RCX needs to be programmed with Digital Command Control (DCC) software to operate multiple wired trains.","The IR interface on the RCX is able to communicate with Spybots, Scout Bricks, Lego Train, and the NXT (using a third-party infrared link sensor.) The RCX 1.0 IR receiver carrier frequency is 38.5 kHz, while the RCX 2.0 IR carrier frequency is 76 kHz. Both versions can transmit on either frequency. The carrier signal is generated by one of the RCX's internal timers. The RCX communicates with a computer using a Serial or USB IR tower. The tower is supported by Windows 98, Me, and XP (32-bit). A patch is available for hyper-threading\/multi-core CPUs. There is no formal support for Windows Vista (32-bit), but there are reports of correct functionality. The USB tower does not work on a 64-bit OS unless a 32-bit OS is used in conjunction with a virtual machine. The serial tower works normally under 64-bit Windows 7 using a third-party USB-to-serial adapter.","All versions of the RCX have a unique number printed on it, necessary for technical support and used as the ID number of the RCX for your Lego Mindstorms account on the now-defunct Lego Mindstorms RCX website. The first RCX produced is marked \"000001\" and was on display at the Mindstorms 10th Anniversary event.","Lego Mindstorms' programming is command box programming, rather than code programming.","Lego-supplied languages:","Popular third-party languages:","The Lego camera on its own is technically not a robotic toy; rather, it is a normal webcam (a Logitech QuickCam Web) packaged into a Lego shell. Being a normal webcam, the Lego Camera is, unlike most Mindstorms products, not programmable and is only usable connected to a PC or some other device that supports USB webcams.","The Lego camera is meant to be used with the included Vision Command software which can also interface with an RCX and thus enables creating robots with \"vision\". The software is capable of detecting different lightings, motion, and colors. It can also be used with any other software that uses a webcam. The webcam is capable of recording up to 30 frames per second. It also contains a microphone to record sound for videos.","The first programmable Lego product (1989). It came with a dedicated IBM-PC-compatible ISA interface card, a ribbon cable, and a control panel. The control panel included six non-reversible 4.5V output ports, three reversible 4.5V output ports (each using the power lines from their two adjacent non-reservible ports), two 4.5V input ports, and one continuous 4.5V output port. It also features a manual-override stop-button. Using programs running on the host computer, the user could create stationary programmable robotic Lego inventions using the older 4.5V system. The 4.5V PC Interface was superseded by the 9V-based Dacta Control Lab in 1995.","The Lego Technic control center (1990) was the first programmable standalone Lego product, by the sense of being able to store sequence-based programs and run them. It featured three output ports and manual control, and it was only capable of storing linear sequences of manual input plus timing information. It could store up to two programs at once.","The manual controls could be used to independently control the three motors. To record a program; the controller had to be put in programming mode, and then any manual cotrol would be recorded to the program. Pauses could also be included in a program. When the recording was done, the controller could successfully recall and execute any manual action done during the recording. The executing program could be set to loop infinitely.","Compared to the later programmable controllers, the Technic control center is extremely simple and can only barely be called programmable.","Being released in 1995; the Dacta Control Lab was the first Lego product to feature the sensors used in later 9V-based automated Lego products. The control lab was a datalogger which featured four passive input ports, four active input ports, eight controllable 9V output ports and one continuous output port. It also featured a manual-override stop-button. The control panel connected to a computer using a serial-port with a specially designed adapter cable, and a supplied computer-program allowed the user to conditionally program the outputs. This allowed for robotic operation of mostly stationary Lego inventions. The Control Lab superseded the old 4.5V PC interface from 1989, which was the first fully programmable Lego interface.","The connectors of the early sensors were color-coded according to their type. Active sensors had blue connectors and Passive sensors had yellow connectors. Later Pbricks kept the color-coding for the input ports, but the later sensors dropped the color coding of the connectors (using black connectors instead). The early touch-sensors were also of a different kind and shape compared to the later touch-sensors. Most notably; instead of featuring a removable cable, the cable was fixed just like the other sensors. These early sensors also featured longer cables than their more recent counterparts.","The Control Lab was designed for schools and educational use, and was as a result not available to the mass market. It was later replaced by the RCX and the educational release of the Robot Invention System which allowed for mobile inventions in addition to stationary inventions.","Cybermaster was mainly sold in Europe and Australia\/New Zealand, but was available for a short time in America via the Lego Club magazines. It was aimed at a younger audience as an early attempt of merging computer gaming with robotics and Lego. The Pbrick shares many, especially software, features with the RCX but differs in appearance and technical specifications: 1 output (plus 2 built-in) and 3 sensors.","Despite its obvious limitations it has a number of advantages over its 'big brother', the RCX.","This makes it very useful for various mobile platforms and performing basic motion\/positioning tasks.","It talks the same protocol as the RCX but cannot communicate directly to it (due to IR vs RF) but with a repeater (a computer with 2 serial ports and a simple program) they can be integrated.","Sold as part of the Barcode Truck kit. This unit was the first programmable brick (or Pbrick). It features a single motor, a single touch sensor and a light sensor. It is programmed by setting it to 'learn' and using the light sensor to feed barcoded commands. The command set is very limited. Since barcode is just a series of variances in light, this form of command entry was dubbed VLL (Visual Light Link) and has been used in several later Lego models.","Lego also released a blue computer called the Scout, which has 2 sensor ports, 2 motor ports (plus one extra if linked with a Micro Scout using a fiber optic cable), and a built in light sensor, but no PC interface. It comes with the Robotics Discovery Set. The Scout can be programmed from a collection of built-in program combinations. In order to program the Scout, a user must enable \"power mode\" on it. The Scout can store one program.","The Scout is based on a Toshiba microcontroller with 32KB of ROM and 1KB of RAM, where about 400 bytes are available for user-programs. Due to the extremely limited amount of RAM, many predefined subroutines were provided in ROM. The Scout only supports passive external sensors, which means that only touch, temperature and other unpowered sensors can be used. The Analog-to-Digital Converters used in the Scout does only have a resolution of 8 bits in contrast to the 10-bit converters of the RCX.","There was a plan for Lego to create a booster set that allows you to program the Scout from a computer with a software such as RCX code. However, due to the complexity of this project, it was abandoned.","The RCX can control the Scout brick using the \"Send IR Message\" program block. The RCX does all of the controlling, and therefore can be programmed with the PC, while the Scout accepts commands. The Scout brick must have all of its options set to \"off\".","The Scout is also capable of using VLL to control a Micro Scout.","The Micro Scout was added as an entry level to Lego robotics. It is a very limited Pbrick with a single built-in light sensor and a single built-in motor. It has seven built-in programs and can be controlled by a Scout, Spybotics or RCX unit using VLL. Like the Scout, the Micro Scout is also based on a microcontroller from Toshiba.","The unit was sold as part of the Droid Developer Kit (featuring R2D2) and later the Darkside Developer Kit (featuring an AT-AT Imperial Walker).","Spybotics is a robotics package. It consists of four colour-coded robots called Spybots, a programming language with which to control the Spybots, and ten simulated missions.","Lego Mindstorms NXT is a programmable robotics kit released by Lego in July 2006, replacing the first-generation LEGO Mindstorms kit. The kit consists of 577 pieces, including: 3 servo motors, 4 sensors (ultrasonic, sound, touch, and light), 7 connection cables, a USB interface cable, and the NXT Intelligent Brick. The Intelligent Brick is the \"brain\" of a Mindstorms machine. It lets the robot autonomously perform different operations. The kit also includes NXT-G, a graphical programming environment that enables the creation and downloading of programs to the NXT. The software also has instructions for 4 robots; Alpha-Rex (a humanoid),Tri-Bot (a car), Robo-Arm T-56 (a robotic arm), and Spike (a scorpion)","This is the educational version of the NXT set from LEGO Education, which is made for school use. Software is sold separately, and the Education Resource Set for the best use. It includes a light sensor, a ultrasonic sensor, a sound sensor, three lamps and a pair of touch sensors. The first set consists of about 400 pieces, and the extra set consists of about 600 pieces. The Education Version is most suited for those who have older versions of MINDSTORMS sets around, mostly thanks to its 3 converter cables. It costs about US$410.00 with the Bluetooth Dongle.","The Lego Mindstorms NXT 2.0 was launched on 5 August 2009. It contains 619 pieces (includes sensors and motors), introduced a Color Sensor, two Touch Sensors and an Ultrasonic Sensor. The NXT 2.0 uses Floating Point operations whereas earlier versions use Integer operation. The kit costs around USD 280.","There is a strong community of professionals and hobbyists of all ages involved in the sharing of designs, programming techniques, creating third-party software and hardware, and contributing of other ideas associated with Lego Mindstorms. The Lego Mindstorms system\/website is organized much like a wiki, harnessing the creative potential and collaborative efforts of participants. Lego also encourages sharing and peering by making software code available for downloading and by holding various contests and events.",""]}