{"name":"LINC","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/LINC","description":["The LINC (Laboratory INstrument Computer) was a 12-bit, 2048-word computer. The LINC can be considered the first minicomputer and a forerunner to the personal computer.","The LINC and other \"MIT Group\", Linc Computer (its first name in the museum opened by Digital Equipment Corporation (DEC) in 1980 before DEC joined production effort) machines were designed at MIT and eventually built by Digital Equipment Corporation (DEC) and the Spear Inc. of Waltham, MA. (later a division of Becton Dickinson and Company) The LINC sold for more than $40,000 at the time. A typical configuration included an enclosed 6'X20\" rack, four boxes holding tape drives, a small display, a control panel, and a keyboard.","Although its instruction set was small, it was larger than the tiny PDP-8 instruction set.","It interfaced well with laboratory experiments. Analog inputs and outputs were part of the basic design. It was designed in 1962 by Charles Molnar and Wesley Clark at Lincoln Laboratory, Massachusetts), for NIH researchers. The LINC's design was literally in the public domain, perhaps making it unique in the history of computers. The number of LINCs and who built them is a minor subject of debate in the 12-bit-word community. One account states 24 LINC computers were assembled in a summer workshop at MIT. Digital Equipment Corporation (starting in 1964) and Spear Inc. of Waltham, MA. manufactured them commercially.","DEC's pioneer C. Gordon Bell states that the LINC project began in 1961, with first delivery in March, 1962, and the machine was not formally withdrawn until December, 1969. A total of 50 were built (all using DEC System Module Blocks and cabinets), most at Lincoln Labs, housing the desktop instruments in four wooden racks. The first LINC included two oscilloscope displays. Twenty one were sold by DEC at $43,600, delivered in the Production Model design. In these, the tall cabinet sitting behind a white-Formica-covered table held two somewhat smaller metal boxes holding the same instrumentation, a Tektronix display oscilloscope over the \"front panel\" on the user's left, a bay for interfaces over two LINC-Tape drives on the user's right, and a chunky keyboard between them. The standard program development software (an assembler\/editor) was designed by Mary Allen Wilkes; the last version was named LAP6 (LINC Assembly Program 6).","The LINC control panel was used for single-stepping through programs and for program debugging. Execution could be stopped when the program counter matched a set of switches. Another function allowed execution to be stopped when a particular address was accessed. The single-step and the resume functions could be automatically repeated. The repetition rate could be varied over four orders of magnitude by means of an analog knob and a four-position decade switch, from about one step per second to about half of the full speed. Running a program at one step per second and gradually accelerating it to full speed provided an extremely dramatic way to experience and appreciate the speed of the computer.","A noteworthy feature of the LINC was the LINCtape. It was a fundamental part of the machine design, not an optional peripheral, and the machine's OS relied on it. The LINCtape can be compared to a linear diskette with a slow seek time. The magnetic tape drives on large machines of the day stored large quantities of data, took minutes to spool from end to end, but could not reliably update blocks of data in place. In contrast, the LINCtape was a small, nimble device which stored about 400K, had a fixed formatting track allowing data to be repeatedly read and re-written to the same locations, and took less than a minute to spool from one end to the other. The tape was formatted in fixed-sized blocks, and was used to hold a directory and file system. A single hardware instruction could seek and then read or write multiple tape blocks all in one operation.","Filenames were six characters long. The file system allowed for two files—a source file and an executable binary file to be stored under the same name. In effect it was a 6.1 filename in which the extension was restricted to \"S\" or \"B\". Since the basic LINC had only 1024 12-bit words of core memory (RAM)--and the big, expanded LINC had only 2048—normal operations depended heavily on swapping to and from LINCtape. (Digital later patented and marketed a similar design under the name DECtape; Digital's patents on DECtape were eventually tested in court and found invalid[citation needed]).","LINCtape is also remembered for its reliability, which was higher than that of the diskettes which supplanted it. LINCtape incorporated a very simple form of redundancy—all data was duplicated in two locations across the tape. LINC users demonstrated this by punching holes in a tape with an ordinary office paper punch. Tape damaged in this way was perfectly readable. The formatting track made operation almost independent of tape speed, which was, in fact, quite variable. There was no capstan; the motion of the tape during reading and writing was directly controlled by the reel motors. There was no fast forward or rewind—reading and writing was performed at fast forward and rewind speeds. In some modes of operation, the data transfers were audible over the built-in loudspeaker and produced a very characteristic series of harsh bird-like squawks with varying pitch.","The LINC keyboard, manufactured by company named Soroban Engineering, had a unique locking solenoid. The internal mechanism of each key had a slot that worked with a set of bars to encode the character and another slot that caught a locking bar, which locked all the keys in one mechanical movement of the locking solenoid.","When the user pressed a key, the LINC would lock the pressed key in its down position, and all the other keys in the up position, read the key into a hardware register, then, when the running program read the register, the hardware would release the lock and the pressed key would pop back up. This had the effect of slowing down typing and preventing even 2-key rollover. This exotic keyboard was abandoned in favor of Teletype keyboards, such as the Model 35 KSR and Model 37 KSR, in the LINC-8 and PDP-12 follow-on computers.","The LINC included a set of eight ten-turn potentiometers (numbered 0-7) that could be each be read by a computer instruction. The knobs were a convenient user input device at a time before general adoption of the mouse. For example, the scaling of a displayed graph could be controlled by turning Knob 0. Or Knob 2 could be used to position a cursor in the graph in order to display the actual data value at that point.","The LINC hardware allowed a 12-bit word to be rapidly and automatically displayed on the screen as a 4-wide by 6-high matrix of pixels, making it possible to display full screens of flicker-free text. The standard display routines generated 4 by 6 character cells, giving the LINC one of the coarsest character sets ever designed.","The display screen was a CRT about 5 inches square which was actually a standard Tektronix oscilloscope with special plug-in amplifiers. These special plug-ins could be replaced with standard oscilloscope plug-ins for use in diagnostic maintenance of the computer. Many LINCs were supplied as kits to be assembled by the end user, so the oscilloscope came in handy.","Printed output on a Teletype Model 33 ASR was controlled by a single pole relay. A subroutine would convert the LINC character codes into ASCII and use timing loops to toggle the relay on and off, generating the correct 8-bit output to control the Teletype printer.","The LINC connector module included bays for two plug-in chassis allowing custom interfacing to experimental setups. Analog-to-digital and digital-to-analog converters were built in to the computer and each could be accessed by a single machine instruction. Six relays were also available.","While Bell in his book says designing the LINC provided the ideas for DEC's second and third machines, the 18-bit inexpensive follow-on to its first, the PDP-4 and the company's first 12-bit design of its own, the PDP-5, Digital Equipment Corporation would launch the wondrous PDP-8 before it manufactured the first next-generation LINC-compatible computer, the LINC-8 and a combination of the 7400-series chip-based PDP-8\/I and a redesigned LINC, combined as the PDP-12. DEC's final 12-bit lab machine, the Lab-8\/E, did away with the LINC entirely.. The first follow-on, the LINC-8, booted (slowly) to a PDP-8 program called PROGOFOP (PROGram OF OPeration) which interfaced to the separate LINC hardware. The PDP-12 was the last and most popular follow-on to the LINC. It was a capable and improved machine, and was more stable than the LINC-8, but architecturally was still an imperfect hybrid of a LINC and a PDP-8, full of many small technical glitches. (For example, the LINC had an overflow bit which was a small but important part of the LINC's machine state; the PDP-12 had no provision for saving and restoring the state of this bit across PDP-8 interrupts.)","Digital produced a version of the PDP-11\/03 called the MINC-11, housed in a portable cart, and equipable with Digital-designed laboratory I\/O modules supporting capabilities such as analog input and output. A programming language, MINC BASIC, included integrated support for the laboratory I\/O modules. MINC stood for \"Modular Instrument Computer.\" The name undoubtedly was intended to evoke memories of the LINC, but the 16-bit machine had no architectural resemblance to, or compatibility with, the LINC."]}