{"name":"Lisaac","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Lisaac","description":["Lisaac is a compiled object-oriented programming language based on prototype concepts, with system programming facilities and design by contract.","Lisaac's developers admired both Self's flexibility and dynamic inheritance, and Eiffel's static typing and design by contract features. Seeking to combine these two apparently contradictory feature sets, Lisaac was created.","Lisaac was designed as the language in which the Isaac operating system would be programmed.","The Lisaac transpiler produces optimized ANSI C code, which can then be compiled on every architecture with an appropriate C compiler which makes Lisaac a real multi-platform language[dubious – discuss]. Compiling results show that it is possible to obtain executables from a high-level prototype-based language that are as fast as C programs.","Despite being strongly typed, there is no difference between code and data.","Lisaac is case sensitive. Keywords are capitalized (Section, Header, Public, …), type identifiers are written in upper case letters (INTEGER, BOOLEAN, OBJECT, …), and identifiers denoting variables and slots are written in lower case letters. Objects are composed of slots, which can be data or code. The ':' symbol is used to declare types. Slot names are prefixed with a '+' or '-' symbol to indicate whether the slot is local to an object or shared between objects.","Parentheses are used to delimit lists of semicolon separated statements. Statement lists may have zero, one or more return values. The ':=' symbol is used to bind a slot to a statement or statement list that is executed at the loading\/initialization of an object. The '","The parent of each object is just a slot that can be assigned as required in the code, for instance:","In Lisaac, an operator is a slot and can be redefined. For example overloading the + operator for a NUMERIC object:","Or for a matrix:","Generic objects are supported, for instance:","Contract programming using Z notation is provided.",""]}