{"name":"MAD\/I","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/MAD_(programming_language)","description":["MAD (Michigan Algorithm Decoder) is a programming language and compiler for the IBM 704 and later the IBM 709, IBM 7090, IBM 7040, UNIVAC 1107, UNIVAC 1108, Philco 210-211, and eventually the IBM S\/370 mainframe computers. Developed in 1959 at the University of Michigan by Bernard Galler, Bruce Arden and Robert M. Graham, MAD is a variant of the International Algebraic Language (IAL). It was widely used to teach programming at colleges and universities during the 1960s and played a minor role in the development of CTSS, Multics, and the Michigan Terminal System computer operating systems.","The archives at the Bentley Historical Library of the University of Michigan contain reference materials on the development of MAD and MAD\/I, including three linear feet of printouts with hand-written notations and original printed manuals.","There are three MAD compilers:","MAD is a variant of the International Algebraic Language (IAL). IAL is the original name for what eventually became ALGOL 58. While MAD was motivated by ALGOL 58, it does not resemble ALGOL 58 in any significant way.","Programs written in MAD included MAIL,RUNOFF, one of the first text processing systems, and several other utilities all under Compatible Time-Sharing System(CTSS). Work was done on a design for a MAD compiler for Multics, but it was never implemented.","The following is an interesting quote from An Interview with Brian Kernighan when he was asked \"What hooked you on programming?\":","MAD was quite fast compared to some of the other compilers of its day. Because a number of people were interested in using the FORTRAN language and yet wanted to obtain the speed of the MAD compiler, a system called MADTRAN (written in MAD) was developed. MADTRAN was simply a translator from FORTRAN to MAD, which then produced machine code. MADTRAN was distributed through SHARE.","MAD\/I has a syntactic structure similar to ALGOL 60 together with important features from the original MAD and from PL\/I. MAD\/I was designed as an extensible language. It was available for use under MTS and provided many new ideas which made their way into other languages, but MAD\/I compilations were slow and MAD\/I never extended itself into widespread use when compared to the original 7090 MAD.","GOM is essentially the 7090 MAD language modified and extended for the 360\/370 architecture with some judicious tailoring to better fit current programming practices and problems. The MTS Message System was written in GOM.","In a pre-release version of the original MAD, as a reference to MAD's namesake, MAD magazine, when a program contained too many compile time errors the compiler would print a full-page picture of Alfred E. Neuman using ASCII art. The caption read, \"See this man about your program--He might want to publish it. He never worries--but from the looks of your program, you should.\" This feature was not included in the final official version.","And Bernie Galler remembers:","The \"hello, world\" example program prints the string \"Hello, world\" to a terminal or screen display.","The first character of the line is treated as logical carriage control, in this example the character zero which causes a double spaced line to be printed.","Or, if entering all of the keywords at your keypunch is too much work, you can use contractions and the compiler will expand them in the listing:","MAD and GOM, but not MAD\/I, are composed of the following elements:","MAD programs are a series of statements written on punched cards, generally one statement per card, although a statement can be continued to multiple cards. Columns 1-10 contains an optional statement label, comments or remarks are flagged using the letter \"R\" in column 11, and columns 73-80 are unused and could contain a sequence identifier. Spaces are not significant anywhere other than within character constants. For GOM input is free form with no sequence field and lines may be up to 255 characters long; lines that start with an asterisk (*) are comments; and lines that start with a plus-sign (+) are continuation lines.","Variable names, function names, and statement labels have the same form, a letter followed by zero to five letters or digits. Function names end with a period. All names can be subscripted (the name followed by parentheses, with multiple subscripts separated by commas). For GOM names may be up to 24 characters long and may include the underscore (_) character.","Few keywords in the language are reserved words since since most are longer than six letters or are surrounded by periods. There is a standard set of abbreviations which can be used to replace the longer words. These consist of the first and last letters of the keywords with an apostrophe between them, such as W'R for WHENEVER and D'N for DIMENSION.","MAD uses the term \"mode\" for its data types. Five basic modes are supported:","The mode of a constant can be redefined by adding the character M followed by a single digit at the end of the constant, where 0 indicates floating point, 1 integer, 2 boolean, 3 function name, and 4 statement label.","For GOM six additional modes are added: CHARACTER, SHORT INTEGER, BYTE INTEGER, LONG INTEGER, POINTER, and DYNAMIC RECORD.","Alphabetic or character constants are stored as integers and written using the dollar sign as a delimiter ($ABCDEF$) with double dollar-signs used to enter a true dollar sign ($$$.56$ is 56 cents). Strings longer than six characters are represented using arrays.","One of the most interesting features in MAD is the ability to extend the language by redefining existing operators, defining new operators, or defining new data types (modes). The definitions are made using MAD declaration statements and assembly language mnemonics included following the declaration up to the END pseudo-instruction that implement the operation.","where:","Three pre-defined packages of definitions (MATRIX, DOUBLE PRECISION, and COMPLEX) are available for inclusion in MAD source programs using the INCLUDE statement."]}