{"name":"Maple","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Maple_(software)","description":["Maple is a commercial computer algebra system. It was first developed in 1980 by the Symbolic Computation Group at the University of Waterloo in Waterloo, Ontario, Canada.","Since 1988, it has been developed and sold commercially by Waterloo Maple Inc. (also known as Maplesoft), a Canadian company also based in Waterloo, Ontario. The current major version is version 16 which was released in March 2012.","Users can enter mathematics in traditional mathematical notation. Custom user interfaces can also be created. There is support for numeric computations, to arbitrary precision, as well as symbolic computation and visualization. Examples of symbolic computations are given below.","Maple incorporates a dynamically typed imperative-style programming language which resembles Pascal. The language permits variables of lexical scope. There are also interfaces to other languages (C, C#, Fortran, Java, MATLAB, and Visual Basic). There is also an interface with Excel.","Maple supports MathML 2.0, a W3C format for representing and interpreting mathematical expressions, including their display in Web pages.","Maple is based on a small kernel, written in C, which provides the Maple language. Most functionality is provided by libraries, which come from a variety of sources. Many numerical computations are performed by the NAG Numerical Libraries, ATLAS libraries, or GMP libraries. Most of the libraries are written in the Maple language; these have viewable source code.","Different functionality in Maple requires numerical data in different formats. Symbolic expressions are stored in memory as directed acyclic graphs. The standard interface and calculator interface are written in Java. The classic interface is written in C.","The first concept of Maple arose from a meeting in November 1980 at the University of Waterloo. Researchers at the university wished to purchase a computer powerful enough to run Macsyma. Instead, it was decided that they would develop their own computer algebra system that would be able to run on lower cost computers. The first limited version appearing in December 1980 with Maple demonstrated first at conferences beginning in 1982. The name is a reference to Maple's Canadian heritage. By the end of 1983, over 50 universities had copies of Maple installed on their machines.","In 1984, the research group arranged with Watcom Products Inc to license and distribute Maple. In 1988 Waterloo Maple Inc. was founded. The company’s original goal was to manage the distribution of the software. Eventually, the company evolved to have an R&D department where most of Maple's development is done today with the rest done at university research labs worldwide including: the Symbolic Computation Laboratory at the University of Waterloo and the Ontario Research Centre for Computer Algebra at the University of Western Ontario[who?].","In 1989, the first graphical user interface for Maple was developed and included with version 4.3 for the Macintosh. X11 and Windows versions of the new interface followed in 1990 with Maple V. In 1994 a special issue of a newsletter created by Maple developers called MapleTech' was published.","In 1999, with the release of Maple 6, Maple included some of the NAG Numerical Libraries. In 2003, the current \"standard\" interface was introduced with Maple 9. This interface is primarily written in Java (although portions, such as the rules for typesetting mathematical formulae, are written in the Maple language). The Java interface was criticized for being slow; improvements have been made in later versions, although the Maple 11 documentation recommends the previous (“classic”) interface for users with less than 500 MB of physical memory. This classic interface is no longer being maintained.","Between the mid 1995 and 2005 Maple lost significant market share to competitors due to a weaker user interface. In 2005, Maple 10 introduced a new “document mode”, as part of the standard interface. The main feature of this mode is that math is entered using two dimensional input. In 2008, Maple 12 added additional user interface features found in Mathematica, including special purpose style sheets, control of headers and footers, bracket matching, auto execution regions, command completion templates, syntax checking and auto-initialization regions. Additional features were added for making Maple easier to use as a MATLAB toolbox.","In September 2009 Maple and Maplesoft were acquired by the Japanese software retailer Cybernet Systems.","Sample imperative programming constructs:","Simple functions can also be defined using the \"maps to\" arrow notation:","Find","Answer:","Compute the determinant of a matrix.","Answer: ","Plot  with  ranging from -10 to 10","Plot  with  and  ranging from -1 to 1","Find functions  that satisfy the integral equation .","Answer: ","The Maple engine is used within several other products from Maplesoft:","Listed below are third-party commercial products that no longer use the Maple engine:","Single-user editions of Maple are locked to the hardware of the computer they run on. This means that Maple may refuse to start if certain parts of the computer's hardware are removed or replaced. In this case the customer support has to be called to receive a new licence file for the updated hardware."]}