{"name":"Mathematica","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Mathematica","description":["Mathematica is a computational software program used in scientific, engineering, and mathematical fields and other areas of technical computing. It was conceived by Stephen Wolfram and is developed by Wolfram Research of Champaign, Illinois.","The name of the program “Mathematica” was suggested to Stephen Wolfram by Apple co-founder Steve Jobs although Stephen Wolfram had thought about it earlier and rejected it.","Features of Mathematica include:","Mathematica is split into two parts, the kernel and the front end. The kernel interprets expressions (Mathematica code) and returns result expressions.","The front end, designed by Theodore Gray, provides a GUI, which allows the creation and editing of Notebook documents containing program code with prettyprinting, formatted text together with results including typeset mathematics, graphics, GUI components, tables, and sounds. All contents and formatting can be generated algorithmically or interactively edited. Most standard word processing capabilities are supported, but there is only one level of \"undo.\"","Documents can be structured using a hierarchy of cells, which allow for outlining and sectioning of a document and support automatic numbering index creation. Documents can be presented in a slideshow environment for presentations. Notebooks and their contents are represented as Mathematica expressions that can be created, modified or analysed by Mathematica programs. This allows conversion to other formats such as TeX or XML.","The front end includes development tools such as a debugger, input completion and automatic syntax coloring.","The standard front end is used by default, but alternative front ends are available. They include the Wolfram Workbench, an Eclipse based IDE, introduced in 2006. It provides project-based code development tools for Mathematica, including revision management, debugging, profiling, and testing. Mathematica also includes a command line front end.","In recent years, the capabilities for high-performance computing have been extended with the introduction of packed arrays (version 4, 1999) and sparse matrices (version 5, 2003), and by adopting the GNU Multi-Precision Library to evaluate high-precision arithmetic.","Version 5.2 (2005) added automatic multi-threading when computations are performed on multi-core computers. This release included CPU specific optimized libraries. In addition Mathematica is supported by third party specialist acceleration hardware such as ClearSpeed.","In 2002, gridMathematica was introduced to allow user level parallel programming on heterogeneous clusters and multiprocessor systems and in 2008 parallel computing technology was included in all Mathematica licenses including support for grid technology such as Windows HPC Server 2008, Microsoft Compute Cluster Server and Sun Grid.","Support for CUDA and OpenCL GPU hardware was added in 2010. Also, version 8 can generate C code, which is automatically compiled by a system C compiler, such as Intel C++ Compiler or compiler of Visual Studio 2010.","Several solutions are available for deploying applications written in Mathematica:","Communication with other applications occurs through a protocol called MathLink. It allows communication between the Mathematica kernel and front-end, and also provides a general interface between the kernel and other applications.","Although Mathematica has a large array of functionality, a number of interfaces to other software have been developed, for use where other programs have functionality that Mathematica does not provide, to enhance those applications, or to access legacy code.","Wolfram Research freely distributes a developer kit for linking applications written in the C programming language to the Mathematica kernel through MathLink.","Using .NET\/Link., a .NET program can ask Mathematica to perform computations; likewise, a Mathematica program can load .NET classes, manipulate .NET objects and perform method calls. This makes it possible to build .NET graphical user interfaces from within Mathematica. Similar functionality is achieved with J\/Link., but with Java programs instead of .NET programs.","Communication with SQL databases is achieved through built-in support for JDBC. Mathematica can also install web services from a WSDL description.","Other languages that connect to Mathematica include Haskell,AppleScript,Racket,Visual Basic,Python and Clojure.","JavaTools is a Java-based solution for Mathematica that provides several high-performance implementations of various algorithms, mostly combinatorial optimization and concurrency, as well as instant compilation and execution of user code in Java, Scala, C#, and F#.","Links are available to many specialized mathematical software packages including OpenOffice.org Calc,Microsoft Excel,MATLAB,R,Sage,SINGULAR,Wolfram SystemModeler and Origin.","Mathematical equations can be exchanged with other computational or typesetting software via MathML.","Mathematica can capture real-time data via a link to LabView, from financial data feeds and directly from hardware devices via GPIB (IEEE 488),USB and serial interfaces. It automatically detects and reads from HID devices.","Alternative interfaces are available such as JMath, based on GNU readline and MASH which runs self contained Mathematica programs (with arguments) from the UNIX command line.","Mathematica includes collections of curated data in a consistent framework for immediate computation. Data can be accessed programmatically to inform or test models and is updated automatically from a data server at Wolfram Research. Some data such as share prices and weather are delivered in real-time. Data sets currently include:","Mathematica is proprietary software restricted by both copyright law and trade secret.","A regular single-user license for Mathematica used in a commercial environment costs $2495. It includes four additional kernels for parallel computations and one year of service that includes updates, technical support, a home use license, a webMathematica Amateur license, a Wolfram Workbench license and three Mathematica Player Pro licenses. Discounts are available for government, charity, educational, pre-college, school, student, home use and retiree use and depend on geographical region. Student licenses cost $140. A general \"home use\" license (\"Mathematica Home Edition\") is also available to the public and is priced at $295. Educational site licenses allow use by students at home. A license manager similar to FLEXnet is available to provide sharing of licenses within a group.","Mathematica 8 is supported on various versions of Linux, Apple's Mac OS X, and NT-based Microsoft Windows. All platforms are supported with 64-bit implementations. Earlier versions of Mathematica up to 6.0.3 supported other operating systems, including Solaris, AIX, Convex, HP-UX, IRIX, MS-DOS, NeXTSTEP, OS\/2, Ultrix and Windows Me.","Mathematica built on the ideas in Cole and Wolfram's earlier Symbolic Manipulation Program (SMP).","Wolfram Research has released the following versions of Mathematica:"]}