{"name":"MATLAB","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/MATLAB","description":["MATLAB (matrix laboratory) is a numerical computing environment and fourth-generation programming language. Developed by MathWorks, MATLAB allows matrix manipulations, plotting of functions and data, implementation of algorithms, creation of user interfaces, and interfacing with programs written in other languages, including C, C++, Java, and Fortran.","Although MATLAB is intended primarily for numerical computing, an optional toolbox uses the MuPAD symbolic engine, allowing access to symbolic computing capabilities. An additional package, Simulink, adds graphical multi-domain simulation and Model-Based Design for dynamic and embedded systems.","In 2004, MATLAB had around one million users across industry and academia. MATLAB users come from various backgrounds of engineering, science, and economics. MATLAB is widely used in academic and research institutions as well as industrial enterprises.","Cleve Moler, the chairman of the computer-science department at the University of New Mexico, started developing MATLAB in the late 1970s. He designed it to give his students access to LINPACK and EISPACK without them having to learn Fortran. It soon spread to other universities and found a strong audience within the applied mathematics community. Jack Little, an engineer, was exposed to it during a visit Moler made to Stanford University in 1983. Recognizing its commercial potential, he joined with Moler and Steve Bangert. They rewrote MATLAB in C and founded MathWorks in 1984 to continue its development. These rewritten libraries were known as JACKPAC. In 2000, MATLAB was rewritten to use a newer set of libraries for matrix manipulation, LAPACK.","MATLAB was first adopted by researchers and practitioners in control engineering, Little's specialty, but quickly spread to many other domains. It is now also used in education, in particular the teaching of linear algebra and numerical analysis, and is popular amongst scientists involved in image processing.","The MATLAB application is built around the MATLAB language, and most use of MATLAB involves typing MATLAB code into the Command Window (as an interactive mathematical shell), or executing text files containing MATLAB code and functions.","Variables are defined using the assignment operator, =. MATLAB is a weakly typed programming language. It is a weakly typed language because types are implicitly converted. It is a dynamically typed language because variables can be assigned without declaring their type, except if they are to be treated as symbolic objects, and that their type can change. Values can come from constants, from computation involving values of other variables, or from the output of a function. For example:","As suggested by its name (a contraction of \"Matrix Laboratory\"), MATLAB can create and manipulate arrays of 1 (vectors), 2 (matrices), or more dimensions. In the MATLAB vernacular, a vector refers to a one dimensional (1×N or N×1) matrix, commonly referred to as an array in other programming languages. A matrix generally refers to a 2-dimensional array, i.e. an m×n array where m and n are greater than 1. Arrays with more than two dimensions are referred to as multidimensional arrays. Arrays are a fundamental type and many standard functions natively support array operations allowing work on arrays without explicit loops. Therefore the MATLAB language is also an example of array programming language.","A simple array is defined using the syntax: init:increment:terminator. For instance:","defines a variable named array (or assigns a new value to an existing variable with the name array) which is an array consisting of the values 1, 3, 5, 7, and 9. That is, the array starts at 1 (the init value), increments with each step from the previous value by 2 (the increment value), and stops once it reaches (or to avoid exceeding) 9 (the terminator value).","the increment value can actually be left out of this syntax (along with one of the colons), to use a default value of 1.","assigns to the variable named ari an array with the values 1, 2, 3, 4, and 5, since the default value of 1 is used as the incrementer.","Indexing is one-based, which is the usual convention for matrices in mathematics, although not for some programming languages.","Matrices can be defined by separating the elements of a row with blank space or comma and using a semicolon to terminate each row. The list of elements should be surrounded by square brackets: []. Parentheses: () are used to access elements and subarrays (they are also used to denote a function argument list).","Sets of indices can be specified by expressions such as \"2:4\", which evaluates to [2, 3, 4]. For example, a submatrix taken from rows 2 through 4 and columns 3 through 4 can be written as:","A square identity matrix of size n can be generated using the function eye, and matrices of any size with zeros or ones can be generated with the functions zeros and ones, respectively.","Most MATLAB functions can accept matrices and will apply themselves to each element. For example, mod(2*J,n) will multiply every element in \"J\" by 2, and then reduce each element modulo \"n\". MATLAB does include standard \"for\" and \"while\" loops, but (as in other similar applications such as R), using the vectorized notation often produces code that is faster to execute. This code, excerpted from the function magic.m, creates a magic square M for odd values of n (MATLAB function meshgrid is used here to generate square matrices I and J containing 1:n).","MATLAB has structure data types. Since all variables in MATLAB are arrays, a more adequate name is \"structure array\", where each element of the array has the same field names. In addition, MATLAB supports dynamic field names (field look-ups by name, field manipulations, etc.). Unfortunately, MATLAB JIT does not support MATLAB structures, therefore just a simple bundling of various variables into a structure will come at a cost.[citation needed]","MATLAB supports elements of lambda-calculus by introducing function handles, or function references, which are implemented either in .m files or anonymous\/nested functions.","Although MATLAB has classes, the syntax and calling conventions are significantly different from other languages. MATLAB has value classes and reference classes, depending on whether the class has handle as a super-class (for reference classes) or not (for value classes).","Method call behavior is different between value and reference classes. For example, a call to a method","can alter any member of object only if object is an instance of a reference class.","MATLAB supports developing applications with graphical user interface features. It also has tightly-integrated graph-plotting features. For example the function plot can be used to produce a graph from two vectors x and y. The code:","produces the following figure of the sine function:","","A MATLAB program can produce three-dimensional graphics using the functions surf, plot3 or mesh.","In MATLAB, graphical user interfaces can be programed with the GUI design environment (GUIDE) tool.","MATLAB's support for object-oriented programming includes classes, inheritance, virtual dispatch, packages, pass-by-value semantics, and pass-by-reference semantics.","When put into a file named hello.m, this can be executed with the following commands:","MATLAB can call functions and subroutines written in the C programming language or Fortran. A wrapper function is created allowing MATLAB data types to be passed and returned. The dynamically loadable object files created by compiling such functions are termed \"MEX-files\" (for MATLAB executable).","Libraries written in Java, ActiveX or .NET can be directly called from MATLAB and many MATLAB libraries (for example XML or SQL support) are implemented as wrappers around Java or ActiveX libraries. Calling MATLAB from Java is more complicated, but can be done with MATLAB extension, which is sold separately by MathWorks, or using an undocumented mechanism called JMI (Java-to-MATLAB Interface), which should not be confused with the unrelated Java Metadata Interface that is also called JMI.","As alternatives to the MuPAD based Symbolic Math Toolbox available from MathWorks, MATLAB can be connected to Maple or Mathematica.","Libraries also exist to import and export MathML.","MATLAB is a proprietary product of MathWorks, so users are subject to vendor lock-in. Although MATLAB Builder can deploy MATLAB functions as library files which can be used with .NET or Java application building environment, future development will still be tied to the MATLAB language.","Each toolbox is purchased separately. If an evaluation licence is requested, the MathWorks sales department requires detailed information about the project for which MATLAB is to be evaluated. Overall the process of acquiring a licence is expensive in terms of money and time[citation needed]. If granted (which it often is), the evaluation licence is valid for two to four weeks. A student version of MATLAB is also available.","The licensing of Mathworks software is under investigation in 2012 for anti-trust behavior by the EU.","MATLAB has a number of competitors. Commercial competitors include, Mathematica, Maple, NAG, IDL by ITT Visual Information Solutions, Metlynx and Xoctave as MATLAB's desktop environment alternative which uses GNU Octave.","There are also free open source alternatives to MATLAB, in particular GNU Octave, FreeMat, and Scilab which are intended to be mostly compatible with the MATLAB language.","NCLab provides a cloud interface to Octave, allowing users to store and run their MATLAB files in the web browser. NCLab is free for individual non-commercial users and has virtually no limitations. Institutions pay a symbolic subscription fee.","Among other languages that treat arrays as basic entities (array programming languages) are APL and J, Fortran 90 and higher, as well as the statistical language S (the main implementations of S are S-PLUS and the popular open source language R).","There are also several libraries to add similar functionality to existing languages, such as IT++ for C++, Perl Data Language for Perl, ScalaLab for Scala and SciPy together with NumPy and Matplotlib for Python.","The number (or Release number) is the version reported by Concurrent License Manager program FlexLM.","Several easter eggs exist in MATLAB. These include hidden pictures, and random in-jokes. For example, typing in \"spy\" will get a generate of the spies from spy vs spy. Typing in \"why\" randomly outputs a philosophical answer. Other commands include \"penny\", and \"life\".",""]}