{"name":"MicroScript","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/MicroScript_(programming_language)","description":["TRON is an open real-time operating system kernel design, and is an acronym for \"The Real-time Operating system Nucleus\". The project was started by Prof. Dr. Ken Sakamura of the University of Tokyo in 1984. The project's goal is to create an ideal computer architecture and network, to provide for all of society's needs.","The Industrial TRON (ITRON) derivative is one of the world's most used operating systems, being present in billions of electronic devices such as cellphones, appliances and even cars. The operating system is mainly used by Japanese companies, although interest in ITRON is growing worldwide. However, it has been said that there is much misinformation in the English speaking world about TRON due to the majority of the documentation being in Japanese.","The TRON Project has been integrated into T-Engine Forum in 2010.","TRON itself does not specify the source code for the kernel, but instead is a \"set of interfaces and design guidelines\" for creating the kernel. This allows different companies to create their own versions of TRON, based on the specifications, which can be suited for different microprocessors.","While the specification of TRON is publicly available, implementations can be proprietary at the discretion of the implementor.","The TRON framework defines a complete architecture for the different computing units:","In 1984, the TRON Project was officially launched. A year later, in 1985, NEC announced the first ITRON implementation based on the ITRON\/86 specification. In 1986 the TRON Kyogikai (unincorporated TRON Association) was established, Hitachi announced its ITRON implementation based on the ITRON\/68K specification, and the first TRON project symposium is held. In 1987, Fujitsu announced an ITRON implementation based on the ITRON\/MMU specification, Mitsubishi Electric announced an ITRON implementation based on the ITRON\/32 specification, and Hitachi introduced the Gmicro\/200 32bit microprocessor based on the TRON VLSI CPU specification. In 2004, the governor of Tokyo, Shintaro Ishihara mentioned \"TRON was once killed by the former Minister of International Trade and Industry, Hashimoto, because he was at that time under the pressure of United States.\" This story is supported by an article on the tron project website, citing Microsoft's lobbying against it.","The TRON Project was administered by the TRON Association. It has been integrated into T-Engine Forum in 2010. TRON Project activities have been taken over and continued by T-Engine Forum.","T-Engine Forum is a non-profit organization which develops open specifications for ITRON, T-Kernel and ubiquitous ID architecture. The chair of T-Engine Forum is Dr. Ken Sakamura. As of July, 2011 there are 266 members in T-Engine forum. Executive committee members includes top Japanese giants like Fujitsu, Hitachi, NTT DoCoMo and Denso. A-level members who are involved in design and development of specifications for T-Engine and T-Kernel, or of Ubiquitous ID technology includes companies likes NEC and Yamaha Corporation. B-level members who are involved in development of product using T-Engine specification and T-Kernel includes companies like ARM, Freescale, MIPS Technologies, Mitsubishi, Robert Bosch GmbH, Sony Corporation, Toshiba and Xilinx. The supporting members and academic members involved with the forum includes many universities like University of Tokyo, Japan and Dalian Maritime University, China.","The MicroScript programming language is a graphically-oriented, high-level programming language created by Personal Media Corporation for TRON. It is similar to Apple Computer's HyperTalk. It is intended mainly for end users with little or no programming experience, yet is also used as a development tool by professional BTRON programmers to port software between TRON variants, and to easily and quickly write device drivers for hardware devices. MicroScript is based on, and makes extensive use of, the TRON Basic Text Editor, and Basic Figure Editor.","R1 (from 2003-04; Pentium III M, 866 MHz)","T2 (from 2003-06; Pentium M, 900 MHz)","W2B (from 2003-10; Pentium M, 1.0 GHz)","Y2C (from 2004-03; Pentium M, 1.2 GHz)","R3EG (from 2004-11; Pentium M, 1.1 GHz)"]}