{"name":"X++","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Microsoft_Dynamics_AX","description":["Microsoft Dynamics AX is one of Microsoft's enterprise resource planning software products. It is part of the Microsoft Dynamics family.","Microsoft Dynamics AX was originally developed as a collaboration between IBM and Damgaard as IBM Axapta. IBM returned all rights in the product to Damgaard shortly after the release of Version 1.5. before Damgaard was merged with Navision Software A\/S in 2000. The combined company, initially NavisionDamgaard, later Navision A\/S, was then ultimately acquired by the Microsoft Corporation in the summer of 2002. Before the merger, Axapta was initially released in March, 1998 in the Danish and U.S. markets. Today, it is available and supported in forty-five languages in most of the world.","Custom AX development and modification is done with its own IDE, MorphX, which resided (until Dynamics AX 2012) in the same client application that a normal day-to-day user would access, thus allowing development to take place on any instance of the client. The development language used in Axapta is X++. Since the Dynamics AX 2012 version, development is done using a Visual Studio plugin, thus it can be done only on computers where the Visual Studio 2010 is installed.","On May 26, 2008, Microsoft completed developing (2009) in facilities spanning the globe and including sites in Vedbæk - Denmark; Kiev - Ukraine; Fargo, North Dakota - USA and Redmond, Washington - USA.","In September, 2011, Microsoft announced the release of new version AX 2012.","MDCC or Microsoft Development Center Copenhagen was once the primary development center for Dynamics AX. For a long time, the development of several key components of AX has been moving to other sites like Redmond and Fargo. MDCC is located in Vedbæk and also houses Microsoft Dynamics NAV and several other Microsoft Dynamics family products. MDCC employs about 900 people of around 40 different nationalities, with current hiring focus oriented towards Sweden, Denmark, Poland, Ukraine, Russia and Romania.","The early versions (from 1.0 to 3.0) were called Axapta, while the later versions (from 3.0 SP6 to AX 2009) are called Dynamics AX.","Development of Axapta began in 1983 at Danish company Damgaard Data A\/S. The software was mainly targeted at the European market, though the North American market grew rapidly following the release of Axapta 2.1 in 2000.","Following the merger of the two Danish companies Navision and Damgaard, Axapta was to be known as Navision Damgaard Axapta for versions 2.5 and 3.0 (up until 3.0 SP5).","Microsoft acquired Navision Damgaard during the summer of 2002. Navision Damgaard Axapta was first renamed to Microsoft Business Solutions Axapta, then to Microsoft Dynamics AX for versions 3.0 SP6, 4.0 and 2009.","Microsoft Dynamics AX contains 19 core modules:","The following modules are part of the core of AX 2009 (AX 5.0) and available on a per-license basis in AX 4.0 :","Several external components are also available:","The Microsoft Dynamics AX software is composed of four major components:","See also the book Inside Microsoft Dynamics AX 4.0","MorphX is an integrated development environment in Microsoft Dynamics AX that allows developers to graphically design data types, base enumerations, tables, queries, forms, menus and reports. MorphX supports drag-and-drop and is very intuitive[vague]. It also allows access to any application classes that are available in the application, by launching the X++ code editor.","Because MorphX uses referencing to link objects together, changes in, for example, datatypes of fieldnames will automatically be reflected in all places where they are used (such as forms or reports). Furthermore, changes made through MorphX will be reflected in the application immediately after compilation.","Microsoft Dynamics AX also offers support for version control systems (VCS) integrated with the IDE, allowing collaboration in development. There is also a tool for reverse-engineering table structures and class structures to Visio. The actual implementation limits the practical use of both these features.","X++ itself is the programming language behind MorphX, and belongs to the curly brackets and .-operator class of programming languages (like C# or Java). It is an object-oriented, class-based, single dispatch language. X++ is a derivative of C++ (both lack the finally keyword for example) to which garbage collection and language-integrated SQL queries were added.","X++ integrates SQL queries into standard Java-style code. Following are three equivalent examples (result-wise), though the first one has generally better performance. Samples #2 and #3 hint at an object-like behavior from table buffers.","Sample #1","Sample #2","Sample #3","The LINQ library was first used in Microsoft Dynamics AX 2009 for out-of-the-box SSRS reporting. It is expected that Visual Studio and the LINQ library will be used more extensively in future versions of AX.","One of the most notable sources of information with regards to Axapta (prior to the Microsoft purchase) was technet.navision.com, a proprietary web-based newsgroup, which grew to a considerable number of members and posts up until 2002.","Following the incorporation of Axapta into Microsoft's Business Solution suite, the newsgroup's content was transferred over to the Microsoft Business Solutions newsgroup. The oldest Axapta Technet post that can be found today dates back to August 2000. During the Axapta 3.0 era, this newsgroup in conjunction with secured official Microsoft websites (Partnersource for Microsoft Partners and Axapta resellers and Customersource for licensed Axapta customers) accounted for most of the official documentation sources on Axapta. During this time freely accessible documentation remained scarce. Following Microsoft's release of Dynamics AX 4.0, Axapta's presence on the World Wide Web greatly improved through heightened interest from professional blogs as well as a continually improving presence on MSDN. Though MSDN contained mostly placeholders immediately following the release, it now contains a wealth of information from a complete SDK to white papers and code samples."]}