{"name":"MIIS","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/MIIS_(programming_language)","description":["MIIS (Meditech Interpretive Information System) is a MUMPS-like programming language developed by Meditech in the 1970s. Early development of MUMPS is credited to A. Neil Pappalardo and Octo Barnett of Massachusetts General Hospital. MUMPS evolution took two major directions: MUMPS proper and MIIS. MUMPS became an ANSI and ISO-standard language. When many MUMPS implementations standardized to be compatible, MIIS did not standardize, but became a proprietary system instead.","As an example of the differences between MUMPS and MIIS, the value of a logical expression in MUMPS may be false = zero (0) or true = non-zero, canonically, one (1). In MIIS, the value false is the ASCII character \"nul\" (byte with all 0 bits = binary 0) and the value of true is \"del\" (7 bits of a byte with all 1 bits = binary 127). (note: ASCII is not an 8-bit standard, but a 7-bit standard).","There is also a philosophical difference between the dialects. MIIS often takes the approach that code should march along, regardless of possible errors, where MUMPS will error out to prevent more serious problems. For example, when encountering an undefined variable, MUMPS generates an error where MIIS treats it as nil.","In the 1980s Brigham and Women's Hospital in Massachusetts used MIIS to program their Data General Mainframe. In 1986, SCAMC reported that Vancouver General Hospital also had a Integrated Cardiology Patient Management System written in MIIS.","The MIIS language has been used in programming library systems as well as health industry systems. The OCLC's library system is one example. It has also been used to create financial systems for insurance brokers, as seen in Ireland and the UK in the late 1970s.","Marilyn Lutz, (1993) \"OCLC's Local Library System: LS\/2000\", Library Hi Tech, Vol. 2 Iss: 2, pp. 7 – 16","F. Michael Kiely (1988) \"An Integrated Cardiology Patient Management System\" Proceedings of the Annual Symposium on Computeters in Applied Medical Care. 1988 November 9: 693–697.",""]}