{"name":"MIVA Script","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/MIVA_Script","description":["Miva Script is a proprietary computer scripting language mainly used for internet applications such as e-commerce. Today it is developed by Miva Merchant, based in San Diego, California. Although quite a number of web hosting companies support Miva Script on their servers, it is significantly less widespread than its popular competitor PHP.","The language was first developed under the name htmlscript by Joe Austin and others in 1995, and a company, htmlscript corporation, was formed the following year.","In 1997, Jon Burchmore extensively rewrote the language to make it more syntactically consistent, although the new engine supported both old htmlscript and new (named mivascript) syntaxes.","Miva Script is often described as 'XML-like' although this is something of a misnomer. It consists of tags which may be interspersed with (x)html and which all start with ","One of the distinguishing features of Miva Script is the native support for a variation of dBase database platform (DBF III) tables with a proprietary index format and support for SQL. Many installations today are running with Mysql database.","Variables are untyped and are not pre-declared. .mvc and .mv are the file extensions used for Miva Script. .mvt is the commom file extension for runtime compiled template source files.","Empresa is the underlying engine for Miva Script. In versions numbered less than 4.0, Miva Merchant Empresa is a script interpreter available for web servers running *nix and Microsoft Windows operating systems. The most recent interpreter version is 3.9705. Interpreted Miva Script is still widely supported by many web hosts. Versions numbered 3.9x are a transitional form of the language, implementing some (but not all) of the new features found in version 4, such as arrays.","Since 4.0, Miva Merchant Empresa is a Virtual Machine for running compiled MIVA Script, again available in versions for *nix and Microsoft Windows.","The current version level 5.x added new language constructs, native SQL support, a new access-methodology for dbase3 tables, called MIVA-SQL, as well as a new templating syntax that the Empresa virtual machine can compile on the fly. Version 5.08 and later support the GD Graphics Library.","Miva Merchant Mia is a version of the Empresa engine designed to run on a Windows PC as a localhost server watching a specified port. (usually 8000 or 8080). No other server software is required unless the POP and SMTP functions are required. This provides a portable, stand-alone development environment.","Miva Merchant Mia is updated with each Miva Merchant Empresa release. Like Empressa, versions prior to 4 are interpreters while 4.0+ only work with compiled script. There are a few minor differences between.","Miva Merchant Script Compiler was introduced in mid-2002, claiming to offer better performance and the closure of application source code. Compilability required some changes to the language, with support for the old htmlscript syntax and macros evaluated at runtime (often considered a security risk) dropped. The compiler produces a platform-independent bytecode which runs on the Miva Merchant Empresa and Miva Merchant Mia Virtual Machines (There are minor variations between Empresa and Mia virtual machines).","In May 2005, MIVA Corporation made the Script Compiler available free. In 2011 the built in licensing code was removed simplifying installation.","In August 2007, Miva Merchant was separated from its parent company as a result of a management buy-out. (ref. press release)","February 2011 introduced the new MivaScript.com website fully documenting the latest version of the language, including the GD Graphics Library."]}