{"name":"NASM","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Netwide_Assembler","description":["The Netwide Assembler (NASM) is an assembler and disassembler for the Intel x86 architecture. It can be used to write 16-bit, 32-bit (IA-32) and 64-bit (x86-64) programs. NASM is considered to be one of the most popular assemblers for Linux.","NASM was originally written by Simon Tatham with assistance from Julian Hall, and is currently maintained by a small team led by H. Peter Anvin. It is available as free software under the terms of the simplified (2-clause) BSD license.","NASM can output several binary formats including COFF, Portable Executable, a.out, ELF and Mach-O, though position-independent code is only supported for ELF object files. NASM also has its own binary format called RDOFF.","The variety of output formats allows programs to be retargeted to virtually any x86 operating system. In addition, NASM can create flat binary files, usable in writing boot loaders, ROM images, and in various facets of OS development. NASM can run on non-x86 platforms, such as SPARC and PowerPC, though it cannot generate programs usable by those machines.","NASM uses a variation of Intel assembly syntax instead of AT&T syntax. It also avoids features such as automatic generation of segment overrides (and the related ASSUME directive) used by MASM and compatible assemblers.","This is a Hello world program for the DOS operating system.","An example of a similar program for Microsoft Windows:","An equivalent program for Linux:","NASM principally outputs object files, which are generally not executable in and of themselves. The only exception to this are flat binaries (e.g., .COM) which are inherently limited in modern use. To translate the object files into executable programs, an appropriate linker must be used, such as the Visual Studio \"LINK\" utility for Windows or ld for UNIX-like systems.","On 28 November 2007, version 2.00 was released, adding support for x86-64 extensions. The development versions are not uploaded to SourceForge.net; instead, they are checked in to the project's own Git repository with binary snapshots available from the project web page.","A search engine for NASM docs is also available.","As of version 2.07, NASM is now under the Simplified (2-clause) BSD license."]}