{"name":"NEWP","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/NEWP","description":["NEWP (or the New Executive Programming Language) is a high-level programming language used on the Unisys MCP systems. The language is used to write the operating system and other system utilities, although it can also be used to write user software as well. Several constructs separate it from extended ALGOL on which it is based. Language operators such as MEMORY which allows direct memory access are strictly used by programs running as the MCP.","NEWP is a block-structured language very similar to Extended ALGOL. It includes several features borrowed from other programming languages which help in proper software engineering. These include modules (and later, super-modules) which group together functions and their data, with defined import and export interfaces. This allows for data encapsulation and module integrity. Since NEWP is designed for use as an operating system language, it permits the use of several unsafe constructs. Each block of code can have specific unsafe elements permitted. Unsafe elements are those only permitted within the operating system. These include access to the tag of each word, access to arbitrary memory elements, low-level machine interfaces, etc. If a program does not make use of any unsafe elements, it can be compiled and executed by anyone. If any unsafe elements are used, the compiler marks the code as non-executable. It can still be executed if blessed by a security administrator.","NEWP is rumored to really stand for \"Nearly Every Word Pascal\" after a West coast engineering initiative to move Burroughs languages such as ALGOL over to a more Pascal-like syntax. Stories were also told that it stands for \"No Executive Washroom Privileges,\" supposedly after its designers fell out of favor with management. Alternately, NEWP was chosen as the name of the compiler\/language at the spur of the moment, by the designer, when pressed for a name under which the compiler code would be managed. It stood for \"NEW Programming language\", an essentially dull name, with the unhappy property that the \"new\" part of the name would quickly become inappropriate. The original designer of the project was a Texan and soon started to describe the name as the answer to the question, \"Is it done yet?\". NEWP sounded like a West Texas version of \"nope\". Once the project was released, the name was \"redefined\" to stand for \"No Executive Washroom Privileges\" - a description of the type of person who would likely use the language. For a while a contest ran to come up with a better name for the compiler and language, but by that time the name NEWP had sunk its roots too deeply."]}