{"name":"NSIS","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Nullsoft_Scriptable_Install_System","description":["Nullsoft Scriptable Install System (NSIS) is a script-driven Windows installation system with minimal overhead backed by Nullsoft, the creators of Winamp. NSIS has risen to popularity as a widely used alternative to commercial and proprietary products like InstallShield.","NSIS is free software released under a combination of free software licenses, primarily the zlib license.","NSIS was created to distribute Winamp. It is based on a previous Nullsoft product, PiMP (plugin Mini Packager), and is also known as SuperPiMP. After version 2.0a0, the project was moved to SourceForge where developers outside of Nullsoft started working on it on a regular basis. NSIS 2.0 was released approximately two years later.","NSIS version 1 is in many ways similar to the classic Windows Installer, but it is easier to script and supports more compression formats. NSIS version 2 features a new streamlined graphical user interface and supports LZMA compression, multiple languages, and an easy to use plugin system.","The NSIS compiler program makensis compiles scripts like the following example into executable installation programs. Each line in the script contains a single command.","Version 2.0 introduced a new optional streamlined graphical user interface called Modern UI (MUI). The MUI has a wizard-like interface. It supports a welcome page, finish page, language selection dialog, description area for components, and greater customization options than the old user interface.","Since NSIS version 2.30 (Released on 25 August 2007) there is new version (beta) of this UI accessible: Modern UI 2 (MUI2) which is an enhancement to Modern UI. Unlike the old MUI this version is based on nsDialogs instead of old-fashioned InstallOptions .ini files.","From version 2.34 (Released on 24 December 2007) this MUI2 is ready for mass consumption and it is included in all NSIS packages. Also all examples had been switched to it. Modern UI 2 documentation.","NSIS can be extended with plugins that can communicate with the installer. Plugins can be written in C, C++, and Delphi, and can be used to perform installation tasks or extend the installer interface. A plugin can be called with a single line of NSIS code.","Several plugins come with the NSIS package that permit the installer to display a splash screen, display a custom page, display an image on the background, download files from a website, perform mathematical operations, patch files and more.","Other plugins are available online, including ZipDLL, and a Python plugin.","NSIS supports the following features:","NSIS projects can be configured by simply editing text files (with .nsi extension). However, several third parties provide editing software:","Several projects that extend or replace the Modern UI have started in the past few years. Interfaces such as the ExperienceUI and UltraModernUI completely change the style of the installer by skinning it to look like the InstallShield interface. Other interfaces like InstallSpiderUI aim for a more minimalistic approach on the visual side of things while maintaining the same level of functionality as the Modern UI.","The generated installer is a Portable Executable, with the installation files archived within the installer, a 34 KB overhead for the NSIS installer, and the installation script compiled into executable code. As the installation script is compiled, the script can not be obtained from the delivered executable without reverse-engineering the binary.","The archive may be unpacked using either 7-Zip, the Total Commander plugin \"InstallExplorer\", or the predecessor by the same name for the FAR Manager.","The archive contains several folders:","The official release of NSIS does not support Unicode but only a means to convert some files to different encodings via a plugin. However, a variant of NSIS that has full Unicode support is available. Notable projects using this variant are:","A widespread malware company named itself NSIS Media. NSIS Media and NSIS are not related by anything but name. Choosing a reliable download source, as with everything downloaded from the Internet, should be done to avoid this malware.","Several antivirus companies have labeled plugins such as NSISdl, which provides HTTP downloading functionality, as trojans. This is also incorrect. While NSIS is a scriptable system and thus could be used to create malware, that is not its primary purpose and this condition in fact applies to all programming languages."]}