{"name":"Opa","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Opa_(programming_language)","description":["Opa is an open source programming language for developing scalable web applications.","It can be used for both client-side and server-side scripting, where complete programs are written in Opa and subsequently compiled to native code on the server and JavaScript on the client, with the compiler automating all communication between the two. Opa implements strong, static typing, which can be helpful in protecting against security issues such as SQL injections and cross-site scripting attacks.","The language was first officially presented at the OWASP conference in 2010, and the source code was released on GitHub in June 2011, under a GNU Affero General Public License.","Opa consists of a web server, a database and distributed execution engine. Code written in Opa is compiled to native code on the server side and to JavaScript using jQuery for cross-browser compatibility on the client side. The advantage of the approach compared to certain Rich Internet Application (RIA) platforms is that users are not required to install a plugin in their browser. Opa shares motivations with web frameworks, but takes a different approach. Its designers assert that this helps Opa to avoid many security issues, like SQL injections or XSS attacks.","The core language is functional and has a static type system with type inference. Opa also provides sessions which encapsulate an imperative state and communicate using message passing, similar to Erlang processes. Opa provides many structures or functions that are common in web development, as first-class objects, for instance HTML and parsers, based on Parsing Expression Grammars. Because of this adhesion between the language and web-related concepts, Opa is not intended for non-web applications (for instance desktop applications).","The 0.9.0 release in February 2012 introduced database mapping technology for the non-relational, document-oriented database MongoDB, similar to object-relational mapping.","The traditional Hello world program, producing a web server that serves a static page with \"Hello, web!\" as its content, can be written in Opa as:","It can be compiled to a stand-alone executable binary with:","Running the resulting binary launches the web application:","Opa is packaged with the opa-cloud tool to help deployment on several instances. The following command launches the application, configures load balancing and makes servers share information automatically:"]}