{"name":"OpenEdge ABL","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/OpenEdge_Advanced_Business_Language","description":["OpenEdge Advanced Business Language, or OpenEdge ABL for short, is a business application development language created and maintained by Progress Software Corporation (PSC). The language, typically classified as a fourth-generation programming language, uses an English-like syntax to simplify software development. The name was changed in 2006 to OpenEdge Advanced Business Language (OpenEdge ABL), by PSC, from PROGRESS, also known as Progress 4GL, in order to overcome a presumed industry perception that 4GLs were less capable than other languages. The language was called PROGRESS or Progress 4GL prior to the release of version 10.0. A subset of the language, called SpeedScript, is used in the development of web applications.","OpenEdge ABL helps developers to develop applications optionally using its own integrated relational database and programming tool. These applications are portable across computing systems and allow access to various popular data sources without having to learn the underlying data access methods. This means that the end-user of these products can be unaware of the underlying architecture.","By combining a fourth generation language and relational database, OpenEdge ABL allows the use of the Rapid Application Development (RAD) model for developing software. A programmer and even end users can do rapid prototyping using the integrated and GUI tools of the development environment.","Progress ABL is a strongly typed, late-bound, English-like programming language. Although initially designed as a procedural language, starting with version 10.1 it was enhanced with object-oriented grammar elements, which can be mixed with the original procedural style. A block of code may be said to have a transaction scoped to it, in which case database changes will be committed when it completes. An error raised within such a block will undo these changes. These defaults may be overridden by the programmer.","Simple programs run without a Graphical User Interface, but there is syntax to create one programatically; or programmers can use the provided tools to build one.","The following ABL code creates a window with the text \"Hello, World!\" and a button labeled \"OK\".","OR let OpenEdge think for you and create a simple message box:","also, you can use ERROR and WARNING instead of INFO to change the message icons","OR to be most simplistic","The SQL statement:","can be expressed in Progress \/ ABL as:","The SQL statement","can be expressed in Progress \/ ABL as:","(Some assumptions have been made about indexing, locking and transaction scoping in order to keep this example simple.)"]}