{"name":"PeopleCode","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/PeopleCode","description":["PeopleCode is an (ool) object-oriented proprietary (case-insensitive) language used to express business logic for PeopleSoft applications. In its fundamentals, PeopleCode syntax resembles other programming languages. Some aspects of the PeopleCode language, however, are specifically related to the PeopleTools environment. However, the fundamentals of objects and classes are the same as in Java language. Definition name references, for example, enable you to refer to PeopleTools definitions, such as record definitions or pages, without using hard-coded string literals. Other language features, such as PeopleCode data types and metastrings, reflect the close interaction of PeopleTools and Structured Query Language (SQL). Dot notation, classes and methods in PeopleCode are similar to other object oriented languages, like Java.","PeopleCode supports the following types of functions:","Built-in: The standard set of PeopleCode functions. These can be called without being declared.","Internal: Functions that are defined (using the Function statement) within the PeopleCode program in which they are called.","External PeopleCode: PeopleCode functions defined outside the calling program. These are generally contained in record definitions that serve as function libraries.","External non-PeopleCode: Functions stored in external (C-callable) libraries.","In addition, PeopleCode supports methods. The main differences between a built-in function and a method are:","-A built-in function, in your code, is on a line by itself, and does not (generally) have any dependencies.","-You do not have to instantiate an object before you can use the function.","-A method can only be executed by an object (using dot notation).","-You must instantiate the object first.","You can also choose to omit the values for the bind variables and supply those values later. For Insert, Update, or Delete commands these values would be supplied using Execute method. (If you supply all the necessary input values, the SQL is executed immediately.)","PeopleCode Functions, http:\/\/www.homemarketeer.com\/peoplecode\/peoplecode.htm, retrieved 2008-12-14 "]}