{"name":"Phrogram","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Phrogram","description":["Phrogram is a commercial programming language designed by its creators to be understandable and appealing to beginning and intermediate programmers of all ages. Its predecessor, Kids Programming Language (KPL) was first released in August 2005 and its distribution was discontinued in May 2008. Phrogram was first released in October 2006 as v2.0; its current version, v2.5, was released in September 2008.","Phrogram comprises a programming language and integrated development environment, or IDE, bearing some similarities to Visual Basic. The language supports a number of scalar and complex data types, including structures, and provides limited support of objects (excluding inheritance and polymorphism). It features two \"modes\" - one for two-dimensional graphics and one for three-dimensional; these modes cannot be used at the same time.","Phrogram targets the Microsoft .NET Framework and provides many runtime functions and methods for interacting with that platform. Because of this, Phrogram as of 2010[update] operates only on the Microsoft Windows series of operating systems that support the .NET Framework.","A Phrogram program consists of a collection of nested code blocks. On the highest level is a Program block, and within this Method blocks and Function blocks are defined. Functions and Methods are both chunks of reusable code, available in the Program scope; Functions return values, while Methods may not. Data structures are defined within the Program scope. Variables must be declared and typed at the time of declaration.","As of 2010[update] the latest version of Phrogram, v2.5 (released September 2008), runs on Windows Vista and Windows 7 (both 32 and 64 bit editions of each), as well as on Windows XP and Windows 2000. Phrogram Express, the lower-priced version, does not include the Class Library Browser or the ability to export code to a free-standing executable package (capable of running outside the Phrogram IDE). Phrogram Academic, the full-featured version available for educators and students, has started to attract some interest as a way of teaching programming[citation needed] but is not usable to teach programming on operating systems other than Windows or to teach the concept of portable programming.","Which has since been updated to:","The syntax clearly explains what its purpose is, such as \"End Program\", or \"Main().\" This is a reason why many people go for Phrogram as a starting language.","Jonah Stagner started development on KPL when he wanted to teach his children how to program. He discovered that the tools and technologies were not at all as beginner-friendly as they needed to be, or used to be. The current nucleus of the Phrogram team - Walt Morrison, Andy Dunn and David Witus - continue to work on developing the product (including extensions through add-in libraries) as a commercial business venture.","Phrogram has the stated goal[citation needed] of delivering a simple yet powerful set of tools that makes learning to program easy and fun. Phrogram (like KPL) captures a novice's interest by the ease with which one can write attractive multi-media programs with eye-catching graphics, music, sound effects, and animations.[citation needed]","Phrogram has the secondary goal[citation needed] of providing a modern language with some features of advanced languages such as C++, Java, Visual Basic and C#, and Visual Basic syntax, to make the transition into those languages as easy as possible. Phrogram supports object-oriented programming (OOP) and allows for definition of classes and their associated properties and methods, which provides beginning programmers with an introduction to OOP programming.","To accomplish these goals, Phrogram's developers built it to run on .NET Framework 2.0 (which Microsoft released in November 2005). Phrogram intends to be fully compatible with other languages that use the .NET Framework, so that runtime libraries can be shared in either direction.","Phrogram is commercial software with a 30-day trial period. Phrogram’s user interface is available in several different languages by replacing the default xml file with a localized file, available in the downloads area of the Phrogram site.","Introductory programming courses at primary and secondary schools have used Phrogram, as have universities such as Ohio State University and the University of Michigan in the US, and the Waikato Institute of Technology and Unitec Institute of Technology, in New Zealand."]}