{"name":"PILOT","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/PILOT","description":["Programmed Instruction, Learning, Or Teaching (PILOT) is a simple historic programming language developed in the 1960s. Like its younger sibling LOGO, it was an early foray into the technology of computer assisted instruction (CAI).","PILOT was developed by John Amsden Starkweather, a psychology professor at the University of California, San Francisco medical center. In 1962 he developed a simple language for automating learning tests called Computest. Starting in 1968, he developed a follow-on project called PILOT, for various computers of the time such as the SDS 940.","A line of PILOT code contains (from left to right) the following syntax elements:","A label can also be alone in a line, not followed by other code. The syntax for a label is an asterisk followed by an identifier (alphanumeric string with alphabetic initial character).","The following commands are used in \"core PILOT\". Lines beginning with \"R:\" indicate a remark (or a comment) explaining the code that follows.","The first match string (if any) that is a substring of the accept buffer is assigned to the special variable $MATCH. The buffer characters left of the first match are assigned to $LEFT, and the characters on the right are assigned to $RIGHT.","The match flag is set to 'yes' or 'no', depending on whether a match is made. Any statement that has a Y following the command letter is processed only if the match flag is set. Statements with N are processed only if the flag is not set.","Extensions to core PILOT include arrays and floating point numbers in Apple PILOT, and implementation of LOGO-inspired turtle graphics in Atari PILOT.","Versions of PILOT overlaid on the BASIC interpreters of early microcomputers were not unknown in the late 1970s and early 1980s, and Byte Magazine at one point published a non-Turing complete derivative of PILOT known as Waduzitdo by Larry Kheriarty as a way of demonstrating what a computer was capable of. A 1983 product called Vanilla PILOT for the Commodore 64 combined some features of LOGO, as did Super Turtle PILOT which was published as a type-in listing in the October 1987 issue of COMPUTE! magazine.","In 1991 the Institute of Electrical and Electronics Engineers (IEEE) published a standard for Pilot as IEEE Std 1154-1991. It has since been withdrawn.","In 1990 eSteem PILOT for Atari ST computers was developed and programmed by Tom Nielsen, EdD. Based on the IEEE Standards for PILOT and added GEM features, it included access and control of Laserdisc and CDROM devices.","An open source implementation was called RPilot, and another called Sky Pilot begun in 2005."]}