{"name":"Plankalkül","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Plankalk%C3%BCl","description":["Plankalkül (German pronunciation: [ˈplaːnkalkyːl], \"Plan Calculus\") is a computer language designed for engineering purposes by Konrad Zuse between 1943 and 1945. It was the first high-level non-von Neumann programming language to be designed for a computer. Also, notes survive with scribblings about such a plan calculation dating back to 1941. Plankalkül was not published at that time owing to a combination of factors such as conditions in wartime and postwar Germany and his efforts to commercialise the Z3 computer and its successors. By 1946, Zuse had written a book on the subject but this remained unpublished. In 1948 Zuse published a paper about the Plankalkül in the \"Archiv der Mathematik\" but still did not attract much feedback - for a long time to come programming a computer would only be thought of as programming with machine code. The Plankalkül was eventually more comprehensively published in 1972 and the first compiler for it was implemented in 1998. Another independent implementation followed in the year 2000 by the Free University of Berlin.","\"Kalkül\" means formal system – the Hilbert-style deduction system is for example originally called \"Hilbert-Kalkül\", so Plankalkül means \"formal system for planning\".","Plankalkül has drawn comparisons to APL and relational algebra. It includes assignment statements, subroutines, conditional statements, iteration, floating point arithmetic, arrays, hierarchical record structures, assertions, exception handling, and other advanced features such as goal-directed execution.","Plankalkül shared an idiosyncratic notation using multiple lines with Frege's Begriffsschrift of 1879 (dealing with mathematical logic).[clarification needed]","A single program was called by Zuse a Rechenplan (i.e. computation plan) and already in 1944 Zuse envisioned a device that should read and then automatically translate a mathematical formulation of a program into machine readable punched film stock – a device which he called Planfertigungsgerät (i.e. plan construction device).","In a lecture in 1957 Zuse mentioned his hope that the Plankalkül \"after some time as a Sleeping Beauty, will yet come to life.\"","Heinz Rutishauser, one of the founders of ALGOL:"]}