{"name":"PowerBuilder","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/PowerBuilder","description":["PowerBuilder is an integrated development environment owned by Sybase, a division of SAP. It has been in use since 1991, peaking around 1998 with around 100,000 users.","While Powerbuilder's market share has diminished, many applications created with it are still in use. In 2010, Sybase released a major upgrade to PowerBuilder, intended to compete directly with Microsoft Visual Studio.","Sybase sells another programming language called PocketBuilder. It is based on PowerBuilder and used for creating applications that run on mobile devices such as cell phones or PDAs.","PowerBuilder has a native data-handling object called a DataWindow, which can be used to create, edit, and display data from the database. This object gives the programmer a number of tools for specifying and controlling user interface appearance and behavior, and also provides simplified access to database content. To some extent, the DataWindow frees the programmer from considering the differences between Database Management Systems from different vendors.","PowerBuilder also includes a scripting language, PowerScript, which is used to specify the application behavior when events occur . Events usually correspond to user actions, such as clicking on an element of the user interface, or closing a window. PowerBuilder 10 and above use Unicode internally. This allows the use of characters from multiple languages concurrently. This affects the coding of API calls; however, the upgrade from PowerBuilder 9 to 10 automatically converts your existing API calls for you. Therefore, in PB10, you have a choice of making ANSI or Unicode API calls at the call level. PowerBuilder 10 supports reading and writing to flat files larger than 2 GB. PB8.0 supports the TRY CATCH FINALLY syntax of error handling. PB 10 has a built-in date-picker control.","On April 20, 2010, Sybase released PowerBuilder version 12.0, a major upgrade. It includes the ability to create applications that target several different platforms offered by the .NET Framework, including ASP.NET Web Forms, Windows Forms, or WPF. These features are offered through the new PB.NET IDE, which is built on the Visual Studio Isolated Shell. This latest release is intended to better align PowerBuilder with its competitors while continuing to offer its most distinguishing product: the DataWindow. In PowerBuilder 12, PowerScript is a fully CLS-compliant .NET language and comes with the ability to deploy fully managed code. The original PowerBuilder IDE (now termed \"PowerBuilder Classic\" by Sybase) continues to be made available for standard Win32 PowerBuilder development.","PowerBuilder is used primarily for building business applications. PowerBuilder is used by some companies in the financial and telecoms sectors. However in recent years, PowerBuilder has seen substantial competition arise from Java development tools and from Visual Studio.","There are a number of third-party tools that build upon and enhance the functionality of PowerBuilder, including Appeon for PowerBuilder, Visual Expert for PowerBuilder, and Enable Multilingual.","PowerBuilder was originally developed by PowerSoft in 1991. PowerSoft went public in 1993 and was acquired by Sybase for $904 million in Sybase stock in 1995. The product languished for a long time due to several reasons:","PowerBuilder 12, through compatibility with Web technologies such as ASP.NET, represents an attempt to regain market share. In order to move developers to newer versions, PowerBuilder 12 provides migration utilities that attempt to simplify migration.","Powerscript is an Object-Oriented programming language. Nearly all of the visual and non-visual objects support Inheritance, Polymorphism, and Encapsulation. The programmer may utilize a common code framework such as PowerBuilder Foundation Classes, also known as PFC, to inherit objects from and leverage pre-existing code.","The DataWindow is the key component (and selling point) of PowerBuilder. The DataWindow offers a visual SQL painter which supports outer joins, unions and subquery operations. It can convert SQL to Visual representation and back, so the developer can use native SQL if desired. DataWindow updates are automatic—it produces the proper SQL at runtime based on the DBMS to which the user is currently connected. This feature makes it easier for developers who are not experienced with SQL.","The DataWindow also has the built-in ability to both retrieve data and update data via Stored Procedures. The user picks the Stored Procedure from a visual list.","PowerBuilder offers native interfaces to all major databases, as well as ODBC and OLE-DB, in the Enterprise version. There are many connectivity options that allow performance monitoring and tuning, such as:","Due to the information about the database schema (such as primary key information) that are stored in PowerBuilder's data dictionary, the code required to implement data display and browsing is greatly simplified, because the dictionary information allows generation of the appropriate SQL behind the scenes. Here is a sample PowerBuilder update script:","PowerBuilder supports the following ways of interacting with a database:","DataWindow: this is the simplest approach, relying on automatically generated SQL.","PowerBuilder supports ActiveX and OCX controls, both visible and non-visible. It also can use OLE Automation as a client. However, PowerBuilder supports only late binding, not early binding. Therefore, when using OLE Automation, a dropdown of possible actions is not provided. PowerBuilder can also act as a DDE client or server, providing a further mechanism to interoperate with other applications.","PowerBuilder can make Windows and third-party API calls, and, in general, works well with third-party libraries in DLL files, however it does not directly support callback functions.","PowerBuilder offers a \"\/pbdebug\" runtime switch, which creates a log file. This can help track down a bug \"in the field\", as the user simply emails this log file to the developer. It has another feature which can log all SQL statements to a file. It also has built-in performance profiling, an integrated debugger, context-sensitive help, and an active newsgroup to provide support.","PowerBuilder applications are typically compiled to p-code, which is then interpreted by the PowerBuilder runtime. Although it can be compiled to machine code (called c-code), a typical business application does not run any faster. Only applications which do an unusually large amount of computations with little I\/O are likely to benefit from compiling to machine code.","Extensibility of the language was rather limited for older versions of PowerBuilder. The technologies provided to overcome this (ex. PowerBuilder Native Interface, or PBNI) are still[when?] rather tricky. To develop a solution that includes external C++ code may not only require a competent C++ developer, but also a PowerBuilder expert to guide the developer through the myriad of subtleties of the language and the PowerBuilder Virtual Machine.","For PowerBuilder 12, released in late 2010, Sybase states that this extensibility is less of an issue, because PowerBuilder .NET's APIs allow the use of \"off the street XAML\" including control templates and skins as well as its ability to use custom WPF controls with less effort than its historic use of External Function calls and PBNI to access external resources.","Sybase has released regular updates to PowerBuilder at intervals of every 1.5 years or so. Moreover, in each of these releases, Sybase regularly incorporates modern development paradigms into the IDE, and provides the ability to develop for .NET. PowerBuilder 12.5 introduces even more .NET and WPF support.","The (classic) Powerscript language itself, which is still available for compatibility reasons, is known as \"a language built around the DataWindow\" amongst developers with PowerBuilder being the \"IDE built around the DataWindow\". Since PowerBuilder 12.0, the (now .NET-compliant) PowerScript language is fully compliant with the common language specification (CLS), and can be compared with C#, Java or VB.NET. The language now supports Arrays, Delegates, Parameterized Constructors, User-defined Enumerations and Generics.. PowerBuilder 12.5 introduces support for Multithreading, the ability to consume RESTful (Representational State Transfer) Web Services and Batch Command Processing. For the \"classic\" PowerScript, various smaller enhancements were added,too..","PowerBuilder is known for its loyal customer base and ease of development. Consequently, there is a variety of grass roots community groups and resources for PowerBuilder developers to share and convene. These include the International Sybase User Group and what some call the very first technical journal devoted to an IDE, PowerBuilder Developer's Journal. There are also blogs from TeamSybase and evangelists available. PowerBuilderTV is series of webinars by and for the PowerBuilder community with webinars by PowerBuilder evangelists, developers and vendors.",""]}