{"name":"Processing","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Processing_(programming_language)","description":["Processing is an open source programming language and integrated development environment (IDE) built for the electronic arts and visual design communities with the purpose of teaching the basics of computer programming in a visual context, and to serve as the foundation for electronic sketchbooks. The project was initiated in 2001 by Casey Reas and Benjamin Fry, both formerly of the Aesthetics and Computation Group at the MIT Media Lab. One of the stated aims of Processing is to act as a tool to get non-programmers started with programming, through the instant gratification of visual feedback. The language builds on the Java language, but uses a simplified syntax and graphics programming model.","Processing includes a sketchbook, a minimal alternative to an integrated development environment (IDE) for organizing projects.","Every Processing sketch is actually a subclass of the PApplet Java class which implements most of the Processing language's features.","When programming in Processing, all additional classes defined will be treated as inner classes when the code is translated into pure Java before compiling. This means that the use of static variables and methods in classes is prohibited unless you explicitly tell Processing that you want to code in pure Java mode.","Processing also allows for users to create their own classes within the PApplet sketch. This allows for complex data types that can include any number of arguments and avoids the limitations of solely using standard data types such as: int (integer), char (character), float (real number), and color (RGB, ARGB, hex).","Accessing information from the web can be done through Processing with the use an additional library created by Daniel Shiffman called simpleML, the library is imported at the beginning of the sketch to allow access to its resources, a simple example may look as follows:","\nThis example will print the line, \"America: #\" the # indicating the number of times the word appears on the main page of cnn.com. After each fifteen second interval Processing will retrieve the information from the source page and update the println if the results have changed.","While the Java-like command","is a valid Hello World program in Processing, the following code is a better example of the look and feel of the language.","The next example shows a map of the results of the 2008 USA presidential election. Blue denotes states won by Barack Obama, and red denotes those won by John McCain. (Note: this map does not show the Nebraska district in which Obama won an elector.)","Processing was based on the original work done on Design By Numbers project in MIT. It shares many of the same ideas and is a direct child of that experiment.","Processing has spawned another project, Wiring, which uses the Processing IDE with a simplified version of the C++ language as a way to teach artists how to program microcontrollers. There are now two separate hardware projects, Wiring and Arduino, using the Wiring environment and language. Fritzing is another software environment of the same sort, which helps designers and artists to document their interactive prototypes and to take the step from physical prototyping to actual product.","Another spin-off project, Mobile Processing by Francis Li, allows software written using the Processing language and environment to run on Java powered mobile devices.","In 2008, John Resig ported Processing to JavaScript using the Canvas element for rendering, allowing Processing to be used in modern web browsers without the need for a Java plugin. Since then, the open source community including students at Seneca College have taken over the project.","iProcessing was built to help people develop native iPhone applications using the Processing language. It is an integration of the Processing.js library and a Javascript application framework for iPhone.","Spde (standing for Scala Processing Development Environment) replaces Processing's reduced Java syntax and custom preprocessor with the off-the-shelf Scala programming language which also runs on the Java platform and enforces some of the same restrictions such as disallowing static methods, while also allowing more concise code, and supporting functional programming.","Quil (formerly named clj-processing) is a wrapper for Processing in the Clojure language, a Lisp that runs on the Java platform.","Processing Monsters is a project by Lukas Vojir intended to help people learn the language in an entertaining fashion. The monsters are simple graphical programs that are only black and white and are mouse reactive. As of May 3, 2010, 70 monsters are featured on Vojir's site.","In 2005 Reas and Fry won the prestigious Golden Nica award from Ars Electronica in its Net Vision category for their work on Processing.","Ben Fry won the 2011 National Design Award given by the Smithsonian Cooper-Hewitt National Design Museum in the category of Interaction Design. The award statement says:","\"Drawing on a background in graphic design and computer science, Ben Fry pursues a long-held fascination with visualizing data. As Principal of Fathom Information Design in Boston, Fry develops software, printed works, installations, and books that depict and explain topics from the human genome to baseball salaries to the evolution of text documents. With Casey Reas, he founded the Processing Project, an open-source programming environment for teaching computational design and sketching interactive-media software. It provides artists and designers with accessible means of working with code while encouraging engineers and computer scientists to think about design concepts.\"","Processing's core libraries, the code included in exported applications and applets, is licensed under the GNU Lesser General Public License, allowing users to release their original code with a choice of license.","The IDE is licensed under the GNU General Public License.","Originally, Processing had the URL at proce55ing.org, because the processing domain was taken. Eventually, however, Reas and Fry acquired the domain. Although the name had a combination of letters and numbers, it was still pronounced processing. They do not prefer the environment being referred to as Proce55ing. But, despite the name change, Processing still uses the term p5 sometimes as a shortened name. However, they specifically use p5 and not p55."]}