{"name":"Q (programming language from Kx Systems)","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Q_(programming_language_from_Kx_Systems)","description":["Q is a proprietary array processing language developed by Arthur Whitney and commercialized by Kx Systems. The language serves as the query language for kdb+, a disk based and in-memory, column-based database. kdb+ is based upon K, a terse variant of APL. Q is a thin wrapper around K, providing a more readable, English-like interface.","The fundamental building blocks of Q are atoms, lists and functions. Atoms are scalars and include numeric, character and temporal data types. Lists are ordered collections of atoms (or other lists) upon which the higher level data structures dictionaries and tables are internally constructed. A dictionary is a map of a list of keys to a list of values. A table is a transposed dictionary of symbol keys and equal length lists (columns) as values. A keyed table, analogous to a table with a primary key placed on it, is a dictionary where the keys and values are arranged as two tables.","The following code demonstrates the relationships of the data structures (expressions to be evaluated appear prefixed with the \"q)\" prompt, with the output of the evaluation shown beneath):","These entities are manipulated via functions, which include the built-in functions that come with Q (which are actually defined as K macros) and user-defined functions. Functions are themselves a data type, and can be placed into lists, dictionaries and tables, or passed into other functions as parameters.","Like K, Q is interpreted and the result of the evaluation of an expression is immediately displayed, unless terminated with a semi-colon. The Hello world program is therefore trivial:","The following expression sorts a list of strings stored in the variable x descending by their lengths:","The expression is evaluated from right to left as follows:","The factorial function can be implemented directly in Q as","or recursively as","Note that in both cases the function implicitly takes a single argument called x - in general it is possible to use up to three implicit arguments, named x, y and z, or to give arguments local variable bindings explicitly.","In the direct implementation, the expression \"til x\" enumerates the integers from 0 to x-1, \"1+\" adds 1 to every element of the list and \"prd\" returns the product of the list.","In the recursive implementation, the syntax \"$[condition; expr1; expr2]\" is a ternary conditional - if the condition is true then expr1 is returned; otherwise expr2 is returned. The expression \".z.s\" is loosely equivalent to 'this' in Java or 'self' in Python - it is a reference to the containing object, and enables functions in q to call themselves.","A function to determine if a number is prime can be written as:","The function is evaluated from right to left:","The Q programming language contains its own table query syntax called q-sql, which resembles traditional SQL but has important differences, mainly due to the fact that the underlying tables are column, rather than row, oriented."]}