{"name":"QBasic","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/QBasic","description":["QBasic is an IDE and interpreter for a variant of the BASIC programming language which is based on QuickBASIC. Code entered into the IDE is compiled to an intermediate form, and this intermediate form is immediately interpreted on demand within the IDE. It can run under nearly all versions of DOS and Windows, or through DOSBox\/DOSEMU, on Linux and FreeBSD. For its time, QBasic provided a state-of-the-art IDE, including a debugger with features such as on-the-fly expression evaluation and code modification.","Like QuickBASIC, but unlike earlier versions of Microsoft BASIC, QBasic is a structured programming language, supporting constructs such as subroutines and while loops.Line numbers, a concept often associated with BASIC, are supported for compatibility, but are not considered good form,[according to whom?] having been replaced by descriptive line labels. QBasic has limited support for user-defined data types (structures), and several primitive types used to contain strings of text or numeric data.","QBasic was intended as a replacement for GW-BASIC. It was based on the earlier QuickBASIC 4.5 compiler but without QuickBASIC's compiler and linker elements. Version 1.0 was shipped together with MS-DOS 5.0 and higher, as well as Windows 95, Windows NT 3.x, and Windows NT 4.0. IBM recompiled QBasic and included it in PC-DOS 5.x, as well as OS\/2 2.0 onwards.eComStation, descended from OS\/2 code, includes QBasic 1.0. QBasic 1.1 is included with MS-DOS 6.x, and, without EDIT, in Windows 95, Windows 98 and Windows Me. Starting with Windows 2000, Microsoft no longer includes QBasic with their operating systems. (However, some localized versions of Windows 2000 and Windows XP still have it, and it can be given out as freeware.)[citation needed]...","QBasic (as well as the built-in MS-DOS Editor) is backward compatible with DOS releases prior to 5.0 (down to at least DOS 3.20). However, if used on any 8088\/8086 computers, or on some 80286 computers, the QBasic program may run very slowly, or perhaps not at all, due to its memory size. Until MS-DOS 7, MS-DOS Editor required QBasic: the \"edit.com\" program simply started QBasic in editor mode only, and this mode can also be entered by running QBASIC.EXE with the \/EDITOR switch (i.e., command line \"QBASIC \/EDITOR\".","QBasic came complete with four pre-written example programs. These were \"Nibbles\", a variant of the Snake game; \"Gorillas\", an Artillery game; \"MONEY MANAGER\", a personal finance manager; and \"RemLine\", a GW-BASIC code line-number-removing program.","This program challenges the user to guess a randomly selected number within the 1-10 range, without offering the usual hints of \"higher\"\/\"lower\":","QBasic has a little-known Easter egg. To see it, press and hold Left CTRL+Left SHIFT+Left ALT and Right CTRL+Right SHIFT+Right ALT simultaneously after running QBasic at the DOS prompt but before the title screen loads: this lists The Team of programmers. Note that on modern computers, it is much too fast to perform. It is best done on an old PC (preferably one with a working Turbo button, with the switch on to slow the CPU to 4.77 MHz) or in an emulator like Bochs or DOSBox which can be slowed down."]}