{"name":"BREW","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Qualcomm_Brew","description":["Binary Runtime Environment for Wireless (Brew MP, Brew, or BREW) is an application development platform created by Qualcomm, originally for code division multiple access (CDMA) mobile phones, featuring third-party applications such as mobile games. It is offered in some feature phones but not in smartphones. It debuted in September 2001.","As a software platform that can download and run small programs for playing games, sending messages, and sharing photos, the main advantage of Brew MP is that the application developers can easily port their applications among all Brew MP devices by providing a standardized set of application programming interfaces. Software for Brew MP enabled handsets can be developed in C or C++ using the freely downloadable Brew MP software development kit (SDK). The Brew runtime library is part of the wireless device on-chip firmware or operating system to allow programmers to develop applications without needing to code for system interface or understand wireless applications. Brew is described as a pseudo operating system, but not a true mobile operating system. Brew is not a virtual machine such as Java ME, but runs native code.","For software developers, Brew MP is a full set of application programming interfaces (API) that enables making software and applications in C, C++, Java, and is supported (platform) by an application-specific integrated circuit (ASIC). It has a memory footprint of about 15,900 K. Brew MP is also called the pseudo OS and it runs on Brew RTOS.","For testing applications during the development process, the SDK includes a Brew emulator, or starting with Brew version 3.1.5 and above, the Brew Simulator. The Brew environment provides for multiple levels of application signatures. One signature authenticates the developer. Another signature verifies that an application has passed True Brew testing and is bestowed through Intertek. The individual telecommunications operators configure the handsets to either enforce or ignore the presence and verification of this second signature. Brew enabled handsets have a test mode that allows applications to bypass verification of the signature. Qualcomm makes applications that have passed testing available to Brew enabled wireless network operators. The operators are then able to choose which of these applications to make available to end-users on their catalog.","The Brew emulator, named Brew Simulator, does not emulate handset hardware. Instead, the Brew application is compiled to native code and linked with a compatible Brew runtime library. Because of this, applications cannot be tested for platform bugs related to memory alignment and various firmware related glitches without a Brew handset operating in test mode.","For testing purposes, Brew applications can be transferred using a Universal Serial Bus (USB) or serial cable to any Brew-compatible handset using Brew AppLoader from Qualcomm. A Brew application contains several components which, if not present and valid, cause the application to be automatically deleted on reboot. This includes the compiled binary file, a file which describes the application, the features it uses and permissions requested, a file that contains string and image resources if required, and a file containing the application's digital signature.","Brew applications may be unloaded from a consumer handset to save handset memory space. This is referred to as \"Disable\/Restore\", and is a requirement of the True Brew Test Process. Saved files are kept intact using Disable\/Restore, and it is possible to re-load the application without paying for it again. In a \"Disable\" situation, all .bar, .mod, and .sig files are deleted from the handset, while any other files remain in their original place. During the \"Restore\" operation, the .bar, .mod, and.sig files are downloaded from the carrier's mobile store, and the previously disabled application will have full functionality remaining. The Disable\/Restore process is only available to consumer users once the handset's memory is full.","On May 28, 2008, Qualcomm and Adobe announced a partnership to integrate Adobe Flash Lite as a supported user interface on Brew.","Since March 2006, the least expensive digital signature package for developers costs US$400 for 100 application submissions.","Time to market can take longer with Brew than with Java ME because of Brew's rigorous certification requirements. This certification process may be perceived as an advantage by established software developers because the difficulties associated with testing and development costs create a high cost of entry to developers with low budgets and little time, resulting in less market dilution. Specifically, developers of casual games run less risk of having to compete with freeware workalikes developed and self-published by hobbyists. However this comes as a cost to the end-user as there's less competition to develop the best solution for the cheapest price to the end user.","Currently, most developers choose to support both Java ME and Brew, or only Java ME. Java ME may offer a lower cost to market because most carriers allow non-certified Java ME applications to run on their phones. Java ME is widely used in Europe, while Brew is primarily used in the U.S. and Japan. Even in the U.S., Java ME phones have a larger market share than Brew enabled handsets. One of the initial advantages of Brew was that Verizon made it easy to purchase applications from the phone, while most Java ME carriers did not. However, most carriers of Java ME phones now offer easy-to-access purchasing portals.","There are now commercial technologies to fully automate porting from Java ME to Brew. This reduces the entry barrier to produce Brew applications by eliminating the need to develop two versions of the same application in both Java and C\/C++.","Brew OS is used by some mobile phone manufacturers and mobile networks, however most often the end-user does not know this since mobile phones running Brew most often lack any Brew OS branding and Brew runs in the background with the custom \"skins\" of the mobile phone manufacturer or operator on-top. Brew OS is used by Sprint Nextel, metroPCS, Cricket Wireless, U.S. Cellular, Verizon, Syringa Wireless, and AT&T (in the HTC Freestyle) in the US and by the Three network in much of Europe, the UK and Australia on many mobile phones produced especially for their network.","Manufacturers such as Huawei, INQ Mobile, Amoi, Samsung Mobile and HTC amongst others use Brew OS in some of their mobile phones and it is featured in Three UK phones such as the 3 Skypephone, INQ1 and Huawei u7510 (3 Touch)."]}