{"name":"R","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/R_(programming_language)","description":["R is an open source programming language and software environment for statistical computing and graphics. The R language is widely used among statisticians for developing statistical software and data analysis.","R is an implementation of the S programming language combined with lexical scoping semantics inspired by Scheme. S was created by John Chambers while at Bell Labs. R was created by Ross Ihaka and Robert Gentleman at the University of Auckland, New Zealand, and now, R is developed by the R Development Core Team, of which Chambers is a member. R is named partly after the first names of the first two R authors (Robert Gentleman and Ross Ihaka), and partly as a play on the name of S.","R is part of the GNU project. The source code for the R software environment is written primarily in C, Fortran, and R. R is freely available under the GNU General Public License, and pre-compiled binary versions are provided for various operating systems. R uses a command line interface; however, several graphical user interfaces are available for use with R.","R provides a wide variety of statistical and graphical techniques, including linear and nonlinear modeling, classical statistical tests, time-series analysis, classification, clustering, and others. R is easily extensible through functions and extensions, and the R community is noted for its active contributions in terms of packages. There are some important differences, but much code written for S runs unaltered. Many of R's standard functions are written in R itself, which makes it easy for users to follow the algorithmic choices made. For computationally intensive tasks, C, C++, and Fortran code can be linked and called at run time. Advanced users can write C or Java code to manipulate R objects directly.","R is highly extensible through the use of user-submitted packages for specific functions or specific areas of study. Due to its S heritage, R has stronger object-oriented programming facilities than most statistical computing languages. Extending R is also eased by its permissive lexical scoping rules.","According to Rexer's Annual Data Miner Survey in 2010, R has become the data mining tool used by more data miners (43%) than any other.","Another strength of R is static graphics, which can produce publication-quality graphs, including mathematical symbols. Dynamic and interactive graphics are available through additional packages.","R has its own LaTeX-like documentation format, which is used to supply comprehensive documentation, both on-line in a number of formats and in hard copy.","R is an interpreted language typically used through a command line interpreter. If one types \"2+2\" at the command prompt and presses enter, the computer replies with \"4\".","Like many other languages, R supports matrix arithmetic. R's data structures include scalars, vectors, matrices, data frames (similar to tables in a relational database) and lists. The R object system is extensible and includes objects for, among others, regression models, time-series and geo-spatial coordinates.","R supports procedural programming with functions and, for some functions, object-oriented programming with generic functions. A generic function acts differently depending on the type of arguments it is passed. In other words the generic function dispatches the function (method) specific to that type of object. For example, R has a generic print() function that can print almost every type of object in R with a simple \"print(objectname)\" syntax.","Although R is mostly used by statisticians and other practitioners requiring an environment for statistical computation and software development, it can also be used as a general matrix calculation toolbox with performance benchmarks comparable to GNU Octave or MATLAB.","The following examples illustrate the basic syntax of the language and use of the command-line interface.","In R, the widely preferredassignment operator is an arrow made from two characters \"","","Short R code calculating Mandelbrot set through the first 20 iterations of equation z = z² + c plotted for different complex constants c. This example demonstrates:","","The capabilities of R are extended through user-created packages, which allow specialized statistical techniques, graphical devices, import\/export capabilities, reporting tools, etc. These packages are developed primarily in R, and sometimes in Java, C and Fortran. A core set of packages are included with the installation of R, with 5300 additional packages (as of April 2012[update]) available at the Comprehensive R Archive Network (CRAN), Bioconductor, and other repositories.","The \"Task Views\" page (subject list) on the CRAN website lists the wide range of applications (Finance, Genetics, Machine Learning, Medical Imaging, Social Sciences and Spatial statistics) to which R has been applied and for which packages are available.","Other R package resources include Crantastic, a community site for rating and reviewing all CRAN packages, and also R-Forge, a central platform for the collaborative development of R packages, R-related software, and projects. It hosts many unpublished, beta packages, and development versions of CRAN packages.","The Bioconductor project provides R packages for the analysis of genomic data, such as Affymetrix and cDNA microarray object-oriented data handling and analysis tools, and has started to provide tools for analysis of data from next-generation high-throughput sequencing methods.","Reproducible research and automated report generation can be accomplished with packages that support execution of R code embedded within LaTeX, OpenDocument format and other markups.","The full list of changes is maintained in the NEWS file. Some highlights are listed below.","Text editors and Integrated development environments (IDEs) with some support for R include: Bluefish, Crimson Editor, ConTEXT, Eclipse (StatET), Emacs (Emacs Speaks Statistics) Vim, Geany, jEdit, Kate, R Productivity Environment (part of Revolution R Enterprise), RStudio, TextMate, gedit, SciTE, WinEdt (R Package RWinEdt) and Notepad++.","R functionality has been made accessible from several scripting languages such as Python (by the RPy interface package), Perl (by the Statistics::R module), and Ruby (with the rsrubyrubygem). PL\/R can be used alongside, or instead of, the PL\/pgSQL scripting language in the PostgreSQL database management system. Scripting in R itself is possible via littler as well as via Rscript.","\"useR!\" is the name given to the official annual gathering of R users. The first such event was useR! 2004 in May 2004, Vienna, Austria, which lasted three days. Since then, there have been 7 useR meetings around the world.","The program of all conferences so far consists of two parts:","A major goal of the useR! conference is to bring users from various fields together and provide a platform for discussion and exchange of ideas: both in the formal framework of presentations as well as in the informal times surrounding the conference sessions.","Here is the list of useR! conference:","The general consensus is that R compares well with other popular statistical packages, such as SAS, SPSS and Stata. In January 2009, the New York Times ran an article about R gaining acceptance among data analysts and presenting a potential threat for the market share occupied by commercial statistical packages, such as SAS.","In 2007, Revolution Analytics was founded to provide commercial support for Revolution R, its distribution of R which also includes components developed by the company. Major additional components include: ParallelR, the R Productivity Environment IDE, RevoScaleR (for big data analysis), RevoDeployR, web services framework, and the ability for reading and writing data in the SAS file format.","In October 2011, Oracle announced the Big Data Appliance, which integrates R, Apache Hadoop, Oracle Enterprise Linux, and a NoSQL database with the Exadata hardware.","Other major commercial software systems supporting connections to R include: JMP,MATLAB,Spotfire,SPSS,STATISTICA,Platform Symphony, and SAS."]}