{"name":"Revolution","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Revolution_(programming_language)","description":["The LiveCode programming language (formerly the \"Revolution\" programming language) is a commercial cross-platformrapid application development language inspired by Hypercard's programming language HyperTalk.","The language was first introduced in 2001. The \"Revolution\" development system was based on the MetaCard engine technology which Runtime Revolution later acquired from MetaCard Corporation in 2003. The platform won the Macworld Annual Editor's Choice Award for \"Best Development Software\" in 2004. \"Revolution\" was renamed \"LiveCode\" in the fall of 2010. \"LiveCode\" is developed and sold by Runtime Revolution Ltd., based in Edinburgh, Scotland.","LiveCode runs on iOS, Android, Mac OS X, Windows 95 through Windows 7, and several variations of Unix, including Linux, Solaris, and BSD. It can be used for both desktop and server\/CGI applications. The first version for iOS (iPhone and iPad) was released in December 2010. The first version to deploy to the Web was released in 2009.","LiveCode allows developers to create applications that run in any of the supported environments, using a compile-free workflow. Developers can reuse the same code across multiple devices and platforms from a single code base. LiveCode uses a high level, English-like programming language that is dynamically typed. The high-level programming language and compile-free workflow allow for code that is self-documenting and easy for casual programmers to comprehend. For example, if the following script was executed when the system clock was at 9:00 AM:","Ten lines of \"Hello world at 9:00 AM\" will be loaded into the first text field. (numbered as such and denoted as \"field 1\")","\"repeat\" (and the associated \"end repeat\") is a control structure, illustrated here in just one of its various forms.","\"put\" is a command","\"Hello World at\" is a literal","\"the time\" is a function that calls the system time","\"after\" is a keyword that is involved with an extremely powerful and intuitive system known as \"chunking\", a hallmark of xTalk languages.","\"field 1\" is an object reference, here denoted by the layer number of a text field. Almost all standard object classes are supported, and may be referred to in several ways, all of which are highly intuitive.","While its natural-language syntax is designed to make it easy to learn for beginners, the language contains advanced features including associative arrays,regular expressions, QuickTime multimedia, support for a variety of SQL databases, and TCP\/IP libraries. The LiveCode engine supports several common image formats (including BMP, PNG, GIF, and JPEG,) anti-aliased vector graphics, HTML-style text hyperlinks, and embedded web browsers. Accessing these higher-level functions is designed to be straightforward.","For example, to load the source code of a web page into a variable takes one line of code:","put url \"http:\/\/www.yahoo.com\" into MyVariable","Uploading a file to an FTP server uses similar syntax:","put url \"binfile:picture.jpg\" into url \"ftp:\/\/john:passwd@ftp.example.net:2121\/picture.jpg\"","There are around 1900 built-in language terms and keywords, which may be extended by external libraries written in C and other lower level languages.","LiveCode project files are binary-compatible across platforms. They inherit each platform's unique look and feel and behaviors with no modification. For example, buttons, scrollbars, progress bars and menus behave as expected on the target platform without any intervention on the part of the developer.","Compiling a standalone produces a single-file executable (minimum size ~1.5MB) for each platform targeted. There is no separate runtime necessary.","The Wikipedia article on Hypercard, being at root quite similar, contains a more detailed discussion about the basics of its very similar development environment and scripting language. But LiveCode is a vast superset of that program, and brings the x-talk paradigm into modernity, while losing none of its simplicity and beauty. LiveCode includes a number of features missing from the original HyperCard program, including multiple platform deployment, communication with external devices and many fundamental language extensions such as object-oriented behaviors. A major addition to the LiveCode toolkit, as compared to HyperCard, is the ability to access internet-based text and media resources, which allows the developer to create internet-enabled desktop applications."]}