{"name":"S-PLUS","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/S-PLUS","description":["S-PLUS is a commercial implementation of the S programming language sold by TIBCO Software Inc..","It features object-oriented programming capabilities and advanced analytical algorithms.","1988: S-PLUS is first produced by a Seattle-based start-up company called Statistical Sciences, Inc. The founder and sole owner is R. Douglas Martin, professor of statistics at the University of Washington, Seattle.","1993: Statistical Sciences acquires the exclusive license to distribute S and merges with MathSoft, becoming the firm's Data Analysis Products Division (DAPD).","1995: S-PLUS 3.3 for Windows 95\/NT. Matrix library, command history, Trellis graphics","1996: S-PLUS 3.4 for UNIX. Trellis graphics, nlme library, hexagonal binning, cluster methods.","1997: S-PLUS 4 for Windows. New GUI, integration with Excel, editable graphics.","1998: S-PLUS 4.5 for Windows. Scatterplot brushing, create S-PLUS graphs from within Excel & SPSS.","1998: S-PLUS is available for Linux & Solaris.","1999: S-PLUS 5 for Solaris, Linux, HP-UX, IBM AIX, SGI Irix, and DEC Alpha. S-PLUS 2000 for Windows. nlme 3.3, quality control charting, new commands for data manipulation.","2000: S-PLUS 6 for Linux\/UNIX. Java-based GUI, Graphlets, survival5, missing data library, robust library.","2001: MathSoft sells its Cambridge-based Engineering and Education Products Division (EEPD), changes name to Insightful Corporation, and moves headquarters to Seattle. This move is basically an \"Undo\" of the previous merger between MathSoft and Statistical Sciences, Inc.","2001: S-PLUS Analytic Server 2.0. S-PLUS 6 for Windows (Excel integration, C++ classes\/libraries for connectivity, Graphlets, S version 4, missing data library, robust library).","2002: StatServer 6. Student edition of S-PLUS now free.","2003: S-PLUS 6.2 New reporting, database integration, improved Graphlets, ported to AIX, libraries for correlated data, Bayesian methods, multivariate regressions.","2004: Insightful purchases the S language from Lucent Technologies for $2 million.","2004: S+ArrayAnalyzer 2.0 released.","2005: S-PLUS 7.0 released. BigData library for working with larger-than-memory data sets, S-PLUS Workbench (Eclipse development tool). Insightful Miner 7.0 released.","2007: S-PLUS 8 released. New package system, language extensions for R package compatibility, Workbench debugger.","2008: TIBCO acquires Insightful Corporation"]}