{"name":"SAS","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/SAS_System","description":["SAS (pronounced \"sass\", originally Statistical Analysis System) is an integrated system of software products provided by SAS Institute Inc., which enables programmers to perform:","In addition, SAS has many business solutions that enable large-scale software solutions for areas such as IT management, human resource management, financial management, business intelligence, customer relationship management and more.","SAS is driven by SAS programs, which define a sequence of operations to be performed on data stored as tables. Although non-programmer graphical user interfaces to SAS exist (such as the SAS Enterprise Guide), these GUIs are most often merely a front-end that automates or facilitates the generation of SAS programs. The functionalities of SAS components are intended to be accessed via application programming interfaces, in the form of statements and procedures.","A SAS program has three major parts:","SAS Library Engines and Remote Library Services allow access to data stored in external data structures and on remote computer platforms.","The DATA-step section of a SAS program, like other database-oriented fourth-generation programming languages such as SQL or Focus, assumes a default file structure, and automates the process of identifying files to the operating system, opening the input file, reading the next record, opening the output file, writing the next record, and closing the files. This allows the user\/programmer to concentrate on the details of working with the data within each record, in effect working almost entirely within an implicit program loop that runs for each record.","All other tasks are accomplished by procedures that operate on the data set (SAS' terminology for \"table\") as a whole. Typical tasks include printing or performing statistical analysis, and may just require the user\/programmer to identify the data set. Procedures are not restricted to only one behavior and thus allow extensive customization, controlled by mini-languages defined within the procedures. SAS also has an extensive SQL procedure, allowing SQL programmers to use the system with little additional knowledge.","There are macro programming extensions, that allow for rationalization of repetitive sections of the program. Proper imperative and procedural programming constructs can be simulated by use of the \"open code\" macros or the Interactive Matrix Language SAS\/IML component.","Macro code in a SAS program, if any, undergoes preprocessing. At run time, DATA steps are compiled and procedures are interpreted and run in the sequence they appear in the SAS program. A SAS program requires the SAS software to run.","Compared to general-purpose programming languages, this structure allows the user\/programmer to concentrate less on the technical details of the data and how it is stored, and more on the information contained in the data. This blurs the line between user and programmer, appealing to individuals who fall more into the 'business' or 'research' area and less in the 'information technology' area, since SAS does not enforce (although it recommends) a structured, centralized approach to data and infrastructure management.","SAS runs on IBM mainframes, Unix, Linux, OpenVMS Alpha, and Microsoft Windows. Code is \"almost\" transparently moved between these environments. Older versions have supported PC-DOS, the Apple Macintosh, VMS, VM\/CMS, PrimeOS, Data General AOS and OS\/2.","SAS was conceived by Anthony J. Barr in 1966. As a North Carolina State University graduate student from 1962 to 1964, Barr had created an analysis of variance modeling language inspired by the notation of statistician Maurice Kendall, followed by a multiple regression program that generated machine code for performing algebraic transformations of the raw data. Drawing on those programs and his experience with structured data files, he created SAS, placing statistical procedures into a formatted file framework. From 1966 to 1968, Barr developed the fundamental structure and language of SAS.","In January 1968, Barr and Jim Goodnight collaborated, integrating new multiple regression and analysis of variance routines developed by Goodnight into Barr's framework. Goodnight's routines made the handling of basic statistical analysis more robust, and his later implementation (in SAS 76) of the general linear model increased the analytical power of the system.[citation needed] By 1971, SAS was gaining popularity within the academic community. One strength of the system was analyzing experiments with missing data, which was useful to the pharmaceutical and agricultural industries, among others.","In 1973, John Sall joined the project, making extensive programming contributions in econometrics, time series, and matrix algebra. Other participants in the early years included Caroll G. Perkins, Jolayne W. Service, and Jane T. Helwig. Perkins made programming contributions. Service and Helwig created the early documentation.","In 1976, SAS Institute, Inc. was incorporated by Barr, Goodnight, Sall, and Helwig.","SAS sued World Programming, the developers of a competing implementation, World Programming System, alleging that they had infringed SAS's copyright in part by implementing the same functionality. This case was referred from the United Kingdom's High Court of Justice to the European Court of Justice on 11 August, 2010. In May 2012, the European Court of Justice ruled in favor of World Programming, finding that \"the functionality of a computer program and the programming language cannot be protected by copyright.\"","SAS consists of a number of components which organizations separately license and install as required.","Where many other languages refer to tables, rows, and columns\/fields, SAS uses the terms data sets, observations, and variables (although in some of the GUI applications, it is not consistent with these terms, sometimes referring to columns and rows). There are only two kinds of variables in SAS: numeric and character (string). By default all numeric variables are stored as (8 byte) real. It is possible to reduce precision in external storage only. Date and datetime variables are numeric variables that inherit the C tradition and are stored as either the number of days (for date variables) or seconds (for datetime variables).","The Base SAS component had been criticized for its poor graphics when compared with other statistical software packages. With the release of the Output Delivery System (ODS) for Statistical Graphics extension in SAS 7, and with the use of the SAS Graph component the graphics have improved significantly. The development tools provided — which include the Enhanced text editor, log, DATA step debugger, SCL debugger — are also outdated compared to what other development environments provide. Debugging tools are especially lacking. Finding bugs in modern SAS programs that use many macros can be complex; SAS will often not note the correct line number of execution when reporting an error, as diagnostic messages will refer to the expanded macro code."]}