{"name":"Scala","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Scala_(programming_language)","description":["Scala ( \/ˈskɑːlə\/ SKAH-lə) is a multi-paradigm programming language designed as a \"better Java\" — building on top of the Java virtual machine (JVM) and maintaining strong interoperability with Java, while at the same time integrating functional programming along with Java's object-oriented programming model, cleaning up what are often considered to have been poor design decisions in Java (e.g. type erasure, checked exceptions and the non-unified type system) and adding a number of other features designed to allow cleaner, more concise and more expressive code to be written.","Like Java, Scala is statically typed and strongly object oriented, uses a curly-brace syntax reminiscent of C, and compiles code into Java bytecode, allowing Scala code to be run on the JVM and permitting Java libraries to be freely called from Scala (and vice-versa) without the need for a glue layer in-between.","However, compared with Java, Scala adds many features of functional programming languages like Scheme, Standard ML and Haskell, including anonymous functions, type inference, list comprehensions (known in Scala as \"for-comprehensions\"), lazy initialization, extensive language and library support for side-effect-less code, pattern matching, case classes, delimited continuations, higher-order types, much better support for covariance and contravariance than in Java, etc. Scala also provides a unified type system (as in C#, but unlike in Java), where all types, including primitive types like integers and booleans, are objects that are subclasses of the type Any. Scala likewise contains a number of other features (or non-features) present in C# but not Java, including operator overloading, optional parameters, named parameters, raw strings (which may be multi-line in Scala), and no checked exceptions. In addition, Scala contains a number of advanced features in its type system that are found in few, if any, other production-level languages (see below).","The name Scala is a blend of \"scalable\" and \"language\", signifying that it is designed to grow with the demands of its users. James Strachan, the creator of Groovy, described Scala as a possible successor to Java.","The design of Scala started in 2001 at the École Polytechnique Fédérale de Lausanne (EPFL) by Martin Odersky, following on from work on Funnel, a programming language combining ideas from functional programming and Petri nets. Odersky had previously worked on Generic Java and javac, Sun's Java compiler.","Scala was released late 2003 \/ early 2004 on the Java platform, and on the .NET platform in June 2004. A second version of the language, v2.0, was released in March 2006.","On 17 January 2011 the Scala team won a 5 year research grant of over €2.3 million from the European Research Council. On 12 May 2011, Odersky and collaborators launched Typesafe, a company to provide commercial support, training, and services for Scala. Typesafe received $3 million investment from Greylock Partners.","Scala runs on the Java platform (Java Virtual Machine) and is compatible with existing Java programs. It also runs on Android smartphones. An alternative implementation exists for the .NET platform.","Scala has the same compilation model as Java and C# (separate compilation, dynamic class loading), so Scala code can call Java libraries (or .NET libraries in the .NET implementation).","Scala's operational characteristics are the same as Java's. The Scala compiler generates byte code that is nearly identical to that generated by the Java compiler. In fact, Scala code can be decompiled to readable Java code, with the exception of certain constructor operations. To the JVM, Scala code and Java code are indistinguishable. The only difference is a single extra runtime library, scala-library.jar.","The Scala software distribution, including compiler and libraries, is released under a BSD license.","Scala supports functional programming. The language provides a lightweight syntax for defining anonymous functions, supports higher-order functions, allows functions to be nested, and supports currying. Using the keyword lazy defers the initialization of a value until this value is used. Delimited continuations have been supported since version 2.8.","Functional programming languages commonly provide tail call optimization to allow for extensive use of recursion without stack overflow problems. Scala is able to support only partial tail call optimization, however, due to limitations in the JVM. In general, a function that calls itself with a tail call can be optimized, but mutually recursive functions cannot. trampolines have been suggested as a workaround.","Scala has built-in support for pattern matching, which can be thought as a more sophisticated, extensible version of a switch statement, where arbitrary data types can be matched (rather than just simple types like integers, booleans and strings), including arbitrary nesting. A special type of class known as a case class is provided, which includes automatic support for pattern matching and can be used to model the algebraic data types used in many functional programming languages. (From the perspective of Scala, a case class is simply a normal class for which the compiler automatically adds certain behaviors that could also be provided manually -- e.g. definitions of methods providing for provides definitions for certain methods.)","Here is a basic implementation of quicksort in a functional style, using relatively few shortcuts:","We invoke it as follows (in this case, run inside the Scala interpreter):","The idea here is that we partition a list into the elements less than a pivot and the elements not less, recursively sort each part, and paste the results together with the pivot in between. This uses the same divide-and-conquer strategy of mergesort and other fast sorting algorithms.","Although not especially idiomatic, it already shows a number of features:","Despite appearances, there is nothing \"built-in\" about the operators :: and :::. Any string of symbols can serve as function name, and a method applied to an object can be written \"infix\"-style without the period or parentheses. For example, a method call list.drop(2) (which return a new list made up of all but the first 2 elements) could equally well be written list drop 2. Alternatively, the expression x < pivot could equally be written x.","This introduces a considerable amount of new syntax. Nonetheless, it is possible to write it much more idiomatically, as follows:","Compared with the preceding, this uses the following additional syntax:","The body of the match operator is a partial function, which consists of a series of case expressions, with the first matching expression prevailing, similar to the body of a switch statement. Partial functions are also used in the exception-handling portion of a try statement:","Finally, a partial function can be used by itself, and the result of calling it is equivalent to doing a match over it. For example, the previous code for quicksort can be written as follows:","Here we declare a read-only variable whose type is a function from lists of integers to lists of integers, and bind it to a partial function. (Note that the single parameter of the partial function is never explicitly declared or named.) However, we can still call this variable exactly as if it were a normal function:","Scala is a pure object-oriented language in the sense that every value is an object. Data types and behaviors of objects are described by classes and traits. Class abstractions are extended by subclassing and by a flexible mixin-based composition mechanism to avoid the problems of multiple inheritance.","Traits are Scala's replacement for Java's interfaces. Interfaces in Java are highly restricted, able only to contain abstract function declarations. This has led to criticism that providing convenience methods in interfaces is awkward (the same methods must be reimplemented in every implementation), and extending a published interface in a backwards-compatible way is impossible. Traits are similar to mixin classes in that they have nearly all the power of a regular abstract class, lacking only class parameters (Scala's equivalent to Java's constructor parameters), since traits are always mixed in with a class. The super operator behaves specially in traits, allowing traits to be chained using composition in addition to inheritance. For example, consider a simple window system designed as follows:","You can then declare a variable as follows:","Then, the result of calling mywin.draw() will be","In other words, the call to draw first executed the code in TitleDecoration (the last trait mixed in), then (through the super() calls) threaded back through the other mixed-in traits and eventually to the code in Window itself, even though none of the traits inherited from one another. This is similar to the Java decorator pattern (e.g. as used in Java's I\/O classes), but is more concise and less error-prone, as it doesn't require explicitly encapsulating the parent window or explicitly forwarding functions whose implementation isn't changed. This design pattern in Scala has been given the name cake pattern, in homage to the decorator pattern.","Scala is equipped with an expressive static type system that enforces the safe and coherent use of abstractions. In particular, the type system supports:","Scala is able to infer types by usage. This makes most static type declarations optional. Static types need not be explicitly declared unless a compiler error indicates the need. In practice, some static type declarations are included for the sake of code clarity.","The design of Scala acknowledges the fact that, in practice, the development of domain-specific applications often requires domain-specific language extensions. Scala provides a novel combination of language mechanisms that make it easy to smoothly add new language constructs in the form of libraries:","A joint use of both features facilitates the definition of new statements without extending the syntax and without using macro-like meta-programming facilities.","Scala has in its standard library support for the actor model, in addition to the standard Java concurrency APIs. Typesafe have included Akka in their stack, a separate open source framework providing actor based concurrency, where actors may also be distributed or combined with software transactional memory (\"transactors\"). An alternative CSP implementation for channel-based message passing is Communicating Scala Objects.","Here is the classic Hello world program written in Scala:","Unlike the stand-alone Hello World application for Java, there is no class declaration and nothing is declared to be static; a singleton object created with the object keyword is used instead.","With the program saved in a file named HelloWorld.scala, it can be compiled from the command line:","$ scalac HelloWorld.scala","To run it:","$ scala -classpath . HelloWorld","This is analogous to the process for compiling and running Java code. Indeed, Scala's compilation and execution model is identical to that of Java, making it compatible with Java build tools such as Ant.","A shorter version of the \"Hello world\" Scala program is:","Saved in a file named HelloWorld2.scala, this can be run as a script without prior compilation using:","$ scala HelloWorld2.scala","Commands can also be fed directly into the Scala interpreter, using the option -e:","$ scala -e 'println(\"Hello, World!\")'","There are several ways to test code in Scala:","According to Indeed.com Job Trends, Scala demand has been rapidly increasing since 2010.","In April 2009, Twitter announced that it had switched large portions of its backend from Ruby to Scala and intended to convert the rest.","Foursquare uses Scala and Lift.","GridGain provides Scala-based DSL for cloud computing.","In April 2011, The Guardian newspaper's website guardian.co.uk announced that it was switching from Java to Scala, starting with the Content API for selecting and collecting news content. The website is one of the highest-traffic English-language news websites and, according to its editor, has the second largest online readership of any English-language newspaper in the world, after the New York Times.","Swiss bank UBS approved Scala for general production usage.","LinkedIn uses the Scalatra microframework to power its Signal API.","Meetup uses Unfiltered toolkit for real-time APIs.","Remember the milk uses Unfiltered toolkit, Scala and Akka for public API and real time updates."]}