{"name":"Seed7","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Seed7","description":["Seed7 is an extensible general-purpose programming language designed by Thomas Mertes. It is syntactically similar to Pascal and Ada. In addition to many other features it provides an extension mechanism. Seed7 supports the introduction of new syntax and their semantics into the language and it allows new language constructs to be defined using the Seed7 language itself. E.g.: Programmers can introduce syntax and semantic of new statements as well as user defined operator symbols. Therefore the implementation of Seed7 differs very much from the implementation of languages with hard-coded syntax and semantic.","Seed7 supports, besides the imperative, object-oriented and generic paradigm, also technologies like call by name, multiple dispatch, function overloading, operator overloading, exception handling and arbitrary-precision arithmetic. Several programming language concepts are generalized:","Seed7 programs can be interpreted or compiled. The interpreter starts programs very quickly, so program development is not slowed down. The Seed7 compiler uses parser and reflection interface from the run-time library, to generate a C program. The C program is subsequently compiled to machine code. Therefore Seed7 programs can have similar performance as C programs.","Seed7 aims to be source code portable. Due to portable libraries no changes are necessary, when Seed7 programs are moved between different operating systems. Seed7 has over 70 libraries, which cover areas like containers, numeric functions, lexical analysis, file manipulation, networking, graphics, pixmap and vector fonts, CGI support, character encoding, time and date handling and more. This lowers the need to use operating system features and third party libraries.","Seed7 is based on MASTER, an extensible programming language described in diploma thesis and doctoral thesis of Thomas Mertes. Most of the original ideas of MASTER, such as user defined statements and operators, can be found in Seed7. Although it was proposed to implement MASTER with a preprocessor, this was never realized. Starting in 1989 an interpreter for MASTER was developend under the name HAL. In 2005 MASTER respectively HAL was renamed to Seed7 and released as open source.","An extension includes two parts: a syntax definition, giving a template for the new syntactic form, and a standard Seed7 function, used to define the semantics.","The syntax definition uses the Seed7 Structured Syntax Description (S7SSD). A S7SSD statement like","specifies the syntax of the + operator. The right arrow -> describes the associativity: Binding of operands from left to right. With 7 the priority of the + operator is defined. The syntax pattern .(). + .() is introduced and delimited with dots (.). Without dots the pattern is () + () The symbol () is a nonterminal symbol and + is a terminal symbol. The S7SSD does not distinguish between different nonterminal symbols. Instead it only knows one nonterminal symbol: ().","The definition of the + operator for complex numbers is just a function definition:","As of version 2012-06-18 the Seed7 project contains more than 300000 lines of code and several hundred pages of documentation. Based on estimates, that a programmer produces between 5000 and 25000 lines of code per year, the project contains the work of at least 12 man years."]}