{"name":"SiMPLE","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/SiMPLE","description":["SiMPLE (a recursive acronym for SiMPLE Modular Programming Language & Environment) is a programming development system that was created to provide easy programming capabilities for everybody, especially non-professionals.","In 1995, Bob Bishop and Rich Whicker, (both former Apple Computer Engineers) decided to create a new programming language that would be easy enough for everyone to understand and use. (They felt that other existing languages such as C++ and their environments were far too complicated for beginners.) The programming language that they created was called SiMPLE.","SiMPLE is vaguely reminiscent of the AppleSoft BASIC programming language that existed on the old Apple-II computers. However, SiMPLE is not (and was never intended to be) merely a \"clone\" of Applesoft BASIC. It was merely \"inspired\" by it. There are many features of Applesoft that needed to be improved. For example, Applesoft was an interpreted language, and so it ran somewhat slowly (even for a 1MHZ processor). SiMPLE, on the other hand, compiles into an executable (.EXE) file. So it not only produces programs that run faster, but those programs can even run on computers that don't have SiMPLE installed.","Another difference between the two languages is in the use of line numbers. Applesoft required them; SiMPLE doesn't even use them. (Instead of typing program statements onto the black Apple screen, SiMPLE uses a text editor.) Furthermore the \"FOR-NEXT\" loops in Applesoft have been replaced by \"Do-Loop\" instructions in SiMPLE. (But they function in much the same way).","However, aside from a few differences in their outward appearances, writing programs in SiMPLE has a similar \"feel\" to what one experienced when writing programs in Applesoft. For example, when using SiMPLE in command-line mode, a program is run by simply typing the word \"RUN\" on a black screen (just as was done on the Apple!)","\"Simple\" is a generic term for three slightly different versions of the language: Micro-SiMPLE, Pro-SiMPLE, and Ultra-SiMPLE.","(a) Micro-SiMPLE is an introductory programming language designed to use only 4 keywords: Call, Set, If, and Goto. An example of a Micro-SiMPLE program listing (and a snapshot of the output display it generates) is shown in the figure below:","(b) Pro-SiMPLE is the DOS-based version of SiMPLE requiring the use of only 23 keywords. Its graphics capabilities are limited to only 16 colors with a resolution of only 640 x 480 pixels. Its sound capabilities are limited to simple \"beeps\" through the computer's built-in speaker.","(c) Ultra-SiMPLE is the Windows-based version of SiMPLE. It utilizes exactly the same 23 keywords as Pro-SiMPLE. Its graphics capabilities allow millions of colors in whatever resolution the user's system provides. Its sound capabilities allow the user to play any type of media file (including movies).","Prior to 2011 June, SiMPLE was available only for 32-bit computers. Since then, a newer version (which can be used on either 32-bit computers or 64-bit computers) is now the standard version. In this newer version of SiMPLE, the terms \"Pro-SiMPLE\" and \"Ultra-SiMPLE\" have been replaced by the terms \"Dos-SiMPLE\" and \"Win-SiMPLE\" respectively. However, in an effort to provide as much backward compatibility as possible, both of those obsolete terms (\"Ultra-SiMPLE\" and \"Pro-SiMPLE\") are still accepted as being legitimate compiler directives.","In addition, the design of the newer version of SiMPLE is more \"streamlined\". The old original version of SiMPLE was designed to be used only in the closed environment of Command-line mode. (The \"Drag & Drop\" mode of operation wasn't added until many years later.) Consequently the old SiMPLE's Command-line mode required dozens of commands (to support such capabilities as deleting source listings, renaming files, creating new project folders, etc.). The newer version of SiMPLE integrates the SiMPLE environment with the Windows environment so that many of the old SiMPLE's Command-line commands are no longer necessary and have been eliminated.","SiMPLE programs can be run in either \"Drag & Drop\" mode (intended primarily for beginning programmers), or in \"Command-Line\" mode (for more advanced programmers):","(a) In \"Drag & Drop\" mode, the user simply creates a program source listing (a text document), and then runs that program by dragging the source listing document onto a special icon.","(b) In \"Command-Line\" mode, the user creates and runs programs by typing commands and listings into a DOS window.","SiMPLE will run on Windows 95 and newer systems.","SiMPLE is available as a free download from the SiMPLE Codeworks website."]}