{"name":"Simulink","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Simulink","description":["Simulink, developed by MathWorks, is a commercial tool for modeling, simulating and analyzing multidomain dynamic systems. Its primary interface is a graphical block diagramming tool and a customizable set of block libraries. It offers tight integration with the rest of the MATLAB environment and can either drive MATLAB or be scripted from it. Simulink is widely used in control theory and digital signal processing for multidomain simulation and Model-Based Design.","A number of MathWorks and third-party hardware and software products are available for use with Simulink. For example, Stateflow extends Simulink with a design environment for developing state machines and flow charts.","Coupled with Simulink Coder, another product from MathWorks, Simulink can automatically generate C source code for real-time implementation of systems. As the efficiency and flexibility of the code improves, this is becoming more widely adopted for production systems, in addition to being a popular tool for embedded system design work because of its flexibility and capacity for quick iteration. Embedded Coder creates code efficient enough for use in embedded systems.","xPC Target together with x86-based real-time systems provides an environment to simulate and test Simulink and Stateflow models in real-time on the physical system. Embedded Coder also supports specific embedded targets, including Infineon C166, Motorola 68HC12, Motorola MPC 555, TI C2000, TI C6000, Renesas V850 and Renesas SuperH.","With HDL Coder, also from MathWorks, Simulink and Stateflow can automatically generate synthesizable VHDL and Verilog.","Simulink Verification and Validation enables systematic verification and validation of models through modeling style checking, requirements traceability and model coverage analysis. Simulink Design Verifier uses formal methods to identify design errors like integer overflow, division by zero, dead logic and assertion violation, to generate test vectors and for model checking.","The systematic testing tool TPT is used for the formal test- verification and validation process to stimulate Simulink models but also during the development phase where the developer generates inputs to test the system. By the substitution of the Constant and Signal generator blocks of Simulink the stimulation becomes reproducible.","SimEvents adds a library of graphical building blocks for modeling queuing systems to the Simulink environment. It also adds an event-based simulation engine to the time-based simulation engine in Simulink.",""]}