{"name":"Simula","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Simula","description":["Simula is a name for two simulation programming languages, Simula I and Simula 67, developed in the 1960s at the Norwegian Computing Center in Oslo, by Ole-Johan Dahl and Kristen Nygaard. Syntactically, it is a fairly faithful superset of ALGOL 60.:1.3.1","Simula 67 introduced objects,:2, 5.3classes,:1.3.3, 2subclasses,:2.2.1virtual methods,:2.2.3coroutines,:9.2discrete event simulation,:14.2 and features garbage collection.:9.1","Simula is considered the first object-oriented programming language. As its name implies, Simula was designed for doing simulations, and the needs of that domain provided the framework for many of the features of object-oriented languages today.","Simula has been used in a wide range of applications such as simulating VLSI designs, process modeling, protocols, algorithms, and other applications such as typesetting, computer graphics, and education. The influence of Simula is often understated, and Simula-type objects are reimplemented in C++, Java and C#. The creator of C++, Bjarne Stroustrup, has acknowledged that Simula 67 was the greatest influence on him to develop C++, to bring the kind of productivity enhancements offered by Simula to the raw computational speed offered by lower level languages like BCPL.","The following account is based on Jan Rune Holmevik's historical essay.","Kristen Nygaard started writing computer simulation programs in 1957. Nygaard saw a need for a better way to describe the heterogeneity and the operation of a system. To go further with his ideas on a formal computer language for describing a system, Nygaard realized that he needed someone with more programming skills than he had. Ole-Johan Dahl joined him on his work January 1962. The decision of linking the language up to ALGOL 60 was made shortly after. By May 1962 the main concepts for a simulation language were set. \"SIMULA I\" was born, a special purpose programming language for simulating discrete event systems.","Kristen Nygaard was invited to UNIVAC late May 1962 in connection with the marketing of their new UNIVAC 1107 computer. At that visit Nygaard presented the ideas of Simula to Robert Bemer, the director of systems programming at Univac. Bemer was a sworn ALGOL fan and found the Simula project compelling. Bemer was also chairing a session at the second international conference on information processing hosted by IFIP. He invited Nygaard, who presented the paper \"SIMULA -- An Extension of ALGOL to the Description of Discrete-Event Networks\".","Norwegian Computing Center got a UNIVAC 1107 August 1963 at a considerable discount, on which Dahl implemented the SIMULA I under contract with UNIVAC. The implementation was based on the UNIVAC ALGOL 60 compiler. SIMULA I was fully operational on the UNIVAC 1107 by January 1965. In the following couple of years Dahl and Nygaard spent a lot of time teaching Simula. Simula spread to several countries around the world and SIMULA I was later implemented on Burroughs B5500 computers and the Russian URAL-16 computer.","In 1966 C. A. R. Hoare introduced the concept of record class construct, which Dahl and Nygaard extended with the concept of prefixing and other features to meet their requirements for a generalized process concept. Dahl and Nygaard presented their paper on Class and Subclass Declarations at the IFIP Working Conference on simulation languages in Oslo, May 1967. This paper became the first formal definition of Simula 67. In June 1967 a conference was held to standardize the language and initiate a number of implementations. Dahl proposed to unify the type and the class concept. This led to serious discussions, and the proposal was rejected by the board. SIMULA 67 was formally standardized on the first meeting of the SIMULA Standards Group (SSG) in February 1968.","Simula was influential in the development of Smalltalk and later object-oriented programming languages. It also helped inspire the Actor model of concurrent computation although Simula only supports co-routines and not true concurrency.","In the late sixties and the early seventies there were four main implementations of Simula:","These implementations were ported to a wide range of platforms. The TOPS-10 implemented the concept of public, protected, and private member variables and methods, that later was integrated into Simula 87. Simula 87 is the latest standard and is ported to a wide range of platforms. There are mainly three implementations:","In November 2001 Dahl and Nygaard were awarded the IEEE John von Neumann Medal by the Institute of Electrical and Electronic Engineers \"For the introduction of the concepts underlying object-oriented programming through the design and implementation of SIMULA 67\". In February 2002 they received the 2001 A. M. Turing Award by the Association for Computing Machinery (ACM), with the citation: \"For ideas fundamental to the emergence of object oriented programming, through their design of the programming languages Simula I and Simula 67.\" Unfortunately neither Dahl, nor Nygaard could make it to the ACM Turing Award Lecture, scheduled to be delivered at the OOPSLA 2002 conference in Seattle, as they both died within two months of each other] in June and August, respectively.","Simula Research Laboratory is a research institute named after the Simula language, and Nygaard held a part time position there from the opening in 2001.","Simula is still used for various types of university courses, for instance, Jarek Sklenar teaches Simula to students at University of Malta.","The empty computer file is the minimal program in Simula, measured by the size of the source code. It consists of one thing only; a dummy statement.","However, the minimal program is more conveniently represented as an empty block:","It begins executing and immediately terminates. The language does not have any return value from the program itself.","An example of a Hello world program in Simula:","Simula is case-insensitive.","A more realistic example with use of classes:1.3.3, 2, subclasses:2.2.1 and virtual methods:2.2.3:","The above example has one super class (Glyph) with two subclasses (Char and Line). There is one virtual method with two implementations. The execution starts by executing the main program. Simula does not have the concept of abstract classes since classes with pure virtual methods can be instantiated. This means that in the above example all classes can be instantiated. Calling a pure virtual method will however produce a run-time error.","Simula supports call by name:8.2.3 so the Jensen's Device can easily be implemented. However, the default transmission mode for simple parameter is call by value, contrary to ALGOL which used call by name. The source code for the Jensen's Device must therefore specify call by name for the parameters when compiled by a Simula compiler.","Another much simpler example is the summation function  which can be implemented as follows:","The above code uses call by name for the controlling variable (k) and the expression (u). This allows the controlling variable to be used in the expression.","Note that the Simula standard allows for certain restrictions on the controlling variable in a for loop. The above code therefore uses a while loop for maximum portability.","The following:","","can then be implemented as follows:","Simula includes a simulation:14.2 package for doing discrete event simulations. This simulation package is based on Simula's object oriented features and its coroutine:9.2 concept.","Sam, Sally, and Andy are shopping for clothes. They have to share one fitting room. Each one of them is browsing the store for about 12 minutes and then uses the fitting room exclusively for about three minutes, each following a normal distribution. A simulation of their fitting room experience is as follows:","The main block is prefixed with Simulation for enabling simulation. The simulation package can be used on any block and simulations can even be nested when simulating someone doing simulations.","The fitting room object uses a queue (door) for getting access to the fitting room. When someone requests the fitting room and it's in use they must wait in this queue (Wait (door)). When someone leaves the fitting room the first one (if any) is released from the queue (Activate door.first) and accordingly removed from the door queue (door.First.Out).","Person is a subclass of Process and its activity is described using hold (time for browsing the store and time spent in the fitting room) and calls methods in the fitting room object for requesting and leaving the fitting room.","The main program creates all the objects and activates all the person objects to put them into the event queue. The main program holds for 100 minutes of simulated time before the program terminates."]}