{"name":"Small Basic","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/SmallBASIC","description":["This article is about the GPL programming language. For the Microsoft programming language, see Microsoft Small Basic.","SmallBASIC is a BASIC programming language dialect with interpreters released as free software under the GNU General Public License version 2.","The dialect is described by the authors as a second generation BASIC, and has a lot in common with QBasic. It is a structured BASIC, and contains the most advanced math functions and operators found on graphing calculators such as matrices and Gauss-Jordan method.","The \"Small\" prefix in the name SmallBASIC reflects the project's original intention of being used with the Palm, a small hand-held device. SmallBASIC was designed for portability, and is written in C with separate modules containing any code that is unique to a particular platform.","SmallBASIC is intended to support the same sorts of applications supported by GW-BASIC and QBASIC on the IBM PC, with support for drawing Graphic Primitives to the screen, creating sounds, String Manipulation, and displaying text in various fonts. SmallBASIC also adds functions such as \"File Save\", \"Save As\", \"Close File\", and \"Open File\" to the Palm, a device with no native filesystem. SmallBASIC is also intended as a tool for mathematics, with built-in functions for Unit conversion, Algebra, Matrix math, Trigonometry, Statistics, and for two and three dimensional Equation Graphing.","Other programming languages for PalmOS that are written in SmallBASIC include Exclamation and Brainfuck","SmallBASIC was designed to run on minimal hardware. One of the primary platforms supported is Palm OS, where memory, CPU cycles, and screen space are limited. The SmallBASIC graphics engine can use ASCII graphics (similar to ASCII art) and therefore run many programs on pure text devices. SmallBASIC runs even on Palm OS wristwatches made by Fossil, Inc.","It is available for all POSIX-Compliant operating systems (including Linux, BSD, and UNIX),DOS\/DJGPP,Win32,FLTK, VTOS,Franklin eBookMan,Cygwin\/MingW, Helio\/VT-OS,Android (work in progress), the Nokia N770 Internet Tablet., and on any system that supports SDL, FLTK, SVGALib, Linux framebuffer, or Windows GUI."]}