{"name":"SML","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Standard_ML","description":["Standard ML (SML) is a general-purpose, modular, functional programming language with compile-time type checking and type inference. It is popular among compiler writers and programming language researchers, as well as in the development of theorem provers.","SML is a modern descendant of the ML programming language used in the Logic for Computable Functions (LCF) theorem-proving project. It is distinctive among widely used languages in that it has a formal specification, given as typing rules and operational semantics in The Definition of Standard ML (1990, revised and simplified as The Definition of Standard ML (Revised) in 1997).","Standard ML is a functional programming language with some impure features. Programs written in Standard ML consist of expressions to be evaluated, as opposed to statements or commands, although some expressions return a trivial \"unit\" value and are only evaluated for their side-effects.","Like all functional programming languages, a key feature of Standard ML is the function, which is used for abstraction. For instance, the factorial function can be expressed as:","A Standard ML compiler is required to infer the static type int -> int of this function without user-supplied type annotations. I.e., it has to deduce that n is only used with integer expressions, and must therefore itself be an integer, and that all value-producing expressions within the function return integers.","The same function can be expressed with clausal function definitions where the if-then-else conditional is replaced by a sequence of templates of the factorial function evaluated for specific values, separated by '|', which are tried one by one in the order written until a match is found:","This can be rewritten using a case statement like this:","or as a lambda function:","Here, the keyword val introduces a binding of an identifier to a value, fn introduces the definition of an anonymous function, and case introduces a sequence of patterns and corresponding expressions.","Using a local function, this function can be rewritten in a more efficient tail recursive style.","(The value of a let-expression is that of the expression between in and end.) The encapsulation of an invariant-preserving tail-recursive tight loop with one or more accumulator parameters inside an invariant-free outer function, as seen here, is a common idiom in Standard ML, and appears with great frequency in SML code.","A type synonym is defined with the type keyword. Here is a type synonym for points in the plane, and functions computing the distances between two points, and the area of a triangle with the given corners as per Heron's formula.","Standard ML provides strong support for algebraic datatypes. An ML datatype can be thought of as a disjoint union. They are easy to define and easy to program with, in large part because of Standard ML's pattern matching as well as most Standard ML implementations' pattern exhaustiveness checking and pattern redundancy checking.","A datatype is defined with the datatype keyword, as in","(See above for the definition of loc.) Note: datatypes, not type synonyms, are necessary to define recursive constructors. (This is not at issue in the present example.)","Order matters in pattern matching; patterns that are textually first are tried first. Pattern matching can be syntactically embedded in function definitions as follows:","Note that subcomponents whose values are not needed in a particular computation are ellided with underscores, or so-called wildcard patterns.","The so-called \"clausal form\" style function definition, where patterns appear immediately after the function name, is merely syntactic sugar for","Pattern exhaustiveness checking will make sure each case of the datatype has been accounted for, and will produce a warning if not. The following pattern is inexhaustive:","There is no pattern for the Triangle case in the center function. The compiler will issue a warning that the pattern is inexhaustive, and if, at runtime, a Triangle is passed to this function, the exception Match will be raised.","The set of clauses in the following function definition is exhaustive and not redundant:","If control gets past the first pattern (the Circle), we know the value must be either a Square or a Triangle. In either of those cases, we know the shape has corners, so we can return true without discriminating which case we are in.","The pattern in second clause the following (meaningless) function is redundant:","Any value that matches the pattern in the second clause will also match the pattern in the first clause, so the second clause is unreachable. Therefore this definition as a whole exhibits redundancy, and causes a compile-time warning.","C programmers will often use tagged unions, dispatching on tag values, to accomplish what ML accomplishes with datatypes and pattern matching. Nevertheless, while a C program decorated with appropriate checks will be in a sense as robust as the corresponding ML program, those checks will of necessity be dynamic; ML provides a set of static checks that give the programmer a high degree of confidence in the correctness of the program at compile time.","Note that in object-oriented programming languages, such as Java, a disjoint union can be expressed by designing class hierarchies.","Functions can consume functions as arguments:","Functions can produce functions as return values:","(alternatively)","Functions can also both consume and produce functions:","(alternatively)","The function List.map from the basis library is one of the most commonly used higher-order functions in Standard ML:","(A more efficient implementation of map would define a tail-recursive inner loop as follows:)","Exceptions are raised with the raise keyword, and handled with pattern matching handle constructs.","The exception system can be exploited to implement non-local exit, an optimization technique suitable for functions like the following.","When the exception Zero is raised in the 0 case, control leaves the function p altogether. Consider the alternative: the value 0 would be returned to the most recent awaiting frame, it would be multiplied by the local value of h, the resulting value (inevitably 0) would be returned in turn to the next awaiting frame, and so on. The raising of the exception allows control to leapfrog directly over the entire chain of frames and avoid the associated computation.","Standard ML has an advanced module system, allowing programs to be decomposed into hierarchically organized structures of logically related type and value declarations. SML modules provide not only namespace control but also abstraction, in the sense that they allow programmers to define abstract data types.","Three main syntactic constructs comprise the SML module system: signatures, structures and functors. A structure is a module; it consists of a collection of types, exceptions, values and structures (called substructures) packaged together into a logical unit. A signature is an interface, usually thought of as a type for a structure: it specifies the names of all the entities provided by the structure as well as the arities of type components, the types of value components, and signatures for substructures. The definitions of type components may or may not be exported; type components whose definitions are hidden are abstract types. Finally, a functor is a function from structures to structures; that is, a functor accepts one or more arguments, which are usually structures of a given signature, and produces a structure as its result. Functors are used to implement generic data structures and algorithms.","For example, the signature for a queue data structure might be:","This signature describes a module that provides a parameterized type queue of queues, an exception called Queue, and six values (five of which are functions) providing the basic operations on queues. One can now implement the queue data structure by writing a structure with this signature:","This definition declares that TwoListQueue is an implementation of the QUEUE signature. Furthermore, the opaque ascription (denoted by :>) states that any type components whose definitions are not provided in the signature (i.e., queue) should be treated as abstract, meaning that the definition of a queue as a pair of lists is not visible outside the module. The body of the structure provides bindings for all of the components listed in the signature.","To use a structure, one can access its type and value members using \"dot notation\". For instance, a queue of strings would have type string TwoListQueue.queue, the empty queue is TwoListQueue.empty, and to remove the first element from a queue called q one would write TwoListQueue.remove q.","One popular algorithm for breadth-first traversal of trees makes uses of queues. Here we present a version of that algorithm parameterized over an abstract queue structure:","Please note that inside the BFT structure, the program has no access to the particular queue representation in play. More concretely, there is no way for the program to, say. select the first list in the two-list queue representation, if that is indeed the representation being used. This data abstraction mechanism makes the breadth-first code truly agnostic to the queue representation choice. This is in general desirable; in the present case, the queue structure can safely maintain any of the various logical invariants on which its correctness depends behind the bulletproof wall of abstraction.","Snippets of SML code are most easily studied by entering them into a \"top-level\", also known as a read-eval-print loop. This is an interactive session that prints the inferred types of resulting or defined expressions. Many SML implementations provide an interactive top-level, including SML\/NJ:","Code can then be entered at the \"-\" prompt. For example, to calculate 1+2*3:","The top-level infers the type of the expression to be \"int\" and gives the result \"7\".","The following program \"hello.sml\":","can be compiled with MLton:","and executed:","Insertion sort for lists of integers (ascending) is expressed concisely as follows:","This can be made polymorphic by abstracting over the ordering operator. Here we use the symbolic name ","The type of insertionSort' is ('a * 'a -> bool) -> ('a list) -> ('a list).","Here, the classic mergesort algorithm is implemented in three functions: split, merge and mergesort.","The function split is implemented with a local function named loop, which has two additional parameters. The local function loop is written in a tail-recursive style; as such it can be compiled efficiently. This function makes use of SML's pattern matching syntax to differentiate between non-empty list (x::xs) and empty list ([]) cases. For stability, the input list ns is reversed before being passed to loop.","The local-in-end syntax could be replaced with a let-in-end syntax, yielding the equivalent definition:","As with split, merge also uses a local function loop for efficiency. The inner loop is defined in terms of cases: when two non-empty lists are passed, when one non-empty list is passed, and when two empty lists are passed. Note the use of the underscore (_) as a wildcard pattern.","This function merges two \"ascending\" lists into one ascending list. Note how the accumulator out is built \"backwards\", then reversed with List.rev before being returned. This is a common technique—build a list backwards, then reverse it before returning it. In SML, lists are represented as imbalanced binary trees, and thus it is efficient to prepend an element to a list, but inefficient to append an element to a list. The extra pass over the list is a linear time operation, so while this technique requires more wall clock time, the asymptotics are not any worse.","The main function.","Also note that the code makes no mention of variable types, with the exception of the :: and [] syntax which signify lists. This code will sort lists of any type, so long as a consistent ordering function lt can be defined. Using Hindley–Milner type inference, the compiler is capable of inferring the types of all variables, even complicated types such as that of the lt function.","Quicksort can be expressed as follows. This generic quicksort consumes an order operator ","Note the relative ease with which a small expression language is defined and processed.","In SML, the IntInf module provides arbitrary-precision integer arithmetic. Moreover, integer literals may be used as arbitrary-precision integers without the programmer having to do anything.","The following program \"fact.sml\" implements an arbitrary-precision factorial function and prints the factorial of 120:","and can be compiled and run with:","Since SML is a functional programming language, it is easy to create and pass around functions in SML programs. This capability has an enormous number of applications. Calculating the numerical derivative of a function is one such application. The following SML function \"d\" computes the numerical derivative of a given function \"f\" at a given point \"x\":","This function requires a small value \"delta\". A good choice for delta when using this algorithm is the cube root of the machine epsilon.[citation needed]","The type of the function \"d\" indicates that it maps a \"float\" onto another function with the type \"(real -> real) -> real -> real\". This allows us to partially apply arguments. This functional style is known as currying. In this case, it is useful to partially apply the first argument \"delta\" to \"d\", to obtain a more specialised function:","Note that the inferred type indicates that the replacement \"d\" is expecting a function with the type \"real -> real\" as its first argument. We can compute a numerical approximation to the derivative of  at  with:","The correct answer is =>.","The function \"d\" is called a \"higher-order function\" because it accepts another function (\"f\") as an argument.","Curried and higher-order functions can be used to eliminate redundant code. For example, a library may require functions of type a -> b, but it is more convenient to write functions of type a * c -> b where there is a fixed relationship between the objects of type a and c. A higher order function of type (a * c -> b) -> (a -> b) can factor out this commonality. This is an example of the adapter pattern.","The 1D Haar wavelet transform of an integer-power-of-two-length list of numbers can be implemented very succinctly in SML and is an excellent example of the use of pattern matching over lists, taking pairs of elements (\"h1\" and \"h2\") off the front and storing their sums and differences on the lists \"s\" and \"d\", respectively:","For example:","Pattern matching is a useful construct that allows complicated transformations to be represented clearly and succinctly. Moreover, SML compilers turn pattern matches into efficient code, resulting in programs that are not only shorter but also faster.","Many SML implementations exist, including:","All of these implementations are open-source and freely available. Most are implemented themselves in SML. There are no longer any commercial SML implementations. Harlequin once produced a commercial IDE and compiler for SML called MLWorks. The company is now defunct. MLWorks is believed to have been passed on to Xanalys."]}