{"name":"STATA","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/STATA","description":["Stata is a general-purpose statistical software package created in 1985 by StataCorp. It is used by many businesses and academic institutions around the world. Most of its users work in research, especially in the fields of economics, sociology, political science, biomedicine and epidemiology.[citation needed]","Stata's capabilities includes data management, statistical analysis, graphics, simulations, and custom programming.","The name Stata is a portmanteau of the words statistics and data; it is not an acronym and therefore should not appear with all letters capitalized (i.e., as STATA). The correct English pronunciation of Stata \"must remain a mystery\"; any of \"Stay-ta\", \"Sta-ta\" or \"Stah-ta\" are considered acceptable.","There are four major builds of each version of Stata:","Stata has always emphasized a command-line interface, which facilitates replicable analyses. Starting with version 8.0, however, Stata has included a graphical user interface which uses menus and dialog boxes to give access to nearly all built-in commands. This generates code which is always displayed, easing the transition to the command line interface and more flexible scripting language. The dataset can be viewed or edited in spreadsheet format. From version 11 on, other commands can be executed while the data browser or editor is opened.","Stata can only open a single dataset at any one time. Stata holds the entire dataset in (random-access or virtual) memory, which limits its use with extremely large datasets. This is mitigated to some extent by efficient internal storage, as there are integer storage types which occupy only one or two bytes rather than four, and single-precision (4 bytes) rather than double-precision (8 bytes) is the default for floating-point numbers.","The dataset is always rectangular in format, that is, all variables hold the same number of observations (in more mathematical terms, all vectors have the same length, although some entries may be missing values).","Stata can import data in a variety of formats. This includes ASCII data formats (such as CSV or databank formats) and spreadsheet formats (including various Excel formats).","Stata's proprietary file formats are platform independent, so users of different operating systems can easily exchange datasets and programs. Stata's data format has changed over time, although not every Stata release includes a new dataset format. Every version of Stata can read all older dataset formats, and can write both the current and most recent previous dataset format, using the saveold command. Thus, the current Stata release can always open datasets that were created with older versions, but older versions cannot read newer format datasets.","Stata can read and write SAS XPORT format datasets natively, using the fdause and fdasave commands.","Some other econometric applications, including gretl, can directly import Stata file formats.","Stata is unusual among commercial statistics packages in allowing user-written commands, distributed as so called ado-files, to be straightforwardly downloaded from the internet which are then indistinguishable to the user from the built-in commands. In this respect, Stata combines the extensibility more often associated with open-source packages with features usually associated with commercial packages such as software verification, technical support and professional documentation. Some user-written commands have later been adopted by StataCorp to become part of a subsequent official release after appropriate checking, certification and documentation.","Stata has an active email list (\"Statalist\", over 1000 messages per month), to which StataCorp employees regularly contribute. Statalist is maintained by Marcello Pagano of the Harvard School of Public Health, and not by StataCorp itself.","Articles about the use of Stata and new user-written commands are published in the quarterly peer-reviewed Stata Journal. The Stata Journal is a quarterly publication containing articles about statistics, data analysis, teaching methods, and effective use of Stata's language.","User Group meetings are held annually in the United States (the Stata Conference), the UK, Germany, and Italy, and less frequently in several other countries. Only the annual Stata Conference held in the United States is hosted by StataCorp LP. Local Stata distributors host User Group meetings in their own countries, however, Stata developers frequently travel to and present at these meetings. Established under the Societies Act on 10 May 2008, Singapore Stata Users Group is the world's first government-approved users group (Registration No: 2048\/2008; Unique Entity No: T08SS0091A). Its slogan is \"Shaping Data Meaningfully\". As a non-profit organisation, StataUGS does not organise regular meetings but provides programming and statistical advice to users in Singapore through informal means. The active members of StataUGS are mostly enagaged in biomedical research.","To perform logistic regression of y on x:","To display a scatter plot of y against x restricted to values of x below 10:","To perform OLS regression of y on x with White's heteroscedasticity-consistent standard errors:","Since 2000, StataCorp have released a new major release of Stata (incrementing the integer part of the version number) roughly every two years. Users must pay a fee if they wish to upgrade to the latest major release. Minor releases (incrementing the decimal part of the version number) are sometimes made available in between major releases. These are available as free downloadable updates to those who have a licence for the previous major release. Dates of all releases are available on the Stata website. Stata's version control system is designed to give a very high degree of backward compatibility, ensuring that code written for previous releases continues to work. Stata 11 shipped on July 27, 2009. Stata 12 began shipping on July 25, 2011.","Stata Press, a division of StataCorp LP, publishes books, manuals, and journals about Stata statistical software and books about statistics, whether or not they concern Stata, if they are of interest to professional researchers. StataCorp LP has an Author Support Program, which is free, and offers the following services: Stata professionals will review your Stata code and output to ensure that it is efficient and reflects modern usage. Stata production specialists will help you format Stata output (including graphs) to appear in your book. Stata editors and statisticians will review and ensure the accuracy of Stata-related content."]}