{"name":"Sterling\/Informatics","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Sterling_Software","description":["Sterling Software was an American software company founded in Dallas, Texas in 1981 by Sterling Williams and brothers Sam and Charles Wyly. The company was acquired by Computer Associates International in 2000 in a stock-for-stock transaction worth $3.3 billion. Computer Associates sold Sterling Software's Federal Systems Group to Northrop Grumman in 2000.","It was known for its aggressive acquisitions, most notably the hostile take-over of Informatics General Corporation in 1985.","Informatics was one of the first established software and services companies. It developed the MARK-IV Fourth-generation programming language in the 1960s. MARK-IV became the first software package exceeding $1 million in revenue, after IBM was forced in 1969 to unbundle software from their hardware.","Helped by financing and counseled by Werner Frank, one of Informatics' founders who had left this company a year before, Sterling Software started the hostile take over by offering to shareholders an interesting price per share and increasing it slowly until the Informatics board was no longer able to reject it. Overnight, Sterling Software became a $200 million in revenue company up from $20 million. After only 2 years, they started again acquiring new companies.","Acquired Reston, VA-based Systems Center, Inc. in 1993 in a stock-for stock transaction worth $185 million, Sterling Software's 20th acquisition. In the process of this acquisition, Sterling Software was completely restructured along lines of business, as opposed to the previous practice of absorbing acquired companies as essentially equivalent divisions.[citation needed]","Acquired Atlanta-based KnowledgeWare in a stock-for-stock transaction worth $74 million in 1994, in the process eliminating about 250 jobs in the combined companies. KnowlegeWare's founder Fran Tarkenton joined the Sterling Software board of directors as part of the deal.","Acquired Texas Instruments's Dallas-based software division (known as TI Software) for $165 million cash in 1997, about 66% of its previous year's revenue. The acquisition included the rights to Information Engineering Facility[citation needed].","Acquired Boston-based Cayenne Software for $11.4 million in cash in 1998, Sterling Software's 30th acquisition.","Acquired Fremont, California-based Interlink Computer Sciences in 1999 for $64 million in cash, merging Interlink into Sterling's existing Network Management Division."]}