{"name":"SBL","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Superbase_database","description":["Superbase is an end-user desktop database program that started on the Commodore 64 and was ported from that to various operating systems over the course of more than 20 years. It also has generally included a programming language to automate database-oriented tasks, and with later versions included WYSIWYG form and report designers as well as more sophisticated programming capabilities.","It was originally created in 1984 by Precision Software for the Commodore 64 and 128 and later the Amiga and Atari ST. In 1989, it was the first database management system to run on a Windows computer.","Precision Software, a UK-based company, was the original creator of the product Superbase. Superbase was and still is used by a large number of people on various platforms. It was often used only as an end-user database but a very large number of applications were built throughout industry, government, and academia and these were often of significant complexity. Some of these applications continue in use to the current day, mostly in small businesses.","The initial versions were text mode only, but with the release of the Amiga version, a completely new paradigm for accessing databases was created. Superbase was the first product to use the now common VCR control panel for browsing through records. It also provided a number of different media formats that it directly supported, including images, sounds, and video. Superbase was often referred to as the multimedia database in early years, when such features were uncommon. Amiga version also featured an internal language and the capability to generate front end \"masks\" for queries and reports, years before Microsoft Access.","This version was a huge success and that resulted in a version being created for a number of platforms using the same approach. Eventually a Microsoft Windows version was released and a couple of years later the company was sold by its founders to Software Publishing Corporation. SPC sold off the non-Windows versions of the product and after releasing version 2 and in the late alpha stages of version 3, sold the product to a company called Computer Concepts Corporation.","This relatively unknown company created a subsidiary called Superbase, Inc. and after finishing off the late stage alpha of version 3 and launching it as Superbase 95, eventually appeared to have lost interest in the product, at which point it was bought by a small group of former customers and brought back to the UK. This company, Superbase Developers plc, continued to extend and support the product through Superbase Classic.","A new, next-generation rewrite of the product inititially called Superbase Next Generation (SBNG) which included a new object oriented programming language called SIMPOL) was begun in 1999-2000. It had primarily been an alpha product; although it was billed as a beta release in 2005 with promises that a true release would be around the corner.","In 2006, SIMPOL was sold to RealBasics Ltd which was later renamed Simpol Ltd (www.simpol.com).","In April 2009 this company launched SIMPOL Professional, which is the next generation product, as a cross-platform language and database tool set.","In February 2009, it was announced that Superbase Developers plc was in liquidation.","In March 2010 Papatuo Holdings Ltd. purchased the Superbase family of products from the official receivers of Superbase Developers plc.","Superbase has been used for very basic end-user tasks, but its real strength lies in the ability of relatively untrained programmers to create complex applications. These are typically built up over time as need arises. The types of applications run the gamut from accounting systems, ERP\/MRP packages, business information systems, production control systems, and similar complex products down to very basic membership list or contact management systems.","It contains a high-speed versatile ISAM database engine and its own powerful dialect of BASIC, as well as sophisticated forms and report engines. It also includes powerful support for acting as the front-end for one or more SQL databases. Its biggest drawback is the fact that it was written to the 16-bit Windows API and was not easily portable to the 32-bit version. The rewritten version is intended to cure that and to make the package even easier to use and more powerful.","From a casual programmer's perspective, the fact that the database is not based on SQL is a significant advantage, since the level of complexity is far less and it is easier for the user to grasp the concepts of how to manage and traverse the database.","There are numerous powerful features in the product, a few of them are:"]}