{"name":"TELCOMP","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/TELCOMP","description":["TELCOMP was a programming language developed at Bolt, Beranek and Newman (BBN) in about 1965 and in use until at least 1974.","It was an interactive, conversational language based on JOSS, developed by BBN after Cliff Shaw from RAND visited the labs in 1964 as part of the NIH survey. It was first implemented on the PDP-1 and was used to provide a commercial time sharing service by BBN in the Boston area and later by Time Sharing Ltd. in the United Kingdom.","In 1996, Leo Beranek said \"We even developed a programming language called TELCOMP that to this day, some say was better than the programming language that the industry adopted, namely BASIC.\"","There were at least three versions: TELCOMP I, TELCOMP II, and TELCOMP III.","TELCOMP II was implemented on the PDP-7 and TELCOMP III on the PDP-10, running on DEC 's TOPS-10 operating system or on BBN's own TENEX operating system.","TELCOMP programs were normally input via a paper tape reader on a Teletype Model 33, which would be connected to a PDP via a modem and acoustic telephone line. Data could be read from the paper tape reader or from the Teletype keyboard. Output was either printed to the Teletype or sent to the paper tape punch. Early versions had no facility for on-line storage of programs or data.","During data input using a Teletype, the user would type a response to a printed prompt. If, instead of hitting Return, the user hit Tab, another, possibly computed, prompt would be printed on the same line. This process could be repeated for the full width of the line. This unusual feature allowed very compact data entry, comparable to full-screen CRT data entry. It saved paper, and the input section of the form became part of the program's printed output.","A later derivative of TELCOMP called STRINGCOMP was oriented towards string handling. Another BBN JOSS-derivative called FILECOMP was developed for the GE MEDINET system, which was cancelled. The implicit file handling system it contained was influential on the MUMPS global database system.","The initial research for LOGO was carried out in TELCOMP, but only the JOSS-style errors and interaction made it through to the actual language.","A TELCOMP program was made up of numbered lines, each line referred to as a Step. Steps were grouped into Parts. Each line contained one instruction."]}