{"name":"Turing","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Turing_(programming_language)","description":["Turing is a Pascal-like programming language developed in 1982 by Ric Holt and James Cordy, then of University of Toronto, Canada. Turing is a descendant of Euclid, Pascal and SP\/k that features a clean syntax and precise machine-independent semantics.","Named after British computer scientist Alan Turing, Turing is used primarily as a teaching language at the high school and university level.[citation needed] Two other versions exist, Object-Oriented Turing and Turing Plus, a systems programming variant. In September 2001, \"Object Oriented Turing\" was renamed \"Turing\" and the original Turing was renamed \"Classic Turing\". Turing is no longer supported by Holt Software Associates in Toronto. Currently, Microsoft Windows is the only supported platform. Turing is widely used in high schools in Ontario as an introduction to programming.[citation needed]","On November 28, 2007, Turing, which was previously a commercial programming language, became freeware, available to download from the developer's website free of charge for personal, commercial, and educational use.","The makers of Turing, Holt Software Associates, have since ceased operations. It is unclear whether Turing is still in development, but there have been no new releases since November 25, 2007.","Turing is designed to have a very lightweight, readable, intuitive syntax. Here is the entire Hello World! program in Turing with syntax highlighting:","Turing avoids semicolons and braces, using explicit end markers for most language constructs instead, and allows declarations anywhere. Here is a complete program defining and using the traditional recursive function to calculate a factorial.","Currently, there are two open source alternative implementations of Turing: Open Turing, an open source version of the original interpreter, TPlus, a native compiler for the concurrent systems programming language variant Turing Plus, and OpenT, an abandoned project to develop a compiler for Turing.","Open Turing is an open-source implementation of the original Turing interpreter for Windows written by Holt Software. It includes speed improvements, new features such as OpenGL 3D and a new code editor. It is fully backwards compatible with the non open source implementation.","TPlus is an open-source implementation of original (non-OO) Turing with systems programming extensions developed at the University of Toronto and ported to Linux, Solaris and Mac OS X at Queen's University in the late 1990s. TPlus implements Turing+ (Turing Plus), a concurrent systems programming language based on the original Turing programming language. Some, but not all, of the features of Turing Plus were eventually subsumed into the present Object-Oriented Turing language. Turing Plus extends original Turing with processes and monitors (as specified by C.A.R. Hoare) as well as language constructs needed for systems programming such as binary input-output, separate compilation, variables at absolute addresses, type converters and other features.","OpenT is an abandoned open-source language, compiler, and IDE that was being developed by the members of the dTeam of Computer Science Canada. It shares many similarities with Turing, and is fully backwards compatible with it.","This article is based on material taken from the Free On-line Dictionary of Computing prior to 1 November 2008 and incorporated under the \"relicensing\" terms of the GFDL, version 1.3 or later."]}