{"name":"Unisys\/Sperry","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Unisys","description":["Unisys Corporation (NYSE: UIS) is an American global information technology (IT) company based in Blue Bell, Pennsylvania, USA. The company provides a portfolio of IT services, software, and technology.","Unisys has a long history in the technology industry. The company traces its roots back to the founding of American Arithmometer Company (later Burroughs Corporation) in 1886 and the Sperry Gyroscope Company in 1910. Unisys predecessor companies also include the Eckert–Mauchly Computer Corporation, which invented the world's first large-scale digital computer, the ENIAC, at the University of Pennsylvania.","In September 1986 Unisys was formed through the merger of the mainframe corporations Sperry and Burroughs, with Burroughs buying Sperry for $4.8 billion. The name was chosen in an internal competition when an intern, Charles Ayoub, came up with the UNISYS acronym from United Information Systems. The merger was the largest in the computer industry at the time and made Unisys the second largest computer company with annual revenue of $10.5 billion. At the time of the merger, Unisys had approximately 120,000 employees.","In addition to hardware, both Burroughs and Sperry had a history of working on U.S. government contracts. Unisys continues to provide hardware, software, and services to various government agencies.","Soon after the merger, the market for proprietary mainframe-class systems—the mainstream product of Unisys and its competitors such as IBM—began a long-term decline that continues, at a lesser rate, today. In response, Unisys made the strategic decision to shift into high end servers (e.g., 32 processor Windows Servers), as well as information technology (IT) services such as systems integration, outsourcing, and related technical services, while holding onto the profitable revenue stream from maintaining its installed base of proprietary mainframe hardware and applications.","Important events in the company's history include the development of the 2200 series in 1986, including the UNISYS 2200\/500 CMOS mainframe, and the Micro A in 1989, the first desktop mainframe, the UNISYS ES7000 servers in 2000, and the Unisys blueprinting method of visualizing business rules and workflow in 2004.","In 1988 the company acquired Convergent Technologies, makers of CTOS.","On October 7, 2008, J. Edward Coleman replaced J. McGrath as CEO and Chairman.","On November 11, 2008, the company was removed from the Standard & Poor's 500 index as the market capitalization of the company had fallen below the S&P 500 minimum of $4 billion.","Paralleling larger trends in the U.S. information technology industry, an increasing amount of Unisys revenue comes from services rather than equipment sales. In 2008, the ratio was 88% for services, up from 65% in 1997. Unisys clients are typically large corporations or government agencies, and have included Washington Mutual, the New York Clearinghouse, Dell, Lufthansa Systems, Lloyds TSB, EMC, SWIFT, various state governments (for services such as unemployment insurance, licensing, etc.), various branches of the U.S. military, the Federal Aviation Administration (FAA), numerous airports, the General Services Administration, U.S. Transportation Security Administration, Internal Revenue Service, Nextel, and Telefonica of Spain.","The company maintains a portfolio of over 1500 U.S. and non-U.S. patents.","Unisys systems are used for many industrial and government purposes, including banking, check processing, income tax processing, airline passenger reservations, biometric identification, newspaper content management and shipping port management, as well as providing weather data services. Unisys developed the software for NEXRAD, the original doppler weather radar, and has since provided weather data consisting of radar, satellite, lightning, etc. Unisys operates the world's largest RFID network for the U.S. military, tracking 9 million containers yearly to 1,500 nodes in 25 countries. It also created the universal identification card for citizens of South Africa.","The company engages in consulting, one-time contract jobs, and contracts for ongoing outsourced IT services. Services include building and integrating hardware and software systems, providing ongoing hosting and management of data, Business Processing Outsourcing, outsourced help desks and End User Services, Secure Cloud, planning operational processes and changes, and providing security services.","The company's mainframe line, Clearpath, is capable of running not only mainframe software, but both the Java platform and the JBoss Java EE Application Server concurrently. The Clearpath system is available in either a UNISYS 2200-based system (Sperry) or an MCP-based system (Burroughs).[citation needed]","Secure Partitioning (s-Par), a Unisys solution is a virtualization technology for Intel processor-based ClearPath servers. The s-Par technology divides a high-performance system into 4 secure partitions, accommodating the central processing complex and three specialty engines, which perform specific application functions, such as web services and Java application deployment. This allows ClearPath users to make use of special-purpose processors called specialty engines to streamline resource management.","Unisys launched the Hosted Secure Private Cloud in December 2010. It provides all the benefits of a private cloud, which is fast access to IT resources without the need for purchasing additional infrastructure as well as control over shared business assets with better capabilities for complying with regulations. The solution dedicates a specific set of IT resources – computing, storage, network and middleware – to each customer and allows for adding IT resources to the private cloud within a matter of minutes, through automation.","In March 2011, the company launched Unisys Hybrid Enterprise Framework, a methodology and set of services which manage multiple IT delivery models – both traditional and cloud-based – within a consistent computing environment managed as a single entity. A key part of the framework includes a portfolio of cloud building services, which focus on the planning, designing and implementation of mission-critical cloud solutions within an integrated enterprise environment.","In June 2012, Unisys announced the availability of its Mobility Solutions Suite of services. These services are designed to help organizations manage, secure and support mobile devices such as smartphones and tablets as well as their applications. The solution addresses a range of requirements including, assessment services, user authentication, and application development and managed services for both service desk and for device management.The company is partnering with Intel to support laptops and Ultrabook devices that include Intel Anti-Theft (AT) to automatically or remotely disable the device if it is lost or stolen. The device then can be restored to its original state if the authorized user finds it again.","The company also launched a new suite of cloud-based IT Service Management (ITSM) solutions, in June 2012. The solutions focus on helping organizations implement an ITIL-based system that improves delivery of IT support services to end users, simplifies service operations.","The company launched a new set of initiatives which include","Consumerization of IT: A study sponsored by Unisys and conducted by IDC, which revealed the gap between the activities and expectations of new generation of “iWorkers” and the ability of organizations to support their needs. The results showed that organizations continue to work with standardized command and control IT models of the past and are not able to profit from the widespread use of newer networked technologies.","Security Index: A biannual global study that provides statistically relevant insights into the attitudes of consumers on a wide range of security related issues, including: National security - including concerns related to terrorism and health epidemics. Financial security - regarding financial fraud and ability to meet personal financial obligations. Internet security - related to spam, virus, and online financial transactions. Personal security - concerning physical safety and identity theft.","Cloud 20\/20: Unisys Corporation launched Cloud 20\/20, an annual technical paper contest for tertiary students from India, in October 2009. The contest allows students to explore the possibilities and complexities of cloud computing in areas such as automation, virtualization, application development, security, consumerization of IT and airports. The contest has drawn participation from universities across India two years in a row—with over 570 institutes taking part in 2009 and more than a thousand in 2010. Cloud 20\/20 is open to research students and post-graduates as well as pre-final and final year engineering students in Computer Science, Information Technology and other related areas. The contest culminates in an event where five finalists present their papers before a panel of judges that comprise academicians and technologists. Prizes include the latest technology gadgets, internship projects and career opportunities with Unisys. The latest version of the contest is currently underway.","Social Collaboration:Unisys was in the news for enhancing social collaboration within the organization. The company has used social media tools successfully, to become more agile, to share knowledge, and to increase the speed of innovation.Unisys was one of five companies featured in a new infographic on The Social Media Marketing Blog; Unisys was noted for using social media internally for effective collaboration and a boost to company productivity.","Unisys operates data centers around the world that are certified on global standards for service quality and excellence. Those certifications include ISO 9001:2008, ISO 20000-1:2005, and ISO 27001 standards. Unisys data centers follow Global Process Standards (GPS) for ITIL processes. In addition, Unisys supports and manages data centers at client-owned facilities.","In addition, Unisys operates several software development centers that have achieved process maturity following the Software Engineering Institute's Capability Maturity Model Integration (CMMI) for Development Model. The CMMI for Development model provide guidance for applying CMMI best practices in a development organization. Best practices in the model focus on activities for developing quality products and services to meet the needs of customers and end users. Published appraisal results can be found on the SEI's website.","Unisys aims to produce environmentally responsible products and services. The company has corporate policies to encourage employees to conserve energy and to conduct recycling and energy conservation programs within its facilities and data centers.[citation needed]","Clean air program: Provides employees with the option of setting up home based offices and reduce the need for daily work related travel. In 2010, this travel reduction resulted in the elimination of over 8500 metric tons of CO2 emissions.","Community projects: Unisys was recognized by the City of San Diego as the ‘Recycler of the Year’ from 2002–2005 and was given the Integrated Waste Management award by the State of California in 2002-2005. Unisys was honored at the 2008 Computerworld Green IT Symposium in Washington D.C. In 2009, Unisys was named in the Black Book of Outsourcing as one of the top 50 “green” outsourcing providers in the world.","Pollution prevention: Since 1996, Unisys has reduced hazardous waste generation by approximately 95%. Unisys has collected over 35 million pounds of used electronic products internally and from customers since 1997. Many parts were refurbished for future use or sold while the remaining materials were delivered to end of life electronic equipment recyclers.","ISO 14001 Environmental Management Systems: The Unisys manufacturing site in Irvine, California received ISO 14001 Environmental Management System (EMS) certification. Through on-going EMS implementation, the company continues to formulate and implement policy and objectives that take into account legislative requirements, environment-friendly technological approaches and information about significant environmental impacts.","Unisys attracted attention in 1994 after announcing its patent on the LZW data compression algorithm, which is used in the common GIF image file format. For a more complete discussion of this issue, see Graphics Interchange Format#Unisys and LZW patent enforcement.","Unisys was the target of \"Operation Ill Wind\", a major corruption investigation in the mid-to-late-1980s. As part of the settlement, all Unisys employees were required to receive ethics training each year, a practice that continues today.[citation needed]","In 2003 and 2004, Unisys retained the influential lobbyist Jack Abramoff, paying his firm $640,000 for his services in those two years. In January 2006, Abramoff pleaded guilty to five felony counts for various crimes related to his federal lobbying activities, though none of his crimes involved work on behalf of Unisys. The lobbying activities of Abramoff and his associates are now the subject of a large federal investigation.","In October 2005, the Washington Post reported that the company had allegedly overbilled on the $1-to-3-billion Transportation Security Administration contract for almost 171,000 hours of labor and overtime at up to the maximum rate of $131.13 per hour, including 24,983 hours not allowed by the contract. Unisys denied wrongdoing.","In 2006, the Washington Post reported that the FBI was investigating Unisys for alleged cybersecurity lapses under the company's contract with the United States Department of Homeland Security. A number of security lapses supposedly occurred during the contract, including incidents in which data was transmitted to Chinese servers. Unisys denies all charges and said it has documentation disproving the allegations.","In 2008 Joe McGrath stepped down after a no confidence vote from the board, and was replaced by J. Edward Coleman, former CEO of Gateway Incorporated. The president of the Federal sector Greg Baroni was also fired. Unisys announced on June 30, 2008 that the Transportation Security Administration (TSA) had not selected the company for Phase 2 of procurement for the Information Technology Infrastructure Program. In July, Unisys announced its plans to file a formal protest of the TSA decision with the Government Accountability Office (GAO). On August 20, the TSA announced it was allowing bidding from all competitors including Unisys and Northrop Grumman, who both filed formal protests with the GAO and protested TSA's decision to the Federal Aviation Administration's Office of Dispute Resolution, after not initially being selected.","2009: Unisys boasts about firing American workers; \"We were able to eliminate a whole bunch of actually U.S.-based jobs and kind of replace them with two folks out of India\" (Richard Marcello, president of technology, consulting, and integration solutions) The company completed a one-for-ten reverse stock split in October 2009, in an attempt to prop up stock prices and fend off delisting.","2010: Unisys jettisons Medicare processing Health Information Management service to Molina Healthcare for $135 million."]}