{"name":"UnrealScript","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/UnrealScript","description":["UnrealScript (often abbreviated to UScript) is the scripting language of the Unreal Engine and is used for authoring game code and gameplay events. The language was designed for simple, high-level game programming. The UnrealScript interpreter was programmed by Tim Sweeney, who also created an earlier game scripting language, ZZT-oop.","Similar to Java, UnrealScript is object-oriented without multiple inheritance (classes all inherit from a common Object class), and class are defined in individual files named for the class they define. Unlike Java, UnrealScript is case-insensitive, and does not have object wrappers for primitive types. Interfaces are only supported in Unreal Engine generation 3 and a few Unreal Engine 2 games. UnrealScript supports operator overloading, but not method overloading, except for optional parameters.","By making the process of modifying the game easier, UnrealScript helped enable the growth of a large modding community around Unreal. This greatly added to the overall longevity of Unreal and provided an incentive for new development.","UnrealScript uses two commenting styles, a single-line comment (beginning with \/\/ until the end of the line) and a multi-line comment (delimited by \/* and *\/).","UnrealScript uses functions similar to C\/C++. Functions are declared by the keyword: function, the return type: int, the name: example_function, and finally the function parameters enclosed in parenthesis: (int example_number).","The body is enclosed in brackets { example_number = 5; }.","Before the final bracket, a return function can be called, returning the a value to the original caller.","This function takes the integer example_number, changes its value to 5, then returns its value to the caller.","The following is a hello world example using the syntax of UnrealScript.","The following text will be printed to the output console when HelloWorld is initializing:"]}