{"name":"VBScript","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/VBScript","description":["VBScript (Visual Basic Scripting Edition) is an Active Scripting language developed by Microsoft that is modeled on Visual Basic. It is designed as a “lightweight” language with a fast interpreter for use in a wide variety of Microsoft environments. VBScript uses the Component Object Model to access elements of the environment within which it is running; for example, the FileSystemObject (FSO) is used to create, read, update and delete files.","VBScript has been installed by default in every desktop release of Microsoft Windows since Windows 98; in Windows Server since Windows NT 4.0 Option Pack; and optionally with Windows CE (depending on the device it is installed on).","A VBScript script must be executed within a host environment, of which there are several provided with Microsoft Windows, including: Windows Script Host (WSH), Internet Explorer (IE), and Internet Information Services (IIS). Additionally, the VBScript hosting environment is embeddable in other programs, through technologies such as the Microsoft Script Control (msscript.ocx).","VBScript began as part of the Microsoft Windows Script Technologies, launched in 1996. This technology (which also included JScript) was initially targeted at web developers. During a period of just over two years, VBScript advanced from version 1.0 to 2.0, and over that time it gained support from Windows system administrators seeking an automation tool more powerful than the batch language first developed in the early 1980s.","On March 6, 1988 Alan Cooper showed Bill Gates his shell prototype that allowed widgets to be added dynamically. March 20, 1991, Microsoft adopted \"Quick Basic\" to Ruby Shell. This allowed users to create Windows apps quickly and easily with a GUI. Finally, on August 1, 1996, Internet Explorer is made with features that include VBScript.","In version 5.0, the functionality of VBScript was increased with new features such as: regular expressions; classes; the With statement; the Eval, Execute, and ExecuteGlobal functions to evaluate and execute script commands built during the execution of another script; a function-pointer system via GetRef, and Distributed COM (DCOM) support.","In version 5.5, SubMatches were added to the regular expression class in VBScript, to finally allow script authors to capture the text within the expression's groups. That capability had already been available in JScript.","With the advent of the .NET framework, the scripting team took the decision to implement future support for VBScript within ASP.NET for web development, and therefore no new versions of the VBScript engine would be developed and it moved over to being supported by Microsoft's Sustaining Engineering Team, who are responsible for bug fixes and security enhancements. For Windows system administrators, Microsoft suggests that they migrate to Windows PowerShell. However, the scripting engine will continue to be shipped with future releases of Microsoft Windows and IIS.","Although VBScript is a general-purpose scripting language, several particular areas of use are noteworthy. First, it is widely used among system administrators in the Microsoft environment. This situation may change with the promotion and increased use of Windows PowerShell. Second, VBScript is the scripting language for Quick Test Professional, a test automation tool. A third area to note is the adoption of VBScript as the internal scripting language for some embedded applications, such as industrial operator interfaces and human machine interfaces. The hierarchical DBMS InterSystems Cache (which has its roots in the language MUMPS) also supports an implementation of VBScript, Cache BASIC, for programming stored code..[citation needed]","This relatively widespread use of VBScript is not because of many special merits of VBScript - several useful features of the full Visual Basic, such as strong typing, extended error trapping and the ability to pass a variable number of parameters to a subroutine have been removed - but mainly because, apart from being easy to learn, royalties need not be paid to Microsoft by implementers as long as the VBScript trade mark is acknowledged. By contrast, when an organization licenses Visual Basic for Applications (VBA) from Microsoft - as companies such as Autodesk, StatSoft, Great Plains Accounting and Visio (subsequently acquired by Microsoft) have done - it is allowed to redistribute the full VBA code-writing and debugging environment with its product.","When employed for client-side web development in Microsoft Internet Explorer, VBScript is similar in function to JavaScript. It is used to write executable functions that are embedded in or included from HTML pages and interact with the Document Object Model (DOM) of the page, to perform tasks not possible in HTML alone. However, other web browsers such as Firefox and Opera do not have built-in support for VBScript. This means that where client-side scripting and cross-browser compatibility are required, developers usually choose JavaScript over VBScript.","VBScript is also used for server-side processing of web pages, most notably with Microsoft Active Server Pages (ASP). The ASP engine and type library, asp.dll, invokes vbscript.dll to run VBScript scripts. VBScript that is embedded in an ASP page is contained within  context switches. The following example of an ASP page with VBScript displays the current time in 24-hour format (Note that an '=' sign occurring after a context switch (","VBScript can also be used to create applications that run directly on a workstation running Microsoft Windows. The simplest example is a script that makes use of the Windows Script Host (WSH) environment. Such a script is usually in a stand-alone file with the file extension .vbs. The script can be invoked in two ways. Wscript.exe is used to display output and receive input through a GUI, such as dialog and input boxes. Cscript.exe is used in a command line environment.","VBScript can be included in two other types of scripting files: Windows Script Files, and HTML Applications.","A Windows Script File (WSF) is styled after XML. A WSF file can include multiple VBS files. As a result WSF files provide a means for code reuse: one can write a library of classes or functions in one or more .vbs files, and include those files in one or more WSF files to use and reuse that functionality in a modular way. The files have extension .wsf and can be executed using wscript.exe or cscript.exe, just like a .vbs file.","An HTML Application (HTA) is styled after HTML. The HTML in the file is used to generate the user interface, and a scripting language such as VBScript is used for the program logic. The files have extension .hta and can be executed using mshta.exe.","VBScript (and JScript) can also be used in a Windows Script Component - an ActiveX-enabled script class that can be invoked by other COM-enabled applications. These files have extension .wsc.","The language of VBScript is modelled on Visual Basic, and therefore can be reviewed using similar categories: procedures, control structures, constants, variables, user interaction, array handling, date\/time functions, error handling, mathematical functions, objects, regular expressions, string manipulation, and so on.","The following are some key points of introduction to the VBScript language.","A “procedure” is the main construct in VBScript for separating code into smaller modules. VBScript distinguishes between a function, which can return a result in an assignment statement, and a subroutine, which cannot. Parameters are positional, and can be passed by value or by reference.","Control structures include the usual iterative and conditional Do Loops, If-Then-Else statements, and Case statements, with some more complex variants, such as ElseIf and nested control structures.","As a memory aid in coding, and certainly for readability, there are a large number of constants, such as True and False for logical values, vbOKCancel and vbYesNo for MsgBox codes, vbBlack and vbYellow for color values, vbCR for the carriage return character, and many others.","Variables by default have “Variant” type, but it is possible (and sometimes necessary) to force a particular type (integer, date, etc.) using conversion functions (Cint, CDate, etc.)","User interaction is provided through the functions MsgBox and InputBox which provide a simple dialogue box format for messages and input. Both functions display prompting messages, with the former returning a standard response, and the latter returning one user-supplied text or numeric value. For more elaborate GUI interaction with controls, VBScript can be used in combination with HTML, for example, in an HTML Application. Event-driven forms are not supported as in Visual Basic or Visual Basic for Applications.","Names are not case sensitive therefore, for example, MsgBox and msgbox, or FileSystemObject and filesystemobject, are treated as the same name. However, as usual, it is considered a best practice of VBScript style to be consistent and to capitalize judiciously.","File system management, file modification, and streaming text operations are implemented with the Scripting Runtime Library scrrun.dll. This provides objects such as FileSystemObject, File, and TextStream, which expose the Windows File System to the programmer.","Binary file and memory I\/O is provided by the \"ADODB.Stream\" class, which can also be used as a string builder (since a high amount of VBScript string concatenation is costly due to constant memory re-allocation), and can be used to convert an array of bytes to a string and vice versa. Database access is made possible through ActiveX Data Objects (ADO), and the IIS Metabase can be manipulated using the GetObject() function with sufficient permissions (useful for creating and destroying sites and virtual directories). XML files and schemas can be manipulated with the Microsoft XML Library Application Programming Interfaces (msxml6.dll, msxml3.dll), which also can be used to retrieve content from the World Wide Web via the XMLHTTP and ServerXMLHTTP objects (class strings \"MSXML2.XMLHTTP.6.0\" and \"MSXML2.ServerXMLHTTP.6.0\", respectively).","Functionality can also be added through ActiveX technologies. Security concerns have led to many ActiveX controls being blacklisted in the Internet Explorer process by Microsoft, which deploys the killbit via monthly Windows security updates to disable vulnerable Microsoft and third party code.","Microsoft does not routinely make available an IDE (Integrated Development Environment) for VBScript, although the Microsoft Script Editor has been reported. However, there are VBScript debuggers available from third-party sources,and there is syntax high-lighting either for VBScript or languages with similar syntax in many editors in the list of text editors. Apart from this, any text editor can be used to create a VBScript program; the important thing is to give the text file the necessary file extension.","During execution, when an error occurs, the script host reports an error message stating the error type (e.g. “syntax error”) together with the line number and position within the line where the error occurred.","The “simplest” example:","Save it as a .vbs file. Then execute using cscript.exe or wscript.exe.","A more elaborate example, showing the use of MsgBox as a function (returning a result), and the use of three parameters, including the use of constants in the second parameter.","The first three lines all produce the same result. For clarity, the numbers in the second parameter are written as an explicit summation (that is, with a \"+\"), rather than presented as a single number (in this example, 4161). However, the use of constants as in the third line is considered best practice. Different constants will produce different behaviours; for example, vbOKCancel specifies two buttons in the dialogue box, whereas vbYesNoCancel would specify three buttons (Yes, No, and Cancel).","VBScript can access WMI (Windows management instrumentation) for instance the Windows Task Manager. The code below, when executed, would terminate (“kill”) any process involving ’’notepad.exe’’.","The use of Option Explicit is not required, but is considered a best practice for VBScript.","The SendKeys method sends one or more keystrokes to the active window (as if typed on the keyboard). In this example the script sends the characters “Hello World!” three times, each time pausing for 2 seconds (2000 milliseconds).","The code should be saved as whatever.vbs, then executed using cscript.exe or wscript.exe in a command window. During execution, the characters “Hello World!” will be displayed after the command prompt.","Example of using the supplied object FileSystemObject for some file operations (such as testing if a file exists), and also creating a text file (a TextStream object, one of whose methods is WriteLine). The name of the file is passed as a parameter by reference (which is the default, although this does not matter in this example).","The subroutine MakeHelloWorldFile will create (or update, if it exists) a small text file in the root directory of the C:\\ drive, upon selecting “OK” in the MsgBox dialogue box."]}