{"name":"Visual Basic .NET","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Visual_Basic_.NET","description":["Visual Basic .NET (VB.NET), is an object-oriented computer programming language that can be viewed as an evolution of the classic Visual Basic (VB), which is implemented on the .NET Framework. Microsoft currently supplies two main editions of IDEs for developing in Visual Basic: Microsoft Visual Studio 2010, which is commercial software and Visual Basic Express Edition 2010, which is free of charge. The command-line compiler, VBC.EXE, is installed as part of the freeware .NET Framework SDK. Mono also includes a command-line VB.NET compiler.","There are 5 versions of Visual Basic .NET implemented by the Visual Basic team.","The first version of Visual Basic .NET, which runs on .NET framework 1.0. The most important feature is Managed code, which contrasts with Visual Basic 6.0 and before.","Visual Basic .NET 2003 was released with version 1.1 of the .NET Framework. New features included support for the .NET Compact Framework and a better VB upgrade wizard. Improvements were also made to the performance and reliability of the .NET IDE (particularly the background compiler) and runtime. In addition, Visual Basic .NET 2003 was available in the Visual Studio.NET Academic Edition (VS03AE). VS03AE is distributed to a certain number of scholars from each country without cost.","Visual Basic 2005 was the name used to refer to Visual Basic .NET, as Microsoft decided to drop the .NET portion of the title.","For this release, Microsoft added many features, including:","The above functions (particularly My) are intended to reinforce Visual Basic .NET's focus as a rapid application development platform and further differentiate it from C#.","Visual Basic 2005 introduced features meant to bridge the gaps between itself and other \"more powerful\" .NET languages, adding:","One other feature of Visual Basic 2005 is the IsNot operator that makes 'If X IsNot Y' equivalent to 'If Not X Is Y, which gained notoriety when it was found to be the subject of a Microsoft patent application.","Visual Basic 9.0 was released together with the Microsoft .NET Framework 3.5 on 19 November 2007.","For this release, Microsoft added many features, including:","In April 2010, Microsoft released Visual Basic 2010. Microsoft had planned to use the Dynamic Language Runtime (DLR) for that release but shifted to a co-evolution strategy between Visual Basic and sister language C# to bring both languages into closer parity with one another. Visual Basic's innate ability to interact dynamically with CLR and COM objects has been enhanced to work with dynamic languages built on the DLR such as IronPython and IronRuby. The Visual Basic compiler was improved to infer line continuation in a set of common contexts, in many cases removing the need for the \"_\" line continuation character. Also, existing support of inline Functions was complemented with support for inline Subs as well as multi-line versions of both Sub and Function lambdas.","Whether Visual Basic .NET should be considered as just another version of Visual Basic or a completely different language is a topic of debate. This is not obvious, as once the methods that have been moved around and that can be automatically converted are accounted for, the basic syntax of the language has not seen many \"breaking\" changes, just additions to support new features like structured exception handling and short-circuited expressions. Two important data type changes occurred with the move to VB.NET. Compared to VB6, the Integer data type has been doubled in length from 16 bits to 32 bits, and the Long data type has been doubled in length from 32 bits to 64 bits. This is true for all versions of VB.NET. A 16-bit integer in all versions of VB.NET is now known as a Short. Similarly, the Windows Forms GUI editor is very similar in style and function to the Visual Basic form editor.","The version numbers used for the new Visual Basic (7, 7.1, 8, 9, ...) clearly imply that it is viewed by Microsoft as still essentially the same product as the old Visual Basic.","The things that have changed significantly are the semantics—from those of an object-based programming language running on a deterministic, reference-counted  engine based on COM to a fully object-oriented language backed by the .NET Framework, which consists of a combination of the Common Language Runtime (a virtual machine using generational garbage collection and a just-in-time compilation engine) and a far larger class library. The increased breadth of the latter is also a problem that VB developers have to deal with when coming to the language, although this is somewhat addressed by the My feature in Visual Studio 2005.","The changes have altered many underlying assumptions about the \"right\" thing to do with respect to performance and maintainability. Some functions and libraries no longer exist; others are available, but not as efficient as the \"native\" .NET alternatives. Even if they compile, most converted VB6 applications will require some level of refactoring to take full advantage of the new language. Documentation is available to cover changes in the syntax, debugging applications, deployment and terminology.","The following simple example demonstrates similarity in syntax between VB and VB.NET. Both examples pop up a message box saying \"Hello, World\" with an OK button.","A VB.NET example, MsgBox or the MessageBox class can be used:","The following example demonstrates a difference between VB6 and VB.NET. Both examples close the active window.","Classic VB Example:","A VB.NET example:","The 'cmd' prefix is replaced by the 'btn' prefix, conforming to the new convention previously mentioned.","Visual Basic 6 did not provide common operator shortcuts. The following are equivalent:","VB6 Example:","VB.NET example:","Long-time Visual Basic users have complained about Visual Basic .NET because initial versions dropped a large number of language constructs and user interface features that were available in VB6 (which is no longer sold by Microsoft), and changed the semantics of those that remained; for example, in VB.NET parameters are (by default) passed by value, not by reference. Detractors refer pejoratively to VB.NET as Visual Fred or DOTNOT. On 8 March 2005, a petition was set up in response to Microsoft's refusal to extend its mainstream support for VB6.","VB.NET's supporters state that the new language is in most respects more powerful than the original, incorporating modern object oriented programming paradigms in a more natural, coherent and complete manner than was possible with earlier versions. Opponents tend to respond that although VB6 has flaws in its object model, the cost in terms of redevelopment effort is too high for any benefits that might be gained by converting to VB.NET.[citation needed]","It is simpler to decompile languages that target Common Intermediate Language (CIL), including VB.NET, compared to languages that compile to machine code. Tools such as .NET Reflector can provide a close approximation to the original code due to the large amount of metadata provided in CIL.[citation needed] This is also true of early versions of Visual Basic (prior to VB5), which could not compile to native code.","Microsoft supplies an automated VB6-to-VB.NET converter with Visual Studio .NET, which has improved over time, but it cannot convert all code, and almost all non-trivial programs will need some manual effort to compile. Most will need a significant level of code refactoring to work optimally. Visual Basic programs that are mainly algorithmic in nature can be migrated with few difficulties; those that rely heavily on such features as database support, graphics, unmanaged operations or on implementation details are more troublesome.[citation needed] Other syntactical differences relate to changes made to bring VB.Net into alignment with other .Net languages, such as zero-based arrays (all .Net arrays are 0 to n-1 subscript, whereas classic VB arrays were one-based by default, 1 to n subscript), and structured exception handling (classic VB used a proprietary ON ERROR mechanism); such changes can be difficult or impossible to convert automatically, and converters typically flag such problem areas for manual conversion.","In addition, the required runtime libraries for VB6 programs are provided with Windows 98 SE and above, while VB.NET programs require the installation of the significantly larger .NET Framework. The framework is included with Windows 7, Windows Vista, Windows XP Media Center Edition, Windows XP Tablet PC Edition, Windows Server 2008 and Windows Server 2003. For other supported operating systems such as Windows 2000 or Windows XP (Home or Professional Editions), it must be separately installed.","Microsoft's response to developer dissatisfaction focused around making it easier to move new development and shift existing codebases from VB6 to VB.NET. An offering in 2005 was the VBRun website, offering code samples and articles for:","The creation of open-source tools for VB.NET development have been slow compared to C#, although the Mono development platform provides an implementation of VB.NET-specific libraries and a VB.NET 8.0 compatible compiler written in VB.NET, as well as standard framework libraries such as Windows Forms GUI library.","SharpDevelop and MonoDevelop are open-source alternative IDEs.","The following is a very simple VB.NET program, a version of the classic \"Hello world\" example created as a console application:","The effect is to write the text Hello, world! to the command line. Each line serves a specific purpose, as follows:","This is a module definition, a division of code similar to a class, although modules can contain classes. Modules serve as containers of code that can be referenced from other parts of a program.\nIt is common practice for a module and the code file, which contains it, to have the same name; however, this is not required, as a single code file may contain more than one module and\/or class definition.","This is the entry point where the program begins execution.Sub is an abbreviation of \"subroutine.\"","This line performs the actual task of writing the output. Console is a system object, representing a command-line interface and granting programmatic access to the operating system's standard streams. The program calls the Console method WriteLine, which causes the string passed to it to be displayed on the console. Another common method is using MsgBox (a Message Box).","This piece of code is a solution to Floyd's Triangle:"]}