{"name":"Visual DialogScript","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Visual_DialogScript","description":["Visual DialogScript (VDS) is an interpreted programming language for Microsoft Windows. It can be used to create small, fast programs. VDS has a large number of dialog and graphical elements available to create professional looking programs. VDS programs have access to the Windows API; therefore, it is possible to write applications that can perform the same advanced tasks as other programming languages such as Visual Basic, C++, or Delphi.","Unlike other programming languages, the syntax of VDS is very simple. Each command occupies one line, and has a plain English name that clearly describes its purpose. Variables are typeless, and can hold many kinds of information, for example, numbers or text. Functions are clearly distinguishable with names that start with '@', just like a spreadsheet.","The DialogScript language has a simple syntax not unlike MS-DOS batch language. It is designed for ease of use and efficiency when being interpreted by the run-time engine. There are 10 system variables, %0 to %9, which initially have the script file name in %0 and command line parameters in %1 through %9, just as in a batch file. There are also a further 26 user variables, %A to %Z. The contents of all variables (including system ones) can be changed once the script is running. There are now also 4032 global variables. These variables begin with %%, a letter, then alphanumerics plus underscores (e.g. %%my_variable_1.) There is no limit on the length of these user-defined variable names.","Comments:","Simple Information Message Box:","Simple Warning Message Box:","Create a custom dialog box:","Write to the Windows Registry:","Display an input prompt dialog box, storing the result in the variable %A:","Visual DialogScript was originally created by Julian Moss of JM-Tech. Eventually, S.A.D.E. s.a.r.l., a French company, took over ownership and development of VDS, altering and improving upon its syntax. Currently, VDS is owned and developed by the British company Commercial Research Ltd.","Several versions of VDS have been released over time:","There are several versions available for download:"]}