{"name":"Vvvv","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/Vvvv","description":["vvvv (commonly pronounced German pronunciation: [fiːɐ̯ faʊ] (vier V) meaning \"4 v's\" in German or German pronunciation: [faʊ fiːɐ̯] (V vier) meaning \"v4\" in German) is a general purpose toolkit with a special focus on real-time video synthesis and programming large media environments with physical interfaces, real-time motion graphics, audio and video. VVVV uses a data flow approach and a visual programming interface for rapid prototyping and developing. Applications written in vvvv are commonly called patches. Patches consist of a network of nodes. Patches can be created, edited and tested while they are running. Patches are stored on the disk in standard XML format. VVVV is written in Borland Delphi, plugins can be developed in the .NET Framework in C#.","Most nodes handle data in a one dimensional array of values, called Spreads. In addition to traditional vector algebra this allows very intuitive programming of particle systems, as also rendering nodes and deal with arrays of values accordingly. If an operation has to deal with arrays of different lengths, the shorter array gets repeated to fill up the larger.","VVVV includes a feature it calls boygrouping, where one computer controls a number of slave computers to operate in parallel, with all programming and editing is done on the master computer.","An important feature is the ability to work with HLSL Shaders which are written in their common textual form but are embedded in the data flow language and are instantly compiled and uploaded as soon any part of their source code is changed.","With a focus on video synthesis and processing, VVVV uses the toolkit DirectX and, as such, is available for Microsoft Windows systems only, although it is known to run stably under Parallels and VMWare Fusion. VVVV currently supports DirectX 9 (including PS 3 and VS 3 shader techniques).","VVVV was initially developed by the Frankfurt-based media collective MESO as an in-house tool for their own projects, but was then released on the web-page and quickly grew into something bigger. VVVV is now maintained by the VVVV group.","VVVV is free for non-commercial use and available for download at its website. Any commercial uses require a license.",""]}