{"name":"WebDNA","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/WebDNA","description":["WebDNA is a server-side scripting, interpreted language with an embedded database system, specifically designed for the World Wide Web and recently released as a freeware (FastCGI version). Its primary use is in creating database-driven dynamic web page applications. Released in 1995, the name was registered as a trademark in 1998. WebDNA is currently maintained by WebDNA Software Corporation.","WebDNA contains a ram-resident database system (Hybrid In-memory database) that has searching and editing capabilities. A resilient and persistent backup of the RAM databases is maintained to disk. WebDNA code can interweaves with css, html\/html5 and js\/ajax, allowing to mix layout with programming and sever-side with client-side scripting. Some instructions allow to interact with remote servers. It is usually considered as an easy-to-learn scripting language and has been designed for webmasters, webdesigners and programmers looking for quick results.","WebDNA is made up of a syntax that uses square brackets (\"[\" \"]\") and the English language. For example, to display today's date on a web page, simply insert \"[date]\" within the HTML or CSS code where you want the live date to appear; likewise with \"[time]\". To show some text only to a specific client IP address request, the 'showif' context can be used: [showif [ipaddress]=xxx.xxx.xxx.xxx]Some Text[\/showif]. Most WebDNA tags, contexts and commands follow similar conventions.","The WebDNA syntax is based on a simple format:","WebDNA instructions are based on 2 types:","Parameters can be included in many of the Tags, Contexts or Commands.","Example Code (connects to a whois server and shows the information, then stores it into a permanent database)","According to Grant Hulbert, one of the Pacific Coast Software founders, WebCatalog (now WebDNA) began as a set of C macros to help accomplish website graphical tasks.","WebCatalog began its mid-1990s public debut on the Macintosh platform. As its name implies, it had an early development focus that allowed a web master or store administrator to migrate a traditional product catalog to an online catalog. This was most evident in 1997 and 1998 with its StoreBuilder and WebMerchant products that allowed for a user to quickly build a store front online. The term \"WebCatalog\" referred to the entire product, where the term \"WebDNA\" referred to the scripting syntax only.","Around the year 2000, WebCatalog and Pacific Coast Software were purchased by Smith Micro Software, Inc. Smith Micro Software, Inc. then changed the name of WebCatalog to WebDNA, which at that point became a name that referenced all aspects of the product. Starting with the release of WebDNA version 4.0 and ending with version 6.0a, the years 1999 to 2004 were very active years for WebDNA and the scripting language was adopted by many national and international names, including Ben and Jerry's, the Pillsbury Dough Boy Shop, the NCAA Final Four and the Museum of Television and Radio. Also during this time, development of the language gained contemporary tools, such as [function] and [scope], that lend themselves to Modular programming and Structured programming.","From 2005 to 2008, for perhaps various reasons including the success of Smith Micro Software with other products, WebDNA users began to lose support from the owners and the language went into decline. WebDNA lost many of its users who then opted for free solutions like PHP and MySQL. The fate of WebDNA was unknown during these years and it was ultimately the developers of WebDNA who revived the language.","In June 2008, a few WebDNA developers formed together and organized to establish the company, WebDNA Software Corporation (WSC). WSC purchased the intellectual property that is WebDNA, and in 2009, WSC released WebDNA version 6.2 (Cicada).","In December 2011, a new FastCGI version replacing the apache module was released, improving compatibility, speed, and for the first time, offering WebDNA as freeware. The current version is WebDNA 7.1 (March 2012)"]}