{"name":"XC","aliases":[],"wiki":"http:\/\/en.wikipedia.org\/wiki\/XC_Programming_Language","description":["The XC Programming Language is a computer programming language developed in 2005 by Douglas Watt and David May at XMOS.","XC is an imperative programming language with a computational framework based on C. XC programs consist of functions that execute statements that act upon values stored in variables. Control-flow statements express decisions, and looping statements express iteration.","The language was designed to exploit the XMOS processor architecture, but is a general-purpose language and implementations for other architectures are in construction[citation needed]. Running XC on other platforms is currently supported by highly-optimised interpretation of the XMOS instruction set.","One of the most unusual features of XC is the inclusion of timers and ports in a high-level programming language. One of the great historical weaknesses of high-level programming languages - particularly those based on formal theoretical frameworks such as process calculi or those based on functional programming - is the inability to combine clean high-level constructs with efficient and safe input-output.","The following is the XC source for the Hello World program.","The language permits explicit parallelism, as well as parallel replication.","Concurrent processes can communicate using channels.","Edsger Dijkstra's guarded commands also feature.","More unconventionally, the language includes the use of ports - which can be used to directly control hardware pins from high-level software.","The language design was heavily influenced by Communicating Sequential Processes - a process algebra developed by Tony Hoare, and therefore includes explicit parallelism and channel communication. Edsger Dijkstra can also claim an influence with the inclusion of guarded commands.","Because of its relations to CSP, the framework for modelling from CSP can be used to reason about XC programs.","As a result the language bears semantic (though not structural) similarities to languages such as occam. This is not surprising as one of the XC language designers was David May who also created occam."]}